[
  {
    "id": "1",
    "text": "Ăn quả nhớ kẻ trồng cây",
    "meaning": "Nghĩa đen: Mỗi người khi được thưởng thức hoa thơm quả ngọt, hãy nhớ đến người đã vun trồng, chăm sóc cây cối. Nghĩa bóng: Câu tục ngữ nhắc nhở con người sống cần có lòng biết ơn. Khi được hưởng một thành quả nào đó, cần phải trân trọng công lao của những người đã tạo ra nó, nhận được sự giúp đỡ của người khác cần phải biết ơn."
  },
  {
    "id": "2",
    "text": "Ao sâu tốt cá",
    "meaning": "Câu tục ngữ nói về quy luật của thiên nhiên là ở những cái ao sâu thường có cá lớn. Trong một môi trường, hoàn cảnh thuận lợi cho sự phát triển sẽ tạo ra những con người có nhân cách đạo đức, có ý chí và khao khát lớn. Những con người ấy sẽ gặt hái được thành công trong cuộc sống của mình."
  },
  {
    "id": "3",
    "text": "Ăn kĩ no lâu, cày sâu tốt lúa",
    "meaning": "Nghĩa đen: Chúng ta nhai kĩ sẽ có cảm giác no lâu; còn khi cày xới đất sâu thì lúc cấy lúa, cây lúa mới tốt tươi. Nghĩa bóng: Câu tục ngữ là kinh nghiệm của người xưa về cách cấy lúa: đó là phải cày đất sâu; qua đó nhắn nhủ mọi người khi làm một việc nào đó, cần phải kiên nhẫn, tỉ mỉ, cẩn thận."
  },
  {
    "id": "4",
    "text": "Ăn trông nồi, ngồi trông hướng",
    "meaning": "“Ăn trông nồi” đề cập đến việc chúng ta ăn uống như thế nào cho đúng mực, hợp hoàn cảnh. Lúc ngồi trong bàn ăn với người nhỏ hơn, người bằng tuổi hay người lớn cũng đều phải nhìn xem mình đã ăn uống đúng cách hay chưa. Ăn quá nhiều, ăn hết phần của người khác, hoặc ăn mà không xem thử mọi người có đang dùng thức ăn hay không, đều là những cách ăn chưa phù hợp. “Ngồi trông hướng” nhắc nhở chúng ta trong lúc ngồi ăn cần xem lại mình đang ngồi ở vị trí có phù hợp hay chưa, đặc biệt là khi có người lớn tuổi hơn. Không chỉ trong mâm ăn, mà những nơi khác như chốn đông người, trên các phương tiện công cộng, hay nơi làm việc,… đều cần tự nhắc mình về ý thức trong việc đi, đứng, ngồi tùy vào vị trí và vị thế của ta."
  },
  {
    "id": "5",
    "text": "Ăn có mời, làm có khiến",
    "meaning": "Ăn có mời là một nét đẹp trong văn hóa ăn uống. Biết kính trên, nhường dưới, biết mời mọi người trước khi ăn cũng thể hiện sự lịch sự thiết yếu nhất mà trong văn hóa ứng xử mọi người nên có. “Làm có khiến” là ẩn dụ thể hiện cách cư xử đúng mực về vai trò và bổn phận trách nhiệm của mỗi người cần có, không nên tranh giành làm những việc không phải của mình, vì khi nhận những công việc không phù hợp, khó để đảm đương sẽ rất dễ gây ra những hệ lụy không đáng có. Câu tục ngữ tựu chung là muốn nói về vấn đề cách cư xử chuẩn mực, mực thước mà mỗi người cần trang bị cho cuộc sống của bản thân mình."
  },
  {
    "id": "6",
    "text": "Ai ơi đừng bỏ ruộng hoang Bao nhiêu tấc đất, tấc vàng bấy nhiêu",
    "meaning": "Câu ca dao khuyên mọi người nên biết quý trọng đất đai và nên cần cù lao động, chăm chỉ tham gia sản xuất để có được một cuộc sống đủ đầy."
  },
  {
    "id": "7",
    "text": "Ăn như hùm đổ đó",
    "meaning": "Câu tục ngữ bắt nguồn từ chuyện hùm (hổ) kiếm ăn. Khi không kiếm được mồi, hùm thường mò đến chỗ nước chảy, ở đây người dân thường dùng đó để đơm cá. Khi tìm thấy đó cá, hùm không bắt riêng từng con để ăn mà dốc ngược đó để trút toàn bộ cá vào miệng. Nếu người nào, không gắp từng miếng mà bưng cả bát trút vào miệng thì nhân dân ta thường dùng tục ngữ này để ám chỉ. Hiểu rộng ra, câu này dùng để chỉ cách ăn uống thô tục, thiếu văn hóa."
  },
  {
    "id": "8",
    "text": "Ăn có nơi, làm có buổi",
    "meaning": "Câu tục ngữ nhắc nhở con người ăn uống phải đàng hoàng, hẳn hoi, có nơi có chốn, không ăn đầu đường xó chợ, làm việc cũng làm có buổi, có giờ đàng hoàng, làm có kế hoạch, không nên giờ nào cũng làm, tránh mệt người, không hoàn thành được công việc khác."
  },
  {
    "id": "9",
    "text": "Ăn cây nào rào cây ấy.",
    "meaning": "Nghĩa đen: Khi ta ăn quả của cây nào, ta phải rào chắn cho cây ấy thật cẩn thận. Nghĩa bóng: Câu tục ngữ khuyên chúng ta cần sống biết ơn. Khi hưởng thành quả, nhận được sự giúp đỡ từ bất kì ai, ta cũng cần trân trọng, cảm tạ, nhớ tới công lao của họ."
  },
  {
    "id": "10",
    "text": "Ân cha nặng lắm cha ơi! Nghĩa mẹ bằng trời chín tháng cưu mang.",
    "meaning": "Bài ca dao diễn tả lòng biết ơn, kính trọng của con cái đối với cha mình vì những công lao, sự nuôi dưỡng chăm sóc mà cha mang lại, cũng như tình yêu và lòng hiếu thảo vô điều kiện của mẹ đối với con."
  },
  {
    "id": "11",
    "text": "Ăn vóc học hay.",
    "meaning": "Câu tục ngữ mang hàm ý: chỉ khi ta ăn đủ chất, ăn nhiều, chăm lo đến sức khỏe của mình thì mới có sức để học được nhiều điều mới mẻ, thú vị và đạt được kết quả cao."
  },
  {
    "id": "12",
    "text": "Anh em thuận hòa là nhà có phúc.",
    "meaning": "Câu tục ngữ đề cao vai trò của tình anh em, chị em trong nhà. Gia đình chỉ hạnh phúc khi anh em, chị em trong nhà sống hòa thuận với nhau."
  },
  {
    "id": "13",
    "text": "Anh em nào phải người xa, Cùng chung bác mẹ một nhà cùng thân.",
    "meaning": "Bài ca dao khẳng định anh chị em trong gia đình là mối quan hệ gần gũi, gắn bó vì vậy phải biết yêu thương, hòa thuận với nhau để cha mẹ vui lòng, gia đình hạnh phúc."
  },
  {
    "id": "14",
    "text": "Ai đi cách trở sơn khê, Nhớ tô mì Quảng, tình quê mặn nồng.",
    "meaning": "Bài ca dao khẳng định tình cảm của người dân xứ Quảng dành cho quê hương. Qua đó nhắc nhở con người dù đi xa đến đâu chăng nữa cũng đều phải nhớ đến cội nguồn."
  },
  {
    "id": "15",
    "text": "Anh em như thể tay chân.",
    "meaning": "Câu tục ngữ nhắn nhủ tới mọi người cần phải sống gắn bó, chan hòa với các anh, chị, em trong nhà, giống như tay và chân luôn gắn chặt với nhau."
  },
  {
    "id": "16",
    "text": "Anh em bốn bể là nhà Người dưng khác họ vẫn là anh em",
    "meaning": "Câu ca dao thể hiện quan niệm về tình yêu thương, sự đùm bọc giữa con người trong xã hội. Nó đề cao tinh thần đoàn kết, tương thân tương ái, coi trọng tình cảm hơn huyết thống. Con người dù ở đâu, làm gì cũng cần phải gắn bó, yêu thương, giúp đỡ lẫn nhau, tạo nên một cộng đồng gắn kết, hòa bình và hạnh phúc."
  },
  {
    "id": "17",
    "text": "Ai lên Phú Thọ thì lên Lên non cổ tích, lên đền Hùng Vương",
    "meaning": "Bài ca dao ngợi ca vẻ đẹp của đền Hùng, đồng thời nhắc nhở con người khắc ghi công lao của các vị vua Hùng đã dựng nước và giữ nước."
  },
  {
    "id": "18",
    "text": "Ai về thăm đất Ninh Bình, Mà xem phong cảnh hữu tình nên thơ",
    "meaning": "Bài ca dao ca ngợi vẻ đẹp của Ninh Bình, một vùng đất có lịch sử hào hùng và thiên nhiên kỳ vĩ. Từ đó, bài ca dao thể hiện tình yêu quê hương, niềm tự hào dân tộc. Đồng thời, đây cũng là một lời thổ lộ tình cảm của người viết với người yêu, một cô gái có tên Dục Thúy, một tên gọi khác của núi Ninh Bình."
  },
  {
    "id": "19",
    "text": "Ai ơi cứ ở cho lành, Tu thân tích đức để dành về sau.",
    "meaning": "Câu ca dao ngợi ca những đức tính, phẩm chất tốt của con người. Từ đó, khuyên nhủ con người nên rèn luyện đạo đức tốt và sống lương thiện để tích đức cho con cháu đời sau."
  },
  {
    "id": "20",
    "text": "Ăn không thì hóc, chẳng xay thóc phải ẵm em",
    "meaning": "Có ăn thì phải có làm, ăn mà không làm giống như mắc xương trong cổ họng. Ăn rồi thì không làm việc nặng nhọc như xay thóc, giã gạo thì cũng phải bế em."
  },
  {
    "id": "21",
    "text": "Anh em như thể chân tay Rách lành đùm bọc, dở hay đỡ đần",
    "meaning": "Câu ca dao thể hiện tình cảm gắn bó, khăng khít, không thể tách rời của anh em ruột thịt, cùng nhau chia ngọt sẻ bùi"
  },
  {
    "id": "22",
    "text": "Ai lên Đồng Tỉnh, Huê Cầu Đồng Tỉnh bán thuốc, Huê Cầu nhuộm thâm",
    "meaning": "Bài ca dao ngợi ca nghề truyền thống, phong tục nhuộm vải của người dân Hưng Yên, qua đó cũng khuyên nhủ con người nên tiếp tục gìn giữ và phát huy những nét đẹp truyền thống mà cha ông ta đã để lại."
  },
  {
    "id": "23",
    "text": "Ai giàu ba họ, ai khó ba đời",
    "meaning": "Ý cả câu muốn thể hiện rằng không ai giàu cả ba họ, cũng chẳng có ai nghèo khó luôn cả ba đời, sự giàu nghèo xảy ra không riêng gì ai, tất cả là do tính cách, ý chí, lối sống của con người quyết định rằng bản thân sẽ được sung túc, giàu sang hay nghèo đói, khốn khổ."
  },
  {
    "id": "24",
    "text": "Áo năng thay năng mới, người năng tới năng thân",
    "meaning": "Cũng một chiếc áo nhưng nếu thường xuyên được thay ra để giặt giũ, chăm sóc, thay đổi thì luôn bền đẹp (tựa áo mới); giống như quan hệ giữa người với người, năng lui tới thăm hỏi (quan tâm đến nhau) sẽ tạo nên tình cảm thân thiết"
  },
  {
    "id": "25",
    "text": "Ai ơi chớ vội cười nhau, Ngẫm mình cho kỹ trước sau hãy cười",
    "meaning": "Câu ca dao khuyên chúng ta không nên vội vàng chế giễu, chê bai người khác. Đồng thời, nhắc nhở chúng ta trước khi cười người khác, hãy dành thời gian suy ngẫm về bản thân mình. Liệu chúng ta đã hoàn hảo chưa? Liệu chúng ta có những khuyết điểm nào mà người khác chưa từng biết đến? Việc tự nhận thức bản thân giúp chúng ta trở nên khiêm tốn hơn và có cái nhìn bao dung hơn đối với người khác."
  },
  {
    "id": "26",
    "text": "Ai đua sông Trước thì đua Sông Sau có miếu thờ vua thì đừng",
    "meaning": "Câu ca dao bày tỏ lòng kính yêu, nhớ tiếc ba vua Tây Sơn, đồng thời nhắc nhở con người luôn luôn ghi nhớ công ơn của các vị anh hùng."
  },
  {
    "id": "27",
    "text": "Anh về cuốc đất trồng cau, Cho em trồng ghé cây trầu một bên",
    "meaning": "Bài ca dao thể hiện một tình yêu có sự chăm sóc và hy vọng. Nó tạo ra một hình ảnh về việc chung tay xây dựng và phát triển mối quan hệ để tạo ra một tương lai tốt đẹp. Ý nghĩa chung của bài là về sự hy vọng và mục tiêu chung trong mối quan hệ, và sự tương hỗ và quan tâm từ hai bên để tạo ra một tổ ấm và hạnh phúc lâu dài."
  },
  {
    "id": "28",
    "text": "Ai về đến huyện Đông Anh, Ghé xem phong cảnh Loa Thành Thục Vương.",
    "meaning": "Câu ca dao khẳng định vẻ đẹp và giá trị trường tồn của thành Cổ Loa, đồng thời khuyên nhủ con người cần bảo tồn những giá trị truyền thống."
  },
  {
    "id": "29",
    "text": "Ăn quả nhớ kẻ trồng cây Có danh có vọng nhớ thầy khi xưa.",
    "meaning": "Câu ca dao muốn nhắn gửi tới mọi người cần phải nhớ tới công lao của thầy cô sau khi đã công thành danh toại; cũng như việc nhớ tới sự vất vả của người trồng cây sau khi ăn những trái ngọt."
  },
  {
    "id": "30",
    "text": "Ai biết sông Lam Răng là trong, là đục?",
    "meaning": "Bài ca dao nói lên phẩm chất, cốt cách của con người xứ Nghệ dẫu có truân chuyên, khốn khó nhưng luôn thủy chung, luôn gắn bó nghĩa tình với quê hương, đất nước. Đồng thời bài ca dao khuyên nhủ con người phải yêu, gắn bó thủy chung với cội nguồn, quê hương."
  },
  {
    "id": "31",
    "text": "Ai chồng ai vợ mặc ai, Bao giờ ra bảng ra bài mới hay.",
    "meaning": "Bài ca dao trên nhắc nhở chúng ta về sự cân bằng, cùng nhau chia sẻ trách nhiệm, phát triển và hỗ trợ trong một mối quan hệ hôn nhân. Để xây dựng một mối quan hệ đồng đều và hạnh phúc, trong đó cả chồng và vợ đều đóng góp và cùng nhau chăm sóc và phát triển."
  },
  {
    "id": "32",
    "text": "Ai làm cho bướm lìa hoa, Cho chim xanh nỡ bay qua vườn hồng",
    "meaning": "Bài ca dao này thể hiện một trạng thái tình yêu đau khổ và không thể đạt được niềm vui trong tình yêu. Nó gợi lên hình ảnh của một tình yêu đã bị chia cắt và đánh mất do cảm xúc thay đổi. Ý nghĩa chung của đoạn thơ có thể là về sự tiếc nuối, sự mất mát và khát khao tình yêu trong cuộc sống."
  },
  {
    "id": "33",
    "text": "Ăn được ngủ được là tiên",
    "meaning": "Câu tục ngữ có ý nói người luôn ăn khỏe, ngủ ngon, không vướng lo nghĩ gì thì sẽ có sức khỏe tốt. Đó được coi là hạnh phúc lớn mà không phải ai cũng có được ở trên đời."
  },
  {
    "id": "34",
    "text": "Ai về Phú Thọ cùng ta, Vui ngày giỗ tổ tháng ba mùng mười.",
    "meaning": "Câu ca dao từ ngàn năm như lời nhắc nhở mỗi người dân Việt dù trong nước hay nước ngoài, dù miền ngược hay miền xuôi cũng đều luôn luôn ghi nhớ về ngày giỗ tổ Hùng Vương, nhớ lại lịch sử dựng nước và giữ nước đầy hào hùng của dân tộc ta, từ đó bày tỏ lòng biết ơn với tiên nguồn cội."
  },
  {
    "id": "35",
    "text": "Anh đi anh nhớ quê nhà Nhớ canh rau muống nhớ cà dầm tương",
    "meaning": "Bài ca dao là một lời tâm tình chân chất, mộc mạc của người con xa quê. Qua lời thơ giản dị, bài ca dao đã thể hiện nỗi nhớ quê hương da diết. Người con trai xa quê luôn nhớ về những điều bình dị, gần gũi nhất. Những hình ảnh tưởng chừng như tầm thường lại trở nên vô cùng quý giá, gợi nhắc về quê hương, về những người thân yêu đang ở lại. Đồng thời, nỗi nhớ quê hương không chỉ đơn thuần là nhớ cảnh, nhớ người mà còn là tình yêu quê hương sâu nặng, gắn bó."
  },
  {
    "id": "36",
    "text": "Anh em cốt nhục đồng bào, Vợ chồng là nghĩa lẽ nào chẳng thương.",
    "meaning": "Bài thơ này miêu tả về tình cảm gia đình của người Việt Nam, trong đó anh em và vợ chồng được coi là hai giá trị quan trọng và thiêng liêng nhất. Cụm từ \"Vợ chồng là nghĩa lẽ nào chẳng thương\" hàm ý rằng tình yêu, sự quan tâm, sự chăm sóc và sự hy sinh của vợ chồng cho nhau là điều rất tự nhiên và thiêng liêng trong tình cảm hôn nhân, không thể thiếu sót hay đặt câu hỏi tại sao."
  },
  {
    "id": "37",
    "text": "Anh em trong nhà, đóng cửa dạy nhau",
    "meaning": "Câu tục ngữ nói về cách đối nhân xử thế giữa những người anh em trong nhà, cùng máu mủ ruột thịt với nhau, cần phải biết nhường nhịn và giúp đỡ nhau. Khi xảy ra tranh cãi, không nên làm lớn chuyện, mà nên đóng cửa, nói với nhau nhỏ nhẹ, rồi từ từ giải quyết vấn đề."
  },
  {
    "id": "38",
    "text": "Ai về Hà Tĩnh thì về, Mặc lụa chợ Hạ, uống chè Hương Sơn.",
    "meaning": "Câu ca dao nói về đặc sản quê hương Hà Tĩnh như vải lụa, chè, đồng thời bộc lộ lòng yêu quê hương, đất nước."
  },
  {
    "id": "39",
    "text": "Áo chân cáy, váy chân sứa",
    "meaning": "Áo chân cáy là áo có gấu rách xác xơ như chân con cáy; váy chân sứa là váy có gấu rách tả tơi, trông như chân con sứa. Cả câu tục ngữ ý chỉ áp váy rách rưới tả tơi."
  },
  {
    "id": "40",
    "text": "Ai về em gửi bức tranh, Có con chim sáo đậu nhành lan chi",
    "meaning": "Bài ca dao này thể hiện sự nhớ nhung, hy vọng và lòng trung thành trong tình yêu, dù có phải đối mặt với sự chia ly và khó khăn. Nó thể hiện sự quyết tâm và mong muốn hòa giải và tái hợp trong mối quan hệ tình yêu."
  },
  {
    "id": "41",
    "text": "Ăn bát cơm dẻo, nhớ nẻo đường đi",
    "meaning": "Câu tục ngữ có ý nghĩa khuyên răn con người cần phải nhớ tới công lao của những người đã làm ra sản phẩm và nhớ tới công lao của cả những người đã đối xử tốt, giúp đỡ mình. Giống như khi ăn bát cơm dẻo, ta phải nhớ tới người nông dân cày cấy, nhớ tới hành trình làm ra hạt gạo."
  },
  {
    "id": "42",
    "text": "Ai là con cháu Rồng Tiên,  Tháng hai mở hội Trường Yên thì về.",
    "meaning": "Bài ca dao nhắc nhở con cháu nhớ về ngày hội Trường Yên để bày tỏ lòng thành kính với vua Đinh, vua Lê - những người có công dẹp loạn để thu non sông về một mối. Bên cạnh đó, tác giả dân gian còn ca ngợi mảnh đất Hoa Lư vô cùng thơ mộng, sơn thủy hữu tình như một bức tranh tuyệt đẹp."
  },
  {
    "id": "43",
    "text": "Ăn cá nhả xương, ăn đường nuốt chậm",
    "meaning": "Câu tục ngữ nhắn nhủ chúng ta ăn cá thì phải nhớ lừa và nhả xương, ăn đường tuy ngon ngọt nhưng cũng nên nuốt chậm kẻo nghẹn chết. Hiểu đơn giản, câu tục ngữ khuyên răn con người không nên ăn uống gấp gáp, nên từ tốn và cẩn thận, tránh hậu quả khôn lường."
  },
  {
    "id": "44",
    "text": "Ăn ít ngon nhiều",
    "meaning": "Câu tục ngữ có nghĩa là ăn ít thì thấy ngon miệng, ăn nhiều quá thì thấy ngán, mất ngon. Đồng thời, câu này có có ý khuyên con người không nên quá tham lam, phải biết điểm dừng, vừa đủ."
  },
  {
    "id": "45",
    "text": "Ăn lúc đói, nói lúc say",
    "meaning": "Lúc đói thì ăn bao nhiêu cũng vừa, ăn thức ăn nào cũng thấy ngon. Lúc say thì nói mãi cũng không biết chán. Lúc đói ăn không biết điểm dừng thì dễ bị no quá mức, có khi no quá sẽ sinh ra cảm giác đau nhức, khó chịu (do dạ dày không tiêu hóa hết). Khi say không biết giữ mồm giữ miệng thì sẽ dễ dẫn đến nói ra những lời không hay. Câu tục ngữ có ý khuyên người ta ăn nói nên liệu mồm miệng dù đói cũng chớ nên ăn quá nhiều, lúc say lại càng phải bớt lời."
  },
  {
    "id": "46",
    "text": "Anh đi đàng ấy xa xa, Để em ôm bóng trăng tà năm canh",
    "meaning": "Bài ca dao thể hiện sự chia xa, cô đơn và nhớ mong trong tình yêu. Nó tạo nên một hình ảnh của một người trong tình yêu đối mặt với sự cô đơn và mong muốn được nhớ đến khi người yêu của mình đi xa. Và nhắc nhở chúng ta phải chung tình trong tình yêu dù ở mọi khoảng cách địa lí."
  },
  {
    "id": "47",
    "text": "Ai đi muôn dặm non sông, Để ai chứa chất sầu đong vơi đầy.",
    "meaning": "Bài ca dao là thể hiện sự tách biệt, cô đơn và đau khổ của người đi xa, đồng thời nhấn mạnh vai trò của những người ở nhà phải chịu đựng sự khó khăn và chứa đựng nỗi buồn của người đi xa. Nó khắc sâu vào tâm trạng và trải nghiệm con người trong mối quan hệ xa cách và những gánh nặng tâm lý mà nó mang lại."
  },
  {
    "id": "48",
    "text": "Ăn thịt trâu không tỏi, như ăn gỏi không lá mơ",
    "meaning": "Trong ẩm thực Việt, món trâu xào luôn đi kèm với tỏi, cũng giống như món gỏi ăn kèm cùng với lá mơ. Câu tục ngữ khẳng định muốn món ăn ngon thì phải sử dụng gia vị thích hợp."
  },
  {
    "id": "49",
    "text": "Ai kêu ai hú bên sông, Tôi đang sắm sửa cho chồng xuống ghe",
    "meaning": "Bài ca dao đã khắc họa thành công tâm trạng của người phụ nữ khi phải xa chồng. Đó là nỗi buồn man mác, sự lo lắng, xót xa và cả tình yêu sâu đậm dành cho người chồng. Qua bài ca, ta thấy được tình cảm gia đình, tình yêu lứa đôi là những giá trị thiêng liêng, bất diệt."
  },
  {
    "id": "50",
    "text": "Ăn lấy chắc, mặc lấy bền",
    "meaning": "Nghĩa đen: ăn uống phải lấy chất lượng làm cốt yếu, ăn để no lâu để làm việc chứ không ăn qua loa, linh tinh; áo quần mặc cũng phải chọn vải bền để mặc được lâu, không phải mua nhiều đồ mới. Nghĩa bóng: kinh nghiệm sống của ông cha ta: phải chọn dùng các vật dụng không cao sang, hào nhoáng nhưng chắc chắn, dùng được lâu."
  },
  {
    "id": "51",
    "text": "Áo rách thay vai, quần rách đổi ống",
    "meaning": "Xưa kia, khi cuộc sống nghèo khó, thiếu thốn, áo quần lúc nào cũng trong trạng thái tả tơi, rách rưới. Chính vì vậy, các bà, các mẹ thường lấy mảnh vải nhỏ để vá áo quần. Câu tục ngữ trên đúc kết kinh nghiệm sửa chữa, tận dụng quần áo rách của ông cha ta."
  },
  {
    "id": "52",
    "text": "Ai lên làng Quỷnh hái chè, Hái dăm ba lá xuống khe ta ngồi.",
    "meaning": "Câu ca dao ca ngợi nghề trồng chè truyền thống của huyện Lục Nam, Bắc Giang. Qua đó cũng khuyên nhủ con người nên tiếp tục gìn giữ và phát huy những nét đẹp truyền thống mà cha ông ta đã để lại."
  },
  {
    "id": "53",
    "text": "Ai ơi, gương bể khó hàn, Chỉ đứt khó nối, người ngoan khó tìm",
    "meaning": "Câu ca dao ngợi ca tinh thần đoàn kết trong các mối quan hệ, đồng thời khuyên nhủ con người nên ứng xử có văn hóa trong mọi mối quan hệ."
  },
  {
    "id": "54",
    "text": "Ai về nhớ vải Định Hòa, Nhớ cau Hổ Bái, nhớ cà Đan Nê",
    "meaning": "Bài ca dao ngợi ca vẻ đẹp của vùng Yên Định, Thanh Hóa nơi có nhiều đặc sản nổi tiếng đồng thời cũng răn dạy con người truyền thống “uống nước nhớ nguồn”."
  },
  {
    "id": "55",
    "text": "Ăn thì ăn những miếng ngon Làm thì chọn việc cỏn con mà làm.",
    "meaning": "Câu ca dao phê phán những kẻ tham ăn, lười làm, khôn lỏi, chỉ thích lựa chọn việc nhẹ nhàng nhất để làm."
  },
  {
    "id": "56",
    "text": "Ăn như mèo ăn",
    "meaning": "Câu tục ngữ dùng để chỉ những người ăn ít, chậm rãi, nhỏ nhẹ"
  },
  {
    "id": "57",
    "text": "Ăn ốc trông trăng",
    "meaning": "Trung Thu là dịp mà ốc mít, ốc nhồi béo vàng. Người Hà Nội xưa thường làm món ốc luộc chấm mắm gừng hoặc ốc hấp lá gừng để trong lúc trẻ con phá cỗ với quà bánh thì người lớn tuổi thong thả vừa nhể ốc vừa ngắm Trăng."
  },
  {
    "id": "58",
    "text": "Ăn se sẻ, đẻ con voi",
    "meaning": "Chim sẻ là loài ăn rất ít. Câu tục ngữ muốn nói những người ăn ít nhưng làm nhiều, làm được việc lớn."
  },
  {
    "id": "59",
    "text": "Anh đi làm mướn nuôi ai, Cho áo anh rách, cho vai anh mòn?",
    "meaning": "Bài ca dao khẳng định sự hi sinh, sự vất vả nhọc nhằn bươn trải trong cuộc sống của cha mẹ để chăm lo cho con cái có một cuộc sống đầy đủ. Chính vì vậy, những người con cần phải biết trân quý và yêu thương cha mẹ."
  },
  {
    "id": "60",
    "text": "Anh em như chân với tay Rách lành đùm bọc, dở hay đỡ đần.",
    "meaning": "Bài ca dao khẳng định anh chị em trong gia đình là mối quan hệ gần gũi, gắn bó vì vậy phải biết giúp đỡ đùm bọc và yêu thương lẫn nhau trong bất kì hoàn cảnh nào."
  },
  {
    "id": "61",
    "text": "Anh thương em ruột thắt gan bào, Biết em có thương lại chút nào hay không?",
    "meaning": "Bài ca dao thể hiện tình yêu và sự bày tỏ lòng thương yêu từ một người đến người mình yêu. Nó tạo ra một hình ảnh về tình yêu sâu sắc và sự quan tâm chân thành. Ý nghĩa chung của đoạn thơ là về sự mong muốn biết được người mình thương có đáp lại tình cảm đó hay không, và hy vọng rằng tình yêu sẽ được đáp lại và gắn kết hai người lại với nhau."
  },
  {
    "id": "62",
    "text": "Ai về Tuy Phước ăn nem, Ghé qua Hưng Thạnh mà xem Tháp Chàm.",
    "meaning": "Câu ca dao ngợi ca vẻ đẹp của vùng Bình Định, nơi nổi tiếng với những tháp Chàm từ xa xưa, đồng thời cũng nhắn nhủ con người cần bảo tồn những di tích này."
  },
  {
    "id": "63",
    "text": "Ân cha nghĩa mẹ chưa đền, Bậu mong ôm gối cuốn mền theo ai?",
    "meaning": "Câu ca dao này thể hiện sự nhận thức của người con về những công lao nuôi dưỡng, sinh thành của cha mẹ không thể đền đáp được hoàn toàn. Và sự bất định của người con khi không thể nào tìm được người thay thế vị trí của cha mẹ trong việc che chở mang lại cảm giác an lành, thoải mái và yên tâm cho con. Từ đó, người viết thể hiện lòng biết ơn và tâm trạng đối với gia đình cùng với sự chăm sóc của cha mẹ."
  },
  {
    "id": "64",
    "text": "Ăn cho đều, kêu cho sòng",
    "meaning": "Câu tục ngữ khuyên nhủ cần phải công bằng, sòng phẳng trong công việc cũng như hưởng thụ thành quả"
  },
  {
    "id": "65",
    "text": "Ăn cỗ là việc tổ làng",
    "meaning": "Ngày xưa, số dân cư trong làng không nhiều, người ta có quan niệm mỗi khi “có công có việc”, có giỗ chạp cưới xin thì phải mời thật đông người đến tham dự, càng đông càng tốt. Câu tục ngữ trên đã tái hiện lại tập tục xưa kia của người Việt."
  },
  {
    "id": "66",
    "text": "Ăn cơm cũng thấy nghẹn, Uống nước cũng thấy nghẹn,",
    "meaning": "Bài ca dao thể hiện tình trạng đau khổ và lòng nhớ mong trong tình yêu. Nó tạo ra một hình ảnh về sự đau khổ và cảm xúc đầy nghẹn ngào khi người nói cảm thấy nỗi nhớ và sự trống rỗng trong lòng. Ý nghĩa chung là về sự cô đơn và lòng nhớ mong mạnh mẽ trong tình yêu, khi người ta cảm thấy không thể tìm thấy người mình yêu và trái tim trống rỗng."
  },
  {
    "id": "67",
    "text": "Ăn cơm với cá mòi he, Lấy chồng Cẩm Phả đun xe suốt đời.",
    "meaning": "Câu ca dao ngợi ca đặc sản của vùng Cẩm Phả (Quảng Ninh)."
  },
  {
    "id": "68",
    "text": "Ăn một miếng tiếng một đời",
    "meaning": "Nghĩa đen: Câu tục ngữ nói về việc chỉ vì một hành động sai trái nhỏ nhặt, dù chỉ là ăn một miếng thức ăn, cũng có thể dẫn đến hậu quả tai hại, ảnh hưởng đến danh tiếng và cuộc sống của một người trong suốt cuộc đời. Nghĩa bóng: Câu tục ngữ khuyên răn mọi người cần cẩn trọng trong lời nói và hành động, bởi vì những hành vi sai trái, dù chỉ là nhỏ nhặt, cũng có thể để lại hậu quả lâu dài và khó sửa chữa."
  },
  {
    "id": "69",
    "text": "Anh về Bình Định thăm cha, Phú Yên thăm mẹ, Khánh Hòa thăm em.",
    "meaning": "Câu ca dao ngợi ca tình cảm của con người ba tỉnh Bình Định, Khánh Hòa, Phú Yên, đồng thời khuyên nhủ con người phải gìn giữ và phát huy truyền thống đoàn kết của dân tộc."
  },
  {
    "id": "70",
    "text": "Ai đi Uông Bí, Vàng Danh Má hồng để lại má xanh mang về.",
    "meaning": "Uông Bí và Vàng Danh là hai địa danh thuộc tỉnh Quảng Ninh, nổi tiếng với ngành khai thác than từ lâu đời. Hình ảnh \"má hồng để lại má xanh mang về\" ẩn dụ cho việc những người thợ mỏ khi đến đây làm việc với sức khỏe dồi dào, hồng hào nhưng sau một thời gian lao động trong môi trường khắc nghiệt, họ trở nên xanh xao, ốm yếu. Khái quát: Câu ca dao phản ánh những hy sinh thầm lặng của những người thợ mỏ, họ đã dành cả tuổi thanh xuân và sức khỏe để góp phần xây dựng quê hương, đất nước."
  },
  {
    "id": "71",
    "text": "Ai qua phố Nhổn phố Lai Dừng chân ăn miếng chả đài thơm ngon",
    "meaning": "Bài ca dao ngợi ca ẩm thực của vùng ngoại ô thủ đô Hà Nội với các đặc sản như chả Đài, cam ngọt. Đồng thời bài ca dao như một lời mời gọi du khách thập phương ghé qua nơi đây."
  },
  {
    "id": "72",
    "text": "Ai qua Phú Hội, Phước Thiền, Bâng khuâng nhớ mãi sầu riêng Long Thành.",
    "meaning": "Câu ca dao ngợi ca vẻ đẹp của Đồng Nai với đặc sản sầu riêng, đồng thời bộc lộ tình yêu quê hương."
  },
  {
    "id": "73",
    "text": "Ăn chẳng bõ dính răng",
    "meaning": "Câu tục ngữ có ý là đồ ăn rất ít, ăn không thâm vào đâu."
  },
  {
    "id": "74",
    "text": "Anh em hiền thật là hiền Chỉ một đồng tiền làm mất lòng nhau",
    "meaning": "Nghĩa đen: Anh em vốn dĩ có mối quan hệ rất tốt đẹp nhưng chỉ vì chuyện tiền bạc mà tình cảm đó có thể tan vỡ Nghĩa bóng: Câu ca dao là lời cảnh tỉnh về tác hại của lòng tham lam, sự ích kỷ. Khi con người đặt nặng vật chất, đồng tiền lên trên tình cảm, họ sẽ dễ dàng đánh mất những giá trị cao đẹp, trong đó có tình anh em."
  },
  {
    "id": "75",
    "text": "Ai đi trẩy hội chùa Hương Làm ơn gặp khách thập phương hỏi giùm",
    "meaning": "Bài ca dao ca ngợi vẻ đẹp của thiên nhiên và ẩm thực của chùa Hương với non nước hữu tình, đặc sản rau sắng nổi tiếng xa gần. Qua đó bộc lộ tình yêu và niềm tự hào về vẻ đẹp của quê hương, xứ sở."
  },
  {
    "id": "76",
    "text": "Ai sang Hà Nội Nhắn nhủ hàng hương",
    "meaning": "Bài ca dao như một lời nhắn nhủ tha thiết được gửi gắm đến những ai có dịp đặt chân đến thủ đô Thăng Long - Hà Nội. Ngợi ca nét đẹp truyền thống của hàng hương Hà Nội. Qua đó khuyên nhủ con người cần lưu giữ và phát huy nghề làm hương truyền thống."
  },
  {
    "id": "77",
    "text": "Ai về nhắn với ông câu, Cá ăn thì giật, để lâu mất mồi",
    "meaning": "Bài ca dao là lời cảnh báo về việc không nên chờ đợi quá lâu để hành động hoặc tận dụng cơ hội trong tình yêu. Nếu không, cơ hội có thể bị mất đi và không thể tán được người mình thích nữa."
  },
  {
    "id": "78",
    "text": "Ai về Nhượng Bạn thì về, Gạo nhiều, cá lắm, dễ bề làm ăn.",
    "meaning": "Câu ca dao ngợi ca đặc sản của vùng Cẩm Xuyên, Hà Tĩnh. Qua đó nhắc nhở con người về truyền thống “uống nước nhớ nguồn”."
  },
  {
    "id": "79",
    "text": "Anh em ăn ở thuận hoà Chớ điều chếch lệch người ta chê cười",
    "meaning": "Câu ca dao đề cao giá trị của tình anh em ruột thịt, đồng thời khuyên nhủ anh em cần biết cư xử, ứng xử đúng mực với nhau để xây dựng một gia đình hạnh phúc, hòa thuận. Mâu thuẫn, tranh cãi giữa anh em sẽ làm tổn hại đến tình cảm gia đình, khiến cho người ngoài chê cười, xa lánh."
  },
  {
    "id": "80",
    "text": "Anh em giọt máu sẻ đôi.",
    "meaning": "Câu tục ngữ ca ngợi tình cảm anh em trong nhà. Họ là những người có chung máu mủ, thân thiết, gắn bó với nhau, luôn giúp đỡ nhau."
  },
  {
    "id": "81",
    "text": "Anh về, em nắm cổ tay Em dặn câu này, anh chớ có quên:",
    "meaning": "Bài ca dao là lời dặn ý tứ của cô gái khi phải xa người yêu: đôi ta đã có những hẹn ước nên duyên, vì vậy đi xa thì chớ có quên tình cảm mặn nồng, sâu sắc lúc bây giờ."
  },
  {
    "id": "82",
    "text": "Ai về Xuân Vũ, Ninh Vân, Làng nghề chạm đá xa gần nức danh",
    "meaning": "Câu ca dao ca ngợi làng nghề chạm khắc đá truyền thống nổi tiếng của vùng đất Ninh Bình, đồng thời thể hiện tình yêu và niềm tự hào về nghề truyền thống của quê hương."
  },
  {
    "id": "83",
    "text": "Ăn lắm thì hết miếng ngon, nói lắm thì hết lời khôn hóa rồ",
    "meaning": "Mọi sự trên đời đúng là cái gì cũng nên có chừng mực mới hay. Nhiều quá không tốt, ít quá thì không hay nhưng vừa đủ thì chắc chắn đẹp. Một món ăn dù có ngon đến đâu thì cứ ăn mãi cũng sẽ đến lúc không còn mà ăn nữa. Nói hay mà nói nhiều cũng thành ra nhàm chán và lộ điểm yếu của chính mình. Thế nên, mọi việc trên đời chúng ta đều phải cân nhắc cho thật kỹ lưỡng. Câu tục ngữ như một lời nhắc nhở con người về cách sử dụng lời nói trong cuộc sống. Trong cuộc sống hằng ngày chúng ta cần biết nói lời hay lẽ phải, suy nghĩ kĩ trước khi nói."
  },
  {
    "id": "84",
    "text": "Anh ngồi tựa mạn thuyền rồng Thấy em cuốc cỏ trên đồng anh thương.",
    "meaning": "Câu ca dao thể hiện một tình yêu đẹp, cao cả và thiêng liêng. Chàng trai làm quan, nhưng vẫn đem lòng thương mến cô gái nhà nông. Tình yêu đã giúp họ vượt qua ranh giới của địa vị và những hủ tục trong xã hội."
  },
  {
    "id": "85",
    "text": "Anh nói em cũng nghe anh Bát cơm đã trót chan canh mất rồi!",
    "meaning": "Bài ca dao là lời than trách của cô gái khi không được tự do trong yêu đương. Người con gái bị ép gả đi cho một người mà cô không yêu thương, nên bỏ đi thì không đành, mà tiếp tục cuộc hôn nhân thì cô cũng phải chịu những đắng cay."
  },
  {
    "id": "86",
    "text": "Ai lên nhắn chị hàng bông, Có muốn lấy chồng thì xuống Nguyệt Viên",
    "meaning": "Bài ca dao ngợi ca vẻ đẹp của phong cảnh và con người vùng Nguyệt Viên, đồng thời bộc lộ tình yêu quê hương, đất nước."
  },
  {
    "id": "87",
    "text": "Ai ơi trẻ mãi ru mà! Càng đo đắn lắm càng già mất duyên.",
    "meaning": "Câu ca dao đề cao vai trò của làm việc đúng lúc, đúng thời điểm. Khi ta còn trẻ, ta cứ đắn đo mãi, chần chừ không chọn được nhân duyên. Càng ngày, ta càng già đi, nhân duyên, cơ hội ngày càng ít đi và cuối cùng là biến mất."
  },
  {
    "id": "88",
    "text": "Ai về Thọ Lão hát chèo, Có thương lấy phận nàng Kiều thì thương.",
    "meaning": "Câu ca dao ngợi ca vẻ đẹp của nghệ thuật truyền thống của vùng Hà Nam, đồng thời bộc lộ niềm tự hào và tình yêu quê hương, xứ sở con người."
  },
  {
    "id": "89",
    "text": "Ăn cơm không canh như tu hành không vãi",
    "meaning": "Câu tục ngữ dùng lối nói dân gian để đề cao món canh trong mâm cơm người Việt. Từ xa xưa, trên mâm cơm nước ta thường đầy đủ hai món mặn, một món canh hoặc một món mặn, một món canh."
  },
  {
    "id": "90",
    "text": "Anh em như thể chân tay  Cùng cha cùng mẹ việc nhà hăng say",
    "meaning": "Câu ca dao khẳng định mối quan hệ gắn bó, yêu thương, đùm bọc lẫn nhau giữa anh em trong gia đình. Anh em như những người bạn đồng hành, cùng nhau chia sẻ mọi buồn vui, khó khăn trong cuộc sống."
  },
  {
    "id": "91",
    "text": "Áo rách cốt cách người thương",
    "meaning": "Câu tục ngữ nói về sự liêm khiết, chính trực của con người. Theo đó, con người dù cho có nghèo khổ, khó khăn nhưng phẩm chất đạo đức, nhân cách tốt thì mọi người vẫn thương yêu, quý mến và tôn trọng."
  },
  {
    "id": "92",
    "text": "Ai đi qua phố Khoa Trường Dừng chân ngắm cảnh núi rừng xanh xanh",
    "meaning": "Bài ca dao ngợi ca vẻ đẹp của thiên nhiên và phong cảnh ở vùng Khoa Trường (Thanh Hóa) với núi non hùng vĩ, sông nước trữ tình. Đồng thời bày tỏ tình yêu thiên nhiên, quê hương, đất nước."
  },
  {
    "id": "93",
    "text": "Ai ơi chẳng chóng thì chầy Có công mài sắt, có ngày nên kim.",
    "meaning": "Câu ca dao nhắc nhở mỗi người cần kiên trì, cố gắng, quyết tâm hoàn thành mục tiêu đã đề ra. Chúng ta không nên nản chí khi gặp thử thách, bởi khi đã nỗ lực thì không sớm thì muộn, ta cũng sẽ có được thành công."
  },
  {
    "id": "94",
    "text": "Ăn cá trắm, uống rượu tăm, vật trăm trận",
    "meaning": "Câu tục ngữ nhấn mạnh nguồn dinh dưỡng dồi dào có trong động vật như cá trắm và thức uống bổ dưỡng như rượu tăm cho phái nam."
  },
  {
    "id": "95",
    "text": "Ai về chợ huyện Thanh Vân Hỏi thăm cô Tú đánh vần được chưa?",
    "meaning": "Bài ca dao cổ vũ phong trào Bình dân học vụ do Chính phủ nước Việt Nam dân chủ cộng hòa phát động, đồng thời nêu cao tinh thần hiếu học của người Việt."
  },
  {
    "id": "96",
    "text": "Ai về Hậu Lộc Phú Điền, Nhớ đây Bà Triệu trận tiền xung phong.",
    "meaning": "Câu ca dao khẳng định công lao to lớn của Bà Triệu, đồng thời nhắc nhở con người cần ghi nhớ công ơn của vị tướng này nói riêng, các vị anh hùng có công dựng nước và giữ nước nói chung."
  },
  {
    "id": "97",
    "text": "Ai về thăm chợ Năm Dân, Kim Sơn vùng biển xa gần nức danh.",
    "meaning": "Bài ca dao vừa ca ngợi vẻ đẹp nên thơ, trữ tình của thiên nhiên, vừa ca ngợi sự giàu có của con người và vùng đất Ninh Bình."
  },
  {
    "id": "98",
    "text": "Anh em khúc ruột chia hai, Mạch còn máu chảy đứt ngoài liền trong.",
    "meaning": "Bài ca dao này nói về sự đau đớn và tổn thương khi mối quan hệ anh chị em trong gia đình bị đứt đoạn nhưng mối liên kết về dòng máu sâu bên trong vẫn còn tồn tại. Từ đó, khuyên mỗi chúng ta cần phải biết yêu thương, đoàn kết chia sẻ với anh chị em trong gia đình."
  },
  {
    "id": "99",
    "text": "Anh em trên thuận dưới hòa, Họ hàng đẹp mặt, mẹ cha vui vầy.",
    "meaning": "Bài ca dao khẳng định anh chị em trong gia đình mà luôn hoàn thuận, yêu thương lẫn nhau thì gia đình, họ hàng sẽ tự hào, cha mẹ sẽ vui lòng và hạnh phúc."
  },
  {
    "id": "100",
    "text": "Áo nhung cởi lại Linh San, Thoắt đà thoát nợ trần hoàn lên tiên.",
    "meaning": "Bài ca dao ngợi ca chiến công oanh liệt của Thánh Gióng, đồng thời nhắc nhở con người luôn ghi nhớ và biết ơn những vị anh hùng thuở trước."
  },
  {
    "id": "101",
    "text": "Ai về Hồng Lộc thì về Ăn cơm cá Bàu Nậy",
    "meaning": "Bài ca dao ca ngợi những đặc sản nổi tiếng của vùng đất Hà Tĩnh, đồng thời nhắc nhở mọi người phải nhớ về quê hương của mình."
  },
  {
    "id": "102",
    "text": "Ăn mặn, uống nước đỏ da Nằm đất nằm cát cho ma nó hờn.",
    "meaning": "Câu ca dao nhắc nhở con người không nên ăn quá mặn, đồng thời nhắn nhủ con người nên biết quý trọng sức khỏe bản thân."
  },
  {
    "id": "103",
    "text": "Ba đồng một mớ đàn ông, Đem về bỏ lồng cho kiến nó tha",
    "meaning": "Bài ca dao thể hiện sự khác biệt xã hội và tư duy giới tính. Nó tạo ra một hình ảnh về sự coi thường đàn ông và sự quan tâm đối với phụ nữ. Ý nghĩa chung là về sự chênh lệch giới tính và đánh giá không công bằng giữa nam và nữ trong xã hội. Nó cho thấy sự thiếu công bằng và đòi hỏi sự nhìn nhận và đánh giá công bằng cho cả nam và nữ trong mọi lĩnh vực của cuộc sống."
  },
  {
    "id": "104",
    "text": "Bán anh em xa, mua láng giềng gần",
    "meaning": "Câu tục ngữ \"Bán anh em xa, mua láng giềng gần\" mang ý nghĩa khuyên răn mỗi người cần trân trọng và vun đắp mối quan hệ tốt đẹp với những người hàng xóm láng giềng sinh sống gần kề nhà mình, bởi họ là những người bạn đồng hành cùng mình, có thể giúp đỡ mình nhiều điều trong cuộc sống, hơn cả những người anh em họ hàng dù cùng huyết thống nhưng ở xa. Tuy nhiên, câu tục ngữ này không có nghĩa là coi nhẹ hay bỏ mặc anh em họ hàng. Mối quan hệ với họ hàng vẫn cần được trân trọng và gìn giữ. Chỉ là trong trường hợp anh em ở xa, việc hỗ trợ lẫn nhau sẽ gặp nhiều khó khăn hơn so với láng giềng gần kề."
  },
  {
    "id": "105",
    "text": "Bây giờ mận mới hỏi đào Vườn hồng đã có ai vào hay chưa?",
    "meaning": "Bài ca dao nói về tình yêu trong sáng, nồng thắm của chàng trai và cô gái mới lớn. Tác giả dân gian mượn những hình ảnh quen thuộc để diễn tả ý nhị, kín đáo tình yêu đôi lứa trong bài ca dao."
  },
  {
    "id": "106",
    "text": "Bầu ơi thương lấy bí cùng, Tuy rằng khác giống nhưng chung một dàn",
    "meaning": "Trong câu ca dao, ông cha ta đã mượn chuyện thiên nhiên để khuyên nhủ con cháu rằng dù chúng ta có khác nhau về nguồn gốc, hoàn cảnh hay địa vị xã hội thì vẫn là người Việt Nam, do đó chúng ta cần phải biết yêu thương, đùm bọc, chia sẻ và giúp đỡ lẫn nhau."
  },
  {
    "id": "107",
    "text": "Ba đồng một mớ trầu cay Sao anh chẳng hỏi những ngày còn không?",
    "meaning": "Bài ca dao là lời trách móc và tự thương của cô gái khi phải chấp nhận cuộc hôn nhân có sắp đặt. Cô gái đau buồn, trách người yêu sao không vun đắp tình cảm với cô, để rồi giờ cô như chim vào lồng, không được tự do yêu đương, bị ép gả cho người khác."
  },
  {
    "id": "108",
    "text": "Ba tháng trồng cây chẳng bằng một ngày trông quả",
    "meaning": "Trồng trọt, bón tưới cây trong ba tháng trời, đến khi cây có quả thì chỉ một ngày là thu hoạch xong. Đại ý câu này nói hưởng kết quả thì dễ, thì chóng, làm nên cái kết quả đó thì khó và lâu."
  },
  {
    "id": "109",
    "text": "Bỏ thì thương, vương thì tội.",
    "meaning": "Câu tục ngữ thể hiện sự phân vân của chàng trai, cô gái trong một mối tình không đẹp. Họ bỏ nhau thì lại thấy thương nhau; nhưng còn ở bên nhau thì lại thấy đây là điều không nên làm, bởi cuối cùng kết quả cũng không tốt đẹp gì."
  },
  {
    "id": "110",
    "text": "Bắt lợn tóm giò, bắt bò tóm mũi",
    "meaning": "Vì con lợn “đào bới”, dũi đất bằng mõm và dùng cặp răng nanh để tự vệ, tấn công kẻ thù chứ không dùng chân trước làm “vũ khí chủ lực”. “Bắt lợn tóm giò, bắt bò tóm mũi”, tóm giò trước hay giò sau còn tùy vào tư thế khi tiếp cận con vật; cặp giò nào bị trói thì con vật cũng “hết đường chạy”. Còn mũi bò là nơi có xỏ dây, nên con người có thể làm chủ con bò ở mũi. Tục ngữ này đúc kết kinh nghiệm khi bắt lợn, bắt bò. Bắt lợn thì phải bắt đằng chân; bắt bò thì phải bắt đằng dây xỏ qua mũi. Câu tục ngữ này cho thấy phải biết nắm đặc tính của từng loài để điều khiển chúng thì mới hữu hiệu."
  },
  {
    "id": "111",
    "text": "Bụng đói thì tai điếc",
    "meaning": "Khi đói, ta không còn phân biệt được đúng sai, phải trái nên dễ có những hành động sai trái như cưới giật, lừa đảo. Vì đã đói thì không biết phải trái nên làm liều."
  },
  {
    "id": "112",
    "text": "Bụng đói đầu gối phải bò",
    "meaning": "Câu tục ngữ có nghĩa là khi lâm vào nghèo túng, kẻ lười cũng bắt buộc phải xoay xở, phải làm việc thì mới có ăn."
  },
  {
    "id": "113",
    "text": "Bao giờ cá lý hóa long, Đền ơn cha mẹ ẵm bồng xưa nay.",
    "meaning": "Câu ca dao khẳng định rằng việc đền đáp công ơn của cha mẹ là điều khó khăn và không bao giờ trả hết được. Từ đó khuyên chúng ta phải sống có trách nhiệm, hiếu thảo và biết báo đáp sự chăm sóc mà cha mẹ đã dành cho mình."
  },
  {
    "id": "114",
    "text": "Biết thì thưa thốt, Không biết thì dựa cột mà nghe.",
    "meaning": "Câu ca dao đề cao đức tính khiêm tốn, đồng thời khuyên răn mọi người hãy không ngừng học tập, biết im lặng lắng nghe và tiếp thu kiến thức từ những người khác. Không nên tỏ ra hiểu biết trong khi còn mơ hồ về vấn đề đang nói."
  },
  {
    "id": "115",
    "text": "Bao giờ cho gạo bén sàng, Cho răng bén gió, cho nàng bén anh",
    "meaning": "Bài ca dao thể hiện ý nghĩa về sự tương thích và hoàn hảo trong mối quan hệ. Nó sử dụng các hình ảnh tượng trưng để biểu thị sự hoàn thiện và sự phù hợp giữa các yếu tố trong một mối quan hệ. Từ đó nhắc nhở chúng ta về sự cân đối và sự hoàn hảo trong mối quan hệ, khi mọi yếu tố đều phù hợp và tương thích với nhau."
  },
  {
    "id": "116",
    "text": "Bình Định có núi Vọng Phu, Có đầm Thị Nại, có cù lao Xanh",
    "meaning": "Bài ca dao ngợi ca vẻ đẹp của núi non, biển cả Bình Định. Với những địa danh như: núi Vọng Phu là ca ngợi lòng thủy chung, son sắt của người vợ bồng con ngóng trông chồng về; đầm Thị Nại và cù lao Xanh gợi nhắc đến chiến công lừng lẫy của nghĩa quân Tây Sơn. Qua bài ca dao cũng thể hiện niềm tự hào của tác giả dân gian về mảnh đất quê hương và lòng biết ơn, sự đồng cảm với những vất vả, lòng thủy chung sâu sắc và tâm hồn hiền lành, chăm chỉ trong cuộc sống đời thường của nhân dân."
  },
  {
    "id": "117",
    "text": "Công cha như núi Thái Sơn Nghĩa mẹ như nước trong nguồn chảy ra",
    "meaning": "Bài ca dao đã khái quát một cách sâu sắc và đầy đủ về công lao to lớn của cha mẹ và đạo lý làm con. Nó nhắc nhở mỗi người chúng ta phải luôn ghi nhớ công ơn sinh thành, dưỡng dục của cha mẹ và sống sao cho xứng đáng với tình yêu thương đó."
  },
  {
    "id": "118",
    "text": "Có công mài sắt, có ngày nên kim",
    "meaning": "Câu tục ngữ mang hai ý nghĩa: Nghĩa đen: một thanh sắt to lớn qua quá trình và thời gian mài giũa có thể mài được một cây kim. Nghĩa bóng: thể hiện sự kiên trì, nhẫn nại, vượt lên khó khăn của con người sẽ gặt hái được thành quả xứng đáng."
  },
  {
    "id": "119",
    "text": "Chuồn chuồn bay thấp thì mưa Bay cao thì nắng bay vừa thì râm.",
    "meaning": "Câu tục ngữ là kinh nghiệm về dự báo thời tiết mà người xưa đúc kết được: thấy chuồn chuồn bay thấp, tức là trời sẽ mưa; còn thấy chuồn chuồn bay cao, trời sẽ nắng to.Về mặt khoa học khi trời sắp mưa, độ ẩm trong môi trường tăng lên, hơi nước ngưng tụ.. chuồn chuồn là loài động vật cánh mỏng hơi nước trong không khí sẽ đọng lên cánh làm cánh nặng hơn (tăng tải trọng) vì thế chuồn chuồn không bay cao được. Còn ngược lại khi trời nắng thì cánh chuồn chuồn khô và nhẹ giúp chúng bay cao"
  },
  {
    "id": "120",
    "text": "Chớ thấy sóng cả mà ngã tay chèo",
    "meaning": "Nghĩa đen: đừng thấy sóng lớn mà thấy e ngại, vội buông chèo phó mặc tất cả Nghĩa bóng: sóng cả là hình ảnh ẩn dụ chỉ những điều khó khăn mà chúng ta phải đương đầu trong cuộc sống; ngã tay chèo nghĩa là buông bỏ, từ bỏ, nản lòng Câu tục ngữ khuyên con người phải tập tính kiên trì, nhẫn nại. Khi đã làm việc gì dù khó khăn cũng phải cố gắng đến cùng, không được bỏ cuộc. Những sóng gió cuộc đời, những thất bại mà ta gặp phải sẽ là bài học giúp chúng ta rèn luyện, trưởng thành và có nhiều kinh nghiệm hơn. Một lần vấp ngã là một lần chúng ta học cách đứng lên. Mỗi chúng ta cần phải rèn cho mình tính kiên trì nhẫn lại, không nản lòng khi vấp ngã, \" thất bại là mẹ thành công\" thế nên chắc chắn những điều chúng ta ao ước sẽ đạt được bằng chính sự nỗ lực bản thân mình."
  },
  {
    "id": "121",
    "text": "Cày đồng đang buổi ban trưa, Mồ hôi thánh thót như mưa ruộng cày.",
    "meaning": "Bài ca dao nói lên sự vất vả, cực nhọc của người nông dân khi làm ra hạt gạo. Từng hạt gạo đều chứa đựng cả tấm lòng, công sức, với bao mồ hôi, nước mắt của người nông dân. Qua đó, bài ca dao khuyên chúng ta phải biết quý trọng từng hạt gạo, bát cơm mà chúng ta đang ăn như là một cách để thể hiện sự biết ơn những người nông dân làm ra chúng."
  },
  {
    "id": "122",
    "text": "Con vua thì lại làm vua, Con sãi ở chùa thì quét lá đa.",
    "meaning": "Hai câu đầu của bài ca dao vẽ nên bức tranh hiện thực xã hội Việt Nam xưa với sự phân biệt giai cấp rõ rệt. Con vua sinh ra đã được hưởng vinh hoa phú quý, định sẵn số phận làm vua, trong khi con sãi chỉ có thể quét lá đa trong chùa, sống cuộc đời lam lũ, cơ cực. Hai câu sau thể hiện khát vọng về công lý của người dân lao động. Họ mong muốn một xã hội công bằng, nơi con người được đánh giá dựa vào năng lực và phẩm chất, chứ không phải dựa vào xuất thân. Khái quát: Bài ca dao thể hiện niềm tin, khát vọng của nhân dân ta về việc thay đổi số phận. Mặc dù con vua thì sau này vẫn làm vua, con sãi ở chùa thì sau này cũng ở chùa, nhưng nếu có sự đấu tranh thì con vua sẽ bị thất thế, phải về chùa quét lá đa."
  },
  {
    "id": "123",
    "text": "Có chí thì nên",
    "meaning": "Câu tục ngữ muốn khuyên chúng ta rằng ai có ý chí thì sẽ có được thành công. Vậy nên phải biết giữ vững ý chí, tinh thần của mình, quyết tâm kiên trì thực hiện mục tiêu đã đặt ra thì ắt sẽ làm “nên”, ắt sẽ có được thành công như ý muốn."
  },
  {
    "id": "124",
    "text": "Cá không ăn muối cá ươn, con cãi cha mẹ trăm đường con hư",
    "meaning": "Câu tục ngữ đã mượn hình ảnh con cá bị ươn do không được ướp muối cẩn thận để nhắc nhở mỗi người cần phải biết nghe lời cha mẹ. Ngoan ngoãn, vâng lời cha mẹ cũng chính là một biểu hiện của sự kính trọng, biết ơn với người đã sinh ra mình."
  },
  {
    "id": "125",
    "text": "Chớp Đông nhay nháy, gà gáy thì mưa",
    "meaning": "Câu tục ngữ về lao động sản xuất được truyền miệng trong dân gian, dạy bảo con cháu khi trời có chớp, sấm sét ở phía đông có nghĩa là trời sắp mưa, gà gáy xong là cơn mưa sẽ bắt đầu. Vì vậy những ai đang phơi thóc, phơi lúa, … thực phẩm nói chung thì phải thu vào ngay để không bị ướt, tránh tổn thất khi mưa đến mà không chuẩn bị kịp"
  },
  {
    "id": "126",
    "text": "Chết trong còn hơn sống đục",
    "meaning": "Nghĩa đen: Câu tục ngữ so sánh cái chết thanh thản, giữ gìn được phẩm giá với cuộc sống nhơ nhớp, vấy bẩn. Nghĩa bóng: Câu tục ngữ đề cao giá trị to lớn của danh dự và phẩm chất đạo đức con người. Con người cần sống cho đúng với lương tâm, đạo đức, làm những việc tốt đẹp để được mọi người yêu quý, kính trọng, dù cho họ có hoàn cảnh khó khăn đến đâu. Thà rằng chết đi thanh thản, giữ gìn được phẩm giá, còn hơn sống một cuộc sống nhơ nhớp, vấy bẩn, đánh mất danh dự."
  },
  {
    "id": "127",
    "text": "Cha chết không lo bằng đỏ lò Tây Bắc",
    "meaning": "“Đỏ lò Tây Bắc” ở đây là một áng mây có màu đỏ ối bất ngờ xuất hiện ở chân trời phía Tây Bắc mà hình thù đám mây (hay khoảng không) này khá to, rực hồng, giống như màu lửa từ chiếc lò than (than củi, than hoa) mà các gia đình ngày xưa hay sử dụng, báo hiệu sự thay đổi của thời tiết bất thường: Mưa to và gió lớn. Câu tục ngữ so sánh việc cha chết cũng chẳng đáng lo bằng chân trời phía Tây Bắc ửng lên cái sắc đỏ của than hồng (vì đó là điềm sắp xảy ra trận bão lớn), với mục đích chỉ rõ nỗi kinh hoàng mà bao người phải nếm trải khi sắp phải đối mặt với một trận bão."
  },
  {
    "id": "128",
    "text": "Chắc rễ bền cây",
    "meaning": "Cây có rễ chắc thì sẽ bền, sống được lâu, trụ vững qua bão táp mưa sa. Câu tục ngữ còn hàm chỉ việc khi bản thân đã xây dựng được sự vững mạnh gốc rễ thì tương lai có thể đương đầu được với nhiều khó khăn, chông gai mà không lo sợ. Còn nếu gốc rễ không đủ cứng, đủ bền thì sẽ bị nước lũ làm xói mòn trôi cả gốc lẫn cây."
  },
  {
    "id": "129",
    "text": "Chăn lợn ba nằm không bằng chăn tằm một lứa",
    "meaning": "Câu tục ngữ là đúc kết kinh nghiệm của ông cha trong việc chăn nuôi: nuôi tằm thu hoạch có lời hơn nuôi lợn rất nhiều."
  },
  {
    "id": "130",
    "text": "Đêm tháng Năm chưa nằm đã sáng",
    "meaning": "Câu tục ngữ phản ánh sự chênh lệch giữa thời gian ban ngày và ban đêm của các tháng trong năm. Sang tháng 5 là bước vào hạ, ngày dài hơn đêm. Tháng 10 là bước vào mùa đông, ngày ngắn hơn đêm. Câu tục ngữ này là kết quả của quan sát tự nhiên và kinh nghiệm sản xuất của người nông dân xưa."
  },
  {
    "id": "131",
    "text": "Đói cho sạch, rách cho thơm",
    "meaning": "Câu tục ngữ nói về đức tính liêm khiết, lối sống trong sạch. “Đói”, “rách” chỉ hoàn cảnh sinh sống nghèo khó, thiếu thốn mọi mặt về vật chất. “Sạch”, “thơm” nói về nhân cách, đạo đức, danh dự của một con người. Dù cuộc sống có đẩy chúng ta vào hoàn cảnh khó khăn, cùng cực, thiếu thốn trăm bề thì hãy giữ gìn cho mình tâm hồn trong sạch, lối sống ngay thẳng."
  },
  {
    "id": "132",
    "text": "Đi khắp thế gian không ai tốt bằng Mẹ, Gánh nặng cuộc đời không ai khổ bằng Cha.",
    "meaning": "Câu ca dao nói lên những vất vả, nhọc nhằn khi cha mẹ nuôi con. Mặc dù nuôi con khó khăn là thế, nhưng cha mẹ vẫn luôn dành tất cả tình thương yêu, chở che cho con. Qua đó, tác giả dân gian khuyên những người con nên nhớ lấy công ơn của cha mẹ, săn sóc cha mẹ."
  },
  {
    "id": "133",
    "text": "Đi một ngày đàng, học một sàng khôn",
    "meaning": "Câu tục ngữ là kinh nghiệm mà cha ông ta đã đúc rút để truyền cho thế hệ đi sau. Kiến thức mà chúng ta muốn tìm hiểu tựa như đại dương bao la, những gì chúng ta biết chỉ là một giọt nước nhỏ mà thôi. Bởi vậy không ngừng tìm kiếm, không ngừng học hỏi là điều mà bạn nên biết, nên làm. Chúng ta cần bỏ thời gian để đi đến những vùng đất lạ, đến những nơi đó chúng ta sẽ thấy được có nhiều điều bất ngờ, sẽ học hỏi từ mọi người, học hỏi từ văn hóa của vùng miền đó."
  },
  {
    "id": "134",
    "text": "Đồng Đăng có phố Kỳ Lừa Có nàng Tô Thị, có chùa Tam Thanh.",
    "meaning": "Câu ca dao ca ngợi cảnh đẹp của vùng Lạng Sơn, đồng thời ca ngợi tình yêu chân thành và nồng nhiệt trong tình yêu của Tô Văn - nàng Tô Thị. Qua đó bộc lộ niềm tự hào và tình yêu quê hương, xứ sở con người."
  },
  {
    "id": "135",
    "text": "Dạy con từ thuở còn thơ, Dạy vợ từ thuở bơ vơ mới về.",
    "meaning": "Bài ca dao này là đề cao tình yêu thương và trách nhiệm gia đình. Nó nhấn mạnh rằng người cha phải dạy dỗ con cái từ khi còn nhỏ, và người chồng có trách nhiệm hướng dẫn và chăm sóc vợ, đặc biệt là khi vợ mới vào gia đình. Từ đó khuyên chúng ta phải biết cách gắn kết, chỉ dạy các mối quan hệ trong gia đình."
  },
  {
    "id": "136",
    "text": "Đường vô xứ Nghệ quanh quanh, Non xanh nước biếc như tranh họa đồ.",
    "meaning": "Câu ca dao ca ngợi vẻ đẹp nên thơ, non nước hữu tình của mảnh đất xứ Nghệ."
  },
  {
    "id": "137",
    "text": "Dù ai nói ngả nói nghiêng. Lòng ta vẫn vững như kiềng ba chân.",
    "meaning": "Bài ca dao đã mượn hình ảnh của chiếc kiềng ba chân vững chắc để ẩn dụ cho sự kiên định, không dễ bị lung lay, nhụt chí khi nghe lời của người khác. Đồng thời, bài ca dao còn nhắn nhủ đến chúng ta phải luôn giữ vững quan điểm của mình, quyết tâm theo mục tiêu mình đã đặt ra"
  },
  {
    "id": "138",
    "text": "Được mùa cau, đau mùa lúa",
    "meaning": "Câu tục ngữ là kinh nghiệm trồng trọt: năm nào được mùa cau thì mất mùa lúa và ngược lại."
  },
  {
    "id": "139",
    "text": "Đầu năm sương muối, cuối năm gió nồm",
    "meaning": "Đầu năm có sương muối, cuối năm có gió bắc là hai hiện tượng thời tiết trái với tự nhiên gây hại cho con người và vạn vật. Qua các kinh nghiệm dân gian đó, người dân dự đoán trước được thời tiết và có kế hoạch để chuẩn bị cho mùa màng, gia súc."
  },
  {
    "id": "140",
    "text": "Đố ai đếm được vì sao  Đố ai đếm được công lao mẹ già.",
    "meaning": "Câu ca dao đã sử dụng những hình ảnh đối lập, so sánh độc đáo (công lao của mẹ so với những vì sao trên trời) để ca ngợi công lao to lớn, vĩ đại của mẹ. Qua đó, tác giả cũng thể hiện lòng hiếu thảo, biết ơn và sự yêu thương sâu sắc của người con đối với mẹ."
  },
  {
    "id": "141",
    "text": "Đông chết se, hè chết lụt",
    "meaning": "Câu tục ngữ là kinh nghiệm của ông cha ta về thời tiết. Nếu mùa đông năm nay lạnh, hanh khô ráo thì thường mùa hè năm tới sẽ có nhiều mưa lớn, dễ gây ra lụt lội."
  },
  {
    "id": "142",
    "text": "Đầu năm trồng chuối, cuối năm trồng cam",
    "meaning": "Câu tục ngữ là kinh nghiệm trồng trọt của ông cha ta: Với các cụ xưa, đầu năm (tháng 1, tháng 2) là thời điểm tốt nhất để trồng chuối. Thời gian này, thời tiết đang có dấu hiệu ấm dần. Cây chuối là cây chịu hạn. Người ta “đánh” cây non và trồng ở góc vườn, bờ ao cho thoáng mát, không bị nắng nhiều. Chuối sẽ bén rễ và khi nắng ấm, mưa xuống sẽ phát triển nhanh, chừng vài ba tháng là ra hoa, trổ buồng và hai, ba tháng tiếp theo đã có thể thu hoạch. Cam là cây ăn quả, hoa màu trắng, quả tròn, có múi, nhiều nước. Đây là loại quả bổ dưỡng, rất được ưa chuộng. Cam thu hoạch chủ yếu vào khoảng tháng 10, tháng 11. Sau khi hái quả, người ta cắt những cành cam chiết (một cách nhân giống từ cây gốc) và trồng sang đất mới. Cam là một trong những cây chịu rét tốt. Vì vậy, trồng cam vào cuối đông là thích hợp."
  },
  {
    "id": "143",
    "text": "Đói ăn vụng, túng làm liều",
    "meaning": "Đời sống khó khăn xui người ta làm liều, bất chấp lương tri và những luật lệ thông thường. Câu tục ngữ ý nói khi thiếu thốn khiến người ta làm việc phi pháp bất lương."
  },
  {
    "id": "144",
    "text": "Ếch tháng Ba, gà tháng Bảy",
    "meaning": "Câu tục ngữ quen tai, nói về ếch mùa xuân thơm béo, gà mùa hè thơm ngon. Vào tháng ba, sau thời gian ở trong hang tránh rét, gặp thời tiết ấm áp, ếch ra khỏi hang có nhiều thức ăn và chuẩn bị sinh sản. Vì vậy, ếch vào tháng ba rất béo, thịt ngon. Tháng Bảy mùa mưa, mát mẻ đất trời, côn trùng, giun dế cũng sinh sôi nảy nở, trở thành nguồn ăn dồi dào cho gà, vì thế thịt gà thời này cũng ngon hơn hẳn."
  },
  {
    "id": "145",
    "text": "Em tưởng nước giếng sâu Em nối sợi gàu dài",
    "meaning": "Câu ca dao là lời than trách của người con gái về tình duyên lỡ làng. Cô gái tưởng chàng trai có tình cảm sâu sắc, quý mến, nên cô mới dành hết tình cảm, sự yêu thương của mình cho chàng trai. Nhưng cuối cùng, cô đã chọn nhầm người, và cảm thấy chua xót, tiếc nuối với công sức, tình cảm mình đã bỏ ra."
  },
  {
    "id": "146",
    "text": "Ép dầu ép mỡ, ai nỡ ép duyên.",
    "meaning": "Câu tục ngữ đề cao tình yêu tự nguyện, không có sự ép buộc. Trên đời này, người ta chỉ ép dầu, ép mỡ, chứ không ai có thể bắt ép ta phải yêu một người mà bản thân mình không yêu. Tình yêu ép buộc sẽ luôn không có sự hạnh phúc và bền lâu."
  },
  {
    "id": "147",
    "text": "Em ơi chị bảo em này, Trứng chọi với đá có ngày vỡ tan",
    "meaning": "Câu ca dao là lời dặn dò con người ta phải biết lựa sức mình trong từng hoàn cảnh, không nên ngạo mạn."
  },
  {
    "id": "148",
    "text": "Em về, anh mượn khăn tay Gói câu tình nghĩa lâu ngày sợ quên.",
    "meaning": "Câu ca dao như lời nhắn nhủ ý nhị, tình cảm của chàng trai trước khi xa người yêu: cho dù có xa nhau, nhưng chớ nên quên tình cảm mặn nồng, phụ bạc nghĩa tình."
  },
  {
    "id": "149",
    "text": "Em thời đi cấy ruộng bông, Anh đi cắt lúa để chung một nhà.",
    "meaning": "Bài ca dao thể hiện tình cảm gia đình, lòng hiếu thảo và sự chia sẻ công việc của người vợ người chồng. Từ đó nhấn mạnh vai trò và trách nhiệm của mỗi thành viên trong gia đình, cùng sự đoàn kết và sẵn sàng hỗ trợ, vun vén hạnh phúc. Đồng thời nhắc nhở chúng ta phải biết nuôi dưỡng và phụng sự cha mẹ để tình cảm này được truyền cho đời sau."
  },
  {
    "id": "150",
    "text": "Em thời canh cửi trong nhà Nuôi anh đi học đăng khoa bảng vàng",
    "meaning": "Câu ca dao muốn khẳng định rằng thành công của người chồng luôn có hình bóng, sự đóng góp của người vợ."
  },
  {
    "id": "151",
    "text": "Gió đưa cành trúc la đà Tiếng chuông Trấn Vũ, canh gà Thọ Xương",
    "meaning": "Bài ca dao khẳng định vẻ đẹp của Hà Nội (Thăng Long xưa) với sự cổ kính của đền Trấn Vũ, sự êm đềm của vùng Thọ Xương, tiếng nhịp chày của làng nghề làm giấy Yên Thái và sự bình yên của Hồ Tây. Qua đó, bài ca dao thể hiện niềm tự hào về quê hương và nhắc nhở con người về truyền thống, lịch sử Việt Nam ta."
  },
  {
    "id": "152",
    "text": "Gần mực thì đen, gần đèn thì sáng",
    "meaning": "\"Mực\" vốn là loại mực Tàu dùng để viết của những ông đồ ngày xưa, có màu đen tuyền, dùng để mài cùng nước lấy mực viết. \"Đèn\" là một vật dụng dùng để thắp sáng cho con người, soi tỏ mọi vật. \"Gần mực thì đen\" tức là nếu khi tiếp xúc, sử dụng mực mà không khéo, ta có thể bị vấy bẩn bởi mực, dễ bị lem nhem, xấu xí. \"Gần đèn thì rạng\" tức là nếu gần nơi có ánh sáng thì ta sẽ được soi tỏ bởi lớp ánh sáng ấy, dễ tỏa ra hào quang rực rỡ hơn người khác. Mực còn tượng trưng cho những tác động xấu của môi trường bên ngoài, bao gồm những cá nhân có những thói hư tật xấu, … “Đen” ở đây nghĩa là những điều không tốt. Gần mực thì đen” ý muốn nói, nếu như ở trong một môi trường không tốt, với những con người có lối sống không lành mạnh thì dễ bị tác động theo chiều hướng tiêu cực. Ngược lại, khi ở gần đèn – năng lượng tích cực thì ta sẽ dễ học tập điều tốt đẹp."
  },
  {
    "id": "153",
    "text": "Giấy rách phải giữ lấy lề",
    "meaning": "Nghĩa đen: Dù giấy có rách nhưng cần phải giữ được lề của giấy Nghĩa bóng: Câu tục ngữ khuyên nhủ con người dù cho gặp khó khăn, nghèo khổ đến đâu, vẫn phải giữ gìn phẩm chất tốt đẹp, nếp sống văn minh, truyền thống đạo đức tốt đẹp của gia đình, dân tộc."
  },
  {
    "id": "154",
    "text": "Gió mùa thu mẹ ru con ngủ, Năm canh chầy, thức đủ năm canh.",
    "meaning": "Bài ca dao thể hiện sự tôn vinh của tình mẫu tử và sự chăm sóc của mẹ đối với con cái. Nó thể hiện sự yêu thương vô điều kiện và sự hy sinh của mẹ trong việc nuôi con suốt cuộc đời. Từ đó khuyên chúng ta phải biết yêu thương và kính trọng mẹ mình."
  },
  {
    "id": "155",
    "text": "Giận mất khôn, no mất ngon",
    "meaning": "Khi người ta đã no bụng rồi thì ăn cái gì cũng không thấy ngon. Khi người ta tức giận thì nói năng hành động nhiều điều liều lĩnh mất cả sự khôn ngoan lúc thường. Đại ý câu này khuyên người ta không nên giận dữ vì giận dữ làm người ta mất trí khôn."
  },
  {
    "id": "156",
    "text": "Gió bấc thì hanh, gió nồm thì ẩm",
    "meaning": "Câu tục ngữ là kinh nghiệm về thời tiết của ông cha ta: gió mùa đông bắc thì khô hanh và lạnh, còn gió nồm nam thì ít lạnh hơn, dịu mát nhưng ẩm ướt. Gió bấc hay còn gọi là gió mùa Đông Bắc thường hoạt động chủ yếu ở miền Bắc trong nửa đầu mùa đông, gió đi qua lục địa nên mang tính chất lạnh, khô, ít mưa. Còn gió nồm xuất hiện sau nửa mùa đông, gió lệch qua biển, cấp thêm hơi ẩm, đem lại thời tiết ẩm, có mưa phùn."
  },
  {
    "id": "157",
    "text": "Gió thổi đổi trời",
    "meaning": "Câu tục ngữ có ý nghĩa là sự thay đổi đột ngột của thời tiết do ảnh hưởng của gió. Gió là một yếu tố quan trọng ảnh hưởng đến khí hậu, nó có thể mang theo hơi ẩm, nhiệt độ, áp suất từ nơi khác đến, dẫn đến sự biến đổi của các yếu tố thời tiết như nắng, mưa, nóng, lạnh. Câu tục ngữ này thường được sử dụng để mô tả sự thay đổi nhanh chóng và khó lường của thời tiết. Nó cũng có thể được dùng để ví von cho những biến động trong cuộc sống, những điều bất ngờ có thể xảy ra bất cứ lúc nào."
  },
  {
    "id": "158",
    "text": "Gà đen chân trắng, mẹ mắng cũng mua",
    "meaning": "Câu tục ngữ là kinh nghiệm của ông cha ta trong nuôi gia súc, gia cầm. Theo kinh nghiệm, gà đen chân trắng dễ nuôi, chóng lớn, khả năng đề kháng bệnh rất tốt."
  },
  {
    "id": "159",
    "text": "Giàu đổi bạn, sang đổi vợ",
    "meaning": "Câu tục ngữ châm chọc những người khi nghèo khó thì nương tựa vào người khác nhưng một khi đã thăng quan tiến chức thì không biết trả ơn."
  },
  {
    "id": "160",
    "text": "Già mạ tốt lúa",
    "meaning": "Một kinh nghiệm cấy trồng là mạ đủ ngày đủ tháng cứng cây thì cấy chóng bén rễ từ đó lúa tốt hơn, dễ bội thu."
  },
  {
    "id": "161",
    "text": "Gió may quay mồm",
    "meaning": "Câu tục ngữ là kinh nghiệm đúc kết của ông cha ta, nhắc nhở mọi người cần phải cẩn thận với gió may kẻo méo mồm hay có những ảnh hưởng xấu tới sức khỏe."
  },
  {
    "id": "162",
    "text": "Gió thổi là chổi trời",
    "meaning": "Câu tục ngữ khẳng định sức mạnh to lớn của gió. Tác giả dân gian đã ví cơn gió như cái chổi trời với Sức mạnh ghê gớm của gió, có thể quét sạch mọi thứ trên mặt đất."
  },
  {
    "id": "163",
    "text": "Gà trắng chân chì, mua chi giống ấy",
    "meaning": "Gà trắng mà chân đen thì lười kiếm ăn, chậm lớn và hay bị toi, không nên nuôi."
  },
  {
    "id": "164",
    "text": "Học thầy không tày học bạn",
    "meaning": "Câu tục ngữ có nghĩa là Học thầy không bằng học bạn. Câu tục ngữ này không muốn hạ thấp vai trò của người thầy mà muốn nhấn mạnh tầm quan trọng của việc học ở bạn bè. Ngoài thầy cô thì bạn bè và những người xung quanh cũng sẽ mang đến cho bạn rất nhiều bài học. Không chỉ là bài học về cuộc sống mà nhờ tiếp xúc cùng các mối quan hệ xung quanh chúng ta bắt đầu học được cách đối nhân xử thế."
  },
  {
    "id": "165",
    "text": "Học ăn, học nói, học gói, học mở",
    "meaning": "Từ câu tục ngữ, người xưa muốn khuyên răn con người nên khéo léo trong công việc, cách đối nhân xử thế cuộc sống hàng ngày. Chúng ta cần biết học tập từ những thứ nhỏ nhặt, cơ bản nhất: trong ăn uống phải biết phép lịch sự; trong giao tiếp phải biết cách xưng hô nói năng lễ phép, nhã nhặn; trong cuộc sống cần biết giữ gìn tiết kiệm, .... Ngoài những kiến thức trong sách vở, chúng ta còn phải học những kỹ năng trong cuộc sống. Có như thế mới trở thành người có văn hóa trong xã hội."
  },
  {
    "id": "166",
    "text": "Hổ dữ không ăn thịt con",
    "meaning": "Hổ hung dữ là thế nhưng “máu chảy ruột mềm” hổ vẫn yêu thương và bảo vệ con của mình. Câu tục ngữ suy rộng ra có nghĩa là đến con hổ tàn bạo như thế còn không ăn thịt con mình thì trên đời này, không người mẹ nào đối xử nhẫn tâm với con mình được. Đồng thời qua đó phê phán những bậc cha mẹ, người thân đối xử tệ bạc với các con, các cháu với “máu mủ ruột thịt” trong chính gia đình mình."
  },
  {
    "id": "167",
    "text": "Hỡi cô tát nước bên đàng, Sao cô múc ánh trăng vàng đổ đi?",
    "meaning": "Câu ca dao ở dạng một câu hỏi chỉ để lấy một cái cớ làm quen. Và hiểu cho cùng, nói trăng là để giãi bày lòng mình của chàng trai. Và cô gái cũng đang ở trạng thái làm ngơ trước hành động và lời nói của chàng trai. Câu ca dao này khuyến khích sự nhạy bén, tinh tế và trân trọng những giá trị tốt đẹp trong mối quan hệ tình yêu để giữ được tình yêu lâu dài và hạnh phúc."
  },
  {
    "id": "168",
    "text": "Học thầy học bạn, vô vạn phong lưu",
    "meaning": "Câu tục ngữ là lời khuyên quý giá cho con người về tầm quan trọng của việc học tập. Cần học tập từ thầy cô và bạn bè để thu thập kiến thức, rèn luyện kĩ năng và hoàn thiện bản thân. Học tập là con đường để đạt được thành công và có một cuộc sống tốt đẹp."
  },
  {
    "id": "169",
    "text": "Học là học biết giữ giàng Biết điều nhân nghĩa biết đàng hiếu trung",
    "meaning": "Câu ca dao nói về tầm quan trọng của việc học. Học là để biết giữ gìn, nhận biết được những điều hay lẽ phải trong cuộc sống, biết yêu thương con người, đồng thời học để bồi đắp lòng hiếu thảo, sự biết ơn đối với ông bà, cha mẹ."
  },
  {
    "id": "170",
    "text": "Học là học để làm người Biết điều hơn thiệt biết lời thị phi",
    "meaning": "Học để làm người: Nhấn mạnh mục đích cao cả của việc học không chỉ đơn thuần là tiếp thu các kiến thức trong sách, học tập còn giúp con người rèn luyện đạo đức, nhân cách, trở thành người có ích cho xã hội. Kiến thức sách vở cần được vận dụng vào thực tiễn, thể hiện qua hành động, lời nói, ứng xử phù hợp với chuẩn mực đạo đức. Biết điều hơn thiệt biết lời thị phi: Học để phân biệt được đúng sai, phải trái, có thể nhận thức, đánh giá được các sự việc diễn ra trong cuộc sống. Đồng thời, học cũng có thể giúp chúng ta có được sự tỉnh táo, sáng suốt để không bị tác động bởi những lời nói không hay, giữ gìn phẩm giá của bản thân. Khái quát: Câu ca dao nói về mục đích và tầm quan trọng của việc học tập, thể hiện quan niệm giáo dục đúng đắn của ông cha từ từ xưa, đề cao giá trị đạo đức và nhân cách con người hơn là kiến thức trong sách vở."
  },
  {
    "id": "171",
    "text": "Học đi đôi với hành",
    "meaning": "Câu tục ngữ đề cao vai trò của việc kết hợp thực hành và học lý thuyết trong học tập nói riêng và trong các ngành nghề nói chung. Nếu chỉ học mỗi lý thuyết, chúng ta sẽ không có kĩ năng làm việc, đồng thời cũng bị nhanh quên kiến thức hơn."
  },
  {
    "id": "172",
    "text": "Hết tiền tài, hết nhân nghĩa",
    "meaning": "Câu tục ngữ nói về mối quan hệ chỉ vì tiền, chứ không phải vì tình nghĩa. Nếu ta hết tiền, người cũng bỏ đi, không tiếp tục mối quan hệ với ta nữa."
  },
  {
    "id": "173",
    "text": "Học là học để mà hành Vừa hành vừa học mới thành người khôn",
    "meaning": "Câu ca dao nhấn mạnh mục đích của học tập không chỉ để thu thập kiến thức lý thuyết mà còn để vận dụng vào thực tế cuộc sống. Đồng thời, câu ca dao cũng khẳng định mối quan hệ chặt chẽ giữa học và thực hành, hai hoạt động này cần kết hợp chặt chẽ với nhau để đạt hiệu quả cao nhất."
  },
  {
    "id": "174",
    "text": "Hay học thì sang, hay làm thì có",
    "meaning": "Câu tục ngữ nhắc nhở chúng ta chỉ khi chăm chỉ học tập mới có nhiều kiến thức, nhiều tiền tài; cần mẫn làm việc mới có được thành công trong cuộc đời."
  },
  {
    "id": "175",
    "text": "Học đâu hiểu đấy.",
    "meaning": "Nghĩa đen: Học những cái gì thì hiểu ngay những cái đấy. Nghĩa bóng: Câu tục ngữ nói về những người sáng dạ, thông minh, tiếp thu nhanh những kiến thức đã học"
  },
  {
    "id": "176",
    "text": "Học hành vất vả kết quả ngọt bùi",
    "meaning": "Câu tục ngữ nói về ý nghĩa của học tập tự giác, tích cực. Sự cần cù và chăm chỉ trong học tập sẽ giúp ta có được thành quả tốt"
  },
  {
    "id": "177",
    "text": "Không thầy đố mày làm nên",
    "meaning": "“Không thầy đố mày làm nên” ý chỉ nếu không có người thầy thì chúng ta không thể nên người được. Tuy nhiên, câu tục ngữ này mang hàm nghĩa sâu rộng hơn đó là nói về sự tôn sư trọng đạo và lòng biết ơn đối với người thầy của mình. Nếu như không có người thầy định hướng đúng đắn, dạy dỗ và bảo ban ta từng bước đi thì chúng ta sẽ không bao giờ có cơ hội đạt được tới thành công. Câu tục ngữ như một lời thách đố đồng thời cũng là lời răn dạy mang tính khẳng định chắc nịch vai trò, vị trí quan trọng của người thầy đối với sự thành đạt của học trò."
  },
  {
    "id": "178",
    "text": "Khoai đất lạ, mạ đất quen",
    "meaning": "Dân gian có câu “khoai đất lạ, mạ đất quen”, nghĩa là trồng khoai trên đất mới sẽ cho năng suất cao hơn so với trồng nhiều vụ trên cùng một thửa đất. Do quá trình sống của khoai khai thác khoáng chất của đất, thu hoạch khoai không trả lại khoáng cho đất làm khoai bị thiếu khoáng khi trồng ở các vụ sau. Còn mạ thì ưa đất quen thì nó mới tốt .Đó là kinh nghiệm quý báu cho việc canh tác, trồng trọt của ông ta xưa cho việc phát triển kinh tế, nhu cầu cuộc sống bản thân."
  },
  {
    "id": "179",
    "text": "Khôn ngoan đối đáp người ngoài Gà cùng một mẹ chớ hoài đá nhau",
    "meaning": "Câu ca dao nhắc nhở rằng đã là người cùng một nhà phải yêu thương, gắn kết với nhau. Có hạnh phúc thì cùng sẻ chia, có khó khăn thì cũng đừng ngần ngại gánh vác cùng nhau. Người cùng một nhà mà không yêu tương nhau sẽ bị xã hội chê cười và còn làm mất hạnh phúc gia đình."
  },
  {
    "id": "180",
    "text": "Kiến tha lâu đầy tổ",
    "meaning": "Nghĩa đen: Con kiến rất nhỏ bé, mỗi lần chỉ tha được một ít mồi, nhưng tha mãi cũng có ngày đầy tổ. Nghĩa bóng (lời khuyên): Nhiều cái nhỏ dồn lại sẽ thành cái lớn, kiên trì và nhẫn nại thì ắt sẽ thành công."
  },
  {
    "id": "181",
    "text": "Khéo ăn thì no, khéo co thì ấm.",
    "meaning": "Nghĩa đen: Nếu bạn khéo léo chi tiêu ăn uống thì sẽ được ăn no, khéo léo co người lại thì sẽ có đủ chăn ấm. Nghĩa bóng: Câu tục ngữ đề cao sự khéo léo trong chi tiêu và kĩ năng xã hội của con người. Khi bạn chi tiêu khéo, bạn sẽ không lo bị nghèo; khi bạn khéo léo giao tiếp, bạn sẽ được lòng mọi người."
  },
  {
    "id": "182",
    "text": "Khôn ngoan chẳng lọ thật thà Lường thưng, tráo đấu, chẳng qua đong đầy.",
    "meaning": "Câu ca dao khuyên răn chúng ta nên thật thà, không lươn lẹo, dối trá. Người sống thật thà, chất phác còn quý hơn người sống khôn ngoan."
  },
  {
    "id": "183",
    "text": "Kính lão đắc thọ",
    "meaning": "“Kính lão đắc thọ” là câu tục ngữ khuyên chúng ta phải biết kính trọng người già. Cụ thể theo nghĩa của từng từ, “kính lão” là kính trọng người già; còn “đắc thọ” là nhận lại được tuổi cao, sống lâu."
  },
  {
    "id": "184",
    "text": "Kiến dọn tổ thời mưa",
    "meaning": "Câu tục ngữ là một kinh nghiệm dự đoán thời tiết là kiến cánh bay ra nhiều, dọn tổ lên chỗ cao báo hiệu sắp có mưa hoặc bão lụt."
  },
  {
    "id": "185",
    "text": "Không có lửa sao có khói",
    "meaning": "Nghĩa đen: Phải có lửa thì vật mới bốc ra khói được. Nghĩa bóng: Mọi việc diễn ra đều có nguyên nhân. Không có người gây ra thì sẽ không xảy ra chuyện đó."
  },
  {
    "id": "186",
    "text": "Kính già, già để tuổi cho",
    "meaning": "Câu tục ngữ răn dạy chúng ta phải biết lễ phép, tôn trọng với những người lớn tuổi. Khi đó, người già sẽ vui vẻ để lại phước cho mình, chúng ta thấy hạnh phúc và càng sống lâu."
  },
  {
    "id": "187",
    "text": "Kiến đen tha trứng lên cao Thế nào cũng có mưa rào rất to",
    "meaning": "Câu ca dao thể hiện kinh nghiệm quý báu của ông cha ta trong việc dự báo thời tiết. Theo đó, khi thấy kiến đen di chuyển trứng lên cao (thường là trên cành cây hoặc gò mối cao) thì thường sẽ có mưa rào lớn xảy ra. Về góc độ khoa học, kiến đen là loài vật nhạy cảm với sự thay đổi áp suất khí quyển. Khi áp suất khí quyển giảm, báo hiệu sắp có mưa lớn, kiến đen sẽ di chuyển trứng lên cao để tránh bị nước lũ cuốn trôi."
  },
  {
    "id": "188",
    "text": "Khôn ngoan chẳng lo nói nhiều, người khôn dù nói nửa điều cũng khôn",
    "meaning": "Chỉ có những kẻ ngốc mới nói dài, thành ra nói dại. Họ mạnh mồm thể hiện ta giỏi, ta khôn, coi người xung quanh trở thành phường ngu dốt mà không biết rằng, càng khoe khoang thứ gì, càng dễ mất đi thứ đó. Ngược lại, người thông minh và bản lĩnh thì thường kiệm lời, nói ít thay vì mất công trình bày này nọ thì họ chứng minh bằng hành động của mình và lời nào nói ra cũng đều hợp tình, hợp lý."
  },
  {
    "id": "189",
    "text": "Không tại mạ, tại lạ tay bừa",
    "meaning": "Câu tục ngữ là kinh nghiệm của ông cha ta khi cấy lúa, gieo mạ: Kỹ thuật bừa đất để gieo mạ vô cùng quan trọng, cùng là cây mạ đấy nhưng bừa đất không khéo mạ có thể chết."
  },
  {
    "id": "190",
    "text": "Không nước không phân chuyên cần vô ích",
    "meaning": "Nếu cây không được cung cấp chất dinh dưỡng cần thiết như nước và phân để nuôi dưỡng và phát triển thì dù bỏ ra bao nhiêu công sức gieo trồng thì cũng vô dụng. Câu tục ngữ là kinh nghiệm trồng trọt của ông cha ta truyền lại cho con cháu đời sau, nhắc nhở tầm quan trọng của nước và phân bón."
  },
  {
    "id": "191",
    "text": "Lúa chiêm lấp ló đầu bờ Hễ nghe tiếng sấm phất cờ mà lên",
    "meaning": "Lúa chiêm lấp ló đầu bờ miêu tả hình ảnh những cây lúa vụ chiêm đang ở giai đoạn đàu của sự sinh trưởng, mọc lên khỏi mặt nước và bắt đầu lọ ra khỏi bờ ruộng Tiếng sấm thường đi kèm với mưa. Mưa là nguồn nước quan trọng cho sự phát triển của cây lúa, đặc biệt là lúa chiêm được trồng vào mùa nước nổi. Câu ca dao là kinh nghiệm quý báu của ông cha ta trong việc quan sát hiện tượng tự nhiên và dự đoán sự sinh trưởng của lúa."
  },
  {
    "id": "192",
    "text": "Lá lành đùm lá rách",
    "meaning": "Câu tục ngữ có nghĩa là chiếc lá rách ít thì che phủ, đùm lá rách nhiều lại. “Lá lành” ở đây còn biểu tượng cho người có cuộc sống thuận lợi, dư dả còn “lá rách” là người có cuộc sống cực khổ, khó khăn. Câu tục ngữ muốn khuyên răn con người nên yêu thương, đùm bọc, giúp đỡ lẫn nhau."
  },
  {
    "id": "193",
    "text": "Lửa thử vàng, gian nan thử sức.",
    "meaning": "Câu tục ngữ nói về việc chỉ có gian lao, thử thách thì mới giúp con người có cơ hội chứng tỏ bản lĩnh của mình. Nếu vượt qua được gian nan, bạn sẽ giống như thỏi vàng quý giá. Qua đó, tác giả dân gian nhắc nhở chúng ta cần kiên trì, dũng cảm đối đầu với khó khăn."
  },
  {
    "id": "194",
    "text": "Làm ruộng ăn cơm nằm, chăn tằm ăn cơm đứng",
    "meaning": "Câu tục ngữ muốn nói đến nỗi khó nhọc, vất vả của nghề nuôi tằm. Đây là một công việc rất bận rộn khiến người chăn nuôi không có nhiều thời gian."
  },
  {
    "id": "195",
    "text": "Lá rụng về cội.",
    "meaning": "Nghĩa đen: Khi rụng, lá sẽ rụng xuống gốc cây. Nghĩa bóng: Con người dù có ở đâu, làm gì, thì cuối cùng vẫn phải trở về với quê hương, nguồn cội, nơi mình đã sinh ra. Từ đó, chúng ta cần phải nhớ tới nguồn gốc của mình."
  },
  {
    "id": "196",
    "text": "Lên non mới biết non cao, Nuôi con mới biết công lao mẫu tử.",
    "meaning": "Câu ca dao đã mượn hình ảnh trèo lên núi vất vả để ca ngợi tình cha mẹ thiêng liêng. Khi có con, chúng ta mới biết cha mẹ đã vất vả, cực nhọc, thức khuya dậy sớm chăm sóc, nuôi dưỡng chúng ta nên người."
  },
  {
    "id": "197",
    "text": "Luyện mãi thành tài, miệt mài tất giỏi",
    "meaning": "Câu tục ngữ đã đưa ra cho chúng ta bài học về ý chí, nghị lực. Để đạt được thành công, chúng ta sẽ gặp nhiều thử thách, khó khăn; chỉ khi chúng ta kiên trì, quyết tâm, dám vượt qua chông gai thì mới gặt được trái ngọt."
  },
  {
    "id": "198",
    "text": "Làm ruộng không trâu, làm giàu không thóc",
    "meaning": "Câu tục ngữ đề cao vai trò của con trâu và hạt thóc trong sản xuất nông nghiệp. Người làm giàu mà không có thóc thì tức là vẫn chưa thể giàu nhanh được, cũng như người đi cày mà không có trâu thì không cày được ruộng."
  },
  {
    "id": "199",
    "text": "Lời nói chẳng mất tiền mua Lựa lời mà nói cho vừa lòng nhau.",
    "meaning": "Câu ca dao khuyên chúng ta cần biết suy nghĩ, lựa chọn lời ăn tiếng nói. Lời nói không mất tiền mua, vì vậy mà chúng ta cần nói những lời hay ý đẹp với nhau, tránh để mất lòng người khác."
  },
  {
    "id": "200",
    "text": "Lá tre trôi lộc, mùa rét xộc đến",
    "meaning": "Xưa kia, ông cha ta còn nhìn cây tre để nghe ngóng về thời tiết. Câu tục ngữ là kinh nghiệm nhìn vào lá tre, lộc trên cây tre để biết được mùa đông tới."
  },
  {
    "id": "201",
    "text": "Lời chào cao hơn mâm cỗ.",
    "meaning": "Câu tục ngữ ca ngợi tầm quan trọng của lời chào. Lời chào có ý nghĩa vô cùng to lớn với mỗi người, vì nó đánh giá được tính cách, ý thức của từng cá nhân. Chính vì thế mà nhân dân xưa mới ví lời chào còn quan trọng hơn mâm cỗ đầy."
  },
  {
    "id": "202",
    "text": "Làm ruộng thì ra, làm nhà thì tốn",
    "meaning": "Câu tục ngữ ý nói: Làm nhà cửa rất tốn kém, thường vượt quá khoản trù định ban đầu. Còn làm ruộng thì ta có thu hoạch, có thêm thu nhập, chẳng tốn đồng nào lại còn có tiền để ra."
  },
  {
    "id": "203",
    "text": "Làm thầy nuôi vợ, làm thợ nuôi miệng",
    "meaning": "Làm thầy ở đây là làm thầy bói, thầy đồng, thầy cúng, … Sau mỗi lần hành nghề xong, các thầy không chỉ được ăn uống no say, mà còn thu hoạch được nhiều của cải vật chất mang về nhà để nuôi sống gia đình, vợ con. Còn “làm thợ” (bao gồm: thợ mộc, thợ nề, thợ sơn, thợ vẽ, thợ bạc, thợ hồ, thợ may... ) thì nhìn chung thu hoạch quá thấp, chỉ đủ để nuôi sống bản thân mà thôi."
  },
  {
    "id": "204",
    "text": "Lươn ngắn lại chê chạch dài, Thờn bơn méo miệng chê chai lệch mồm.",
    "meaning": "Câu ca dao đã mượn hình ảnh những loài cá để châm biếm những kẻ có thái độ tự cao, tự đại, luôn chê bai, dè bỉu người khác mà không biết mình cũng có tật xấu."
  },
  {
    "id": "205",
    "text": "Một cây làm chẳng nên non Ba cây chụm lại nên hòn núi cao",
    "meaning": "Nghĩa đen: Một cái cây thì không thể làm thành một ngọn núi. Nhiều cái cây hợp lại mới tạo ra một ngọn núi cao. Nghĩa bóng: Câu tục ngữ răn dạy chúng ta cần phải đoàn kết với nhau, như vậy thì chúng ta mới có thể vượt qua được mọi gian nan, sóng gió của cuộc đời."
  },
  {
    "id": "206",
    "text": "Mống Đông vồng Tây, chẳng mưa dây cũng bão giật",
    "meaning": "Câu tục ngữ là một kinh nghiệm dự đoán thời tiết. Nếu trời có cầu vồng ở phía đông hoặc phía tây là sắp có mưa to gió lớn, bà con nông dân nên thu gọn thóc lúa, bảo vệ gia súc, gia cầm."
  },
  {
    "id": "207",
    "text": "Mưa tháng Ba hoa đất",
    "meaning": "Câu tục ngữ phản ánh kinh nghiệm làm nông của nhân dân ta thời xưa. Vào tháng Ba, thời tiết rất oi nóng, đất đai cằn cỗi, là điều kiện không thuận lợi cho việc trổ bông của lúa. Chính vì vậy, cơn mưa vào tháng Ba đối với người dân rất quan trọng, bởi nó sẽ giúp cây lúa thêm tốt tươi, từ đó người nông dâng có mùa màng bội thu."
  },
  {
    "id": "208",
    "text": "Mây kéo xuống biển thì nắng chang chang, Mây kéo lên ngàn thì mưa như trút",
    "meaning": "Câu ca dao là kinh nghiệm dự báo thời tiết của ông cha ta để lại. Theo đó, khi mây di chuyển từ trên cao xuống biển thì sẽ mang theo hơi nước ấm, khiến cho trời trở nên nắng nóng. Ngược lại, khi mây kéo từ dưới lên trên (lên núi), nó thường mang theo hơi nước lạnh, khiến cho trời trở nên u ám và có thể dẫn đến mưa lớn."
  },
  {
    "id": "209",
    "text": "Mau sao thì nắng, vắng sao thì mưa",
    "meaning": "Câu tục ngữ có nghĩa là vào đêm hôm trước, khi quan sát trời nhiều (dày) sao thì ngày hôm sau sẽ nắng; trời ít (vắng) sao sẽ mưa. Trời nhiều sao thì ít mây, do đó sẽ có nắng. Ngược lại, trời ít sao thì nhiều mây, vì vậy thường có mưa."
  },
  {
    "id": "210",
    "text": "Muốn lành nghề chớ nề học hỏi",
    "meaning": "Câu tục ngữ trên là lời của thế hệ trước nhắc nhở thế hệ sau của chúng ta những bài học sâu sắc và hữu ích. Muốn thành thạo, giỏi giang thì phải ham học hỏi, có ý chí cầu tiến, khiêm nhường, không ngại khó, ngại học, học hỏi từ tất cả mọi người xung quanh, kể cả bạn bè của mình."
  },
  {
    "id": "211",
    "text": "Một con ngựa đau, cả tàu bỏ cỏ",
    "meaning": "Nghĩa đen: Khi một con ngựa bị đau, tất cả những con ngựa khác trong chuồng ngựa đều lo lắng mà không ăn cỏ. Nghĩa bóng: Câu tục ngữ đã khuyên nhủ chúng ta phải biết đoàn kết, yêu thương lẫn nhau, giúp đỡ nhau trong lúc khó khăn."
  },
  {
    "id": "212",
    "text": "Một giọt máu đào hơn ao nước lã.",
    "meaning": "Nghĩa đen: Một giọt máu đào còn quý và quan trọng hơn một ao nước lã. Nghĩa bóng: Câu tục ngữ đề cao tình nghĩa giữa những người có quan hệ máu mủ ruột thịt với nhau. Chúng ta có thể gặp rất nhiều người lạ, nhưng những người đó sẽ không thể quan trọng bằng những người thân trong gia đình."
  },
  {
    "id": "213",
    "text": "Muốn sang thì bắc cầu Kiều Muốn con hay chữ thì yêu lấy thầy.",
    "meaning": "Câu ca dao nhắc tới truyền thống tôn sư trọng đạo. Muốn được coi là giàu sang, phú quý thì trong nhà cần có cái cầu Kiều; còn muốn biết chữ, có thêm những kiến thức hay thì phải biết kính trọng, yêu mến, tôn trọng người thầy. Đây là một truyền thống tốt đẹp đã được lưu truyền ngàn đời nay của dân tộc ta."
  },
  {
    "id": "214",
    "text": "Một mặt người bằng mười mặt của.",
    "meaning": "Nghĩa đen: Một tính mạng của con người quý giá hơn mười lần số tài sản của người đó. Nghĩa bóng: Câu tục ngữ nhắc nhở mỗi chúng ta cần phải biết quý trọng sức khỏe của mình, bởi cho dù có nhiều tiền bạc nhưng không có sức khỏe thì chúng ta cũng không cảm thấy vui vẻ, hạnh phúc."
  },
  {
    "id": "215",
    "text": "Mây xanh thì nắng, mây trắng thì mưa",
    "meaning": "Mây xanh thì nắng, mây trắng thì mưa là một câu tục ngữ phản ánh kinh nghiệm dự đoán thời tiết dựa vào sắc mây của dân gian. Khi nhìn lên bầu trời thấy trời cao, hễ lúc nào thấy mây xanh thì trời có nắng, ngược lại nếu thấy mây trắng bay đầy, bầu trời thấp thì sẽ có mưa."
  },
  {
    "id": "216",
    "text": "Mưa tháng Tư hư đất",
    "meaning": "Tháng tư là tháng gần thu hoạch mùa màng: lúa sắp chín, khoai đỗ sắp thu hoạch. Chính vì vậy, tháng tư mà mưa nhiều sẽ gây thiệt hại lớn cho nhà nông."
  },
  {
    "id": "217",
    "text": "Một chữ cũng là thầy, nửa chữ cũng là thầy.",
    "meaning": "Nghĩa đen: Cho dù người dạy bạn có dạy bạn ít hay nhiều kiến thức, thì người ấy vẫn được coi là thầy của bạn. Nghĩa bóng: Câu tục ngữ khuyên răn chúng ta phải luôn biết ơn thầy cô, trân trọng công sức mà người giáo viên đã dành ra để giúp bạn biết những điều hay, lẽ phải."
  },
  {
    "id": "218",
    "text": "Nhất thì, nhì thục",
    "meaning": "Câu tục ngữ nêu lên kinh nghiệm về kĩ thuật trồng trọt, làm lúa nước Thứ nhất là phải coi trọng thời vụ. Trái thời vụ, thời tiết là thất bát. Thứ nhì là phải cày sâu cuốc bẫm, vun xới, chăm bón, làm cỏ, không để ruộng đất hoang hóa, bạc màu; làm cho đất đai ngày một thêm màu mỡ. Yếu tố thời gian, mùa vụ, yếu tố đất đai là hai yếu tố tạo nên mùa màng tốt tươi, năng suất cao, bội thu."
  },
  {
    "id": "219",
    "text": "Nhất nước, nhì phân, tam cần, tứ giống",
    "meaning": "Câu tục ngữ muốn thể hiện kinh nghiệm trồng lúa nước nói riêng và sản xuất nông nghiệp nói chung. “Nước”, “phân”, “cần” và “giống” là 4 yếu tố quan trọng, không thể thiếu khi canh tác, trồng trọt. Đây là 4 yếu tố bổ trợ cho nhau và không thể tách rời."
  },
  {
    "id": "220",
    "text": "Nắng chóng trưa, mưa chóng tối",
    "meaning": "Câu tục ngữ chính là một trong những kinh nghiệm xem xét thời tiết quý báu của cha ông ta ngày trước. Cứ vào ngày mưa là sẽ biết trời chóng tối, còn ngày nắng thì chóng trưa, cần ra đồng sớm hơn. Từ đó rút kinh nghiệm để công việc trồng trọt, chăn nuôi được tốt hơn."
  },
  {
    "id": "221",
    "text": "Người đẹp vì lụa, lúa tốt vì phân",
    "meaning": "Người đẹp vì lụa: Vẻ đẹp của con người phụ thuộc rất nhiều vào cách ăn mặc, trang điểm Lúa tốt vì phân: Để cây lúa phát triển tốt, cho năng suất cao, cần biết cách chăm sóc, cung cấp đủ chất dinh dưỡng => Vẻ đẹp của con người không phải tự nhiên có mà cần phải được trau dồi, hoàn thiện qua thời gian. Tương tự, cây lúa cần được chăm sóc thường xuyên để phát triển tốt Ý nghĩa sâu xa: Câu tục ngữ này còn có thể được hiểu theo một nghĩa rộng hơn, đó là mọi sự vật hiện tượng trên đời đều cần có điều kiện thuận lợi để phát triển. Muốn đạt được thành công trong bất kỳ lĩnh vực nào, con người cần phải nỗ lực, không ngừng học hỏi và hoàn thiện bản thân."
  },
  {
    "id": "222",
    "text": "Nhất tự vi sư, bán tự vi sư",
    "meaning": "Nghĩa đen: một chữ là thầy, nửa chữ cũng là thầy Nghĩa bóng: Nhấn mạnh tầm quan trọng của việc tôn sư trọng đạo. Dù chỉ học được một nửa kiến thức, một phần kiến thức từ thầy cũng cần phải trân trọng và biết ơn"
  },
  {
    "id": "223",
    "text": "Người ta là hoa đất.",
    "meaning": "Câu tục ngữ đã khẳng định giá trị to lớn, thiêng liêng của con người. Mỗi người đều mang vẻ đẹp, những giá trị tốt đẹp riêng. Qua đó, câu tục ngữ nhắn nhủ tới chúng ta đừng nên tự ti, mà hãy cố gắng phát triển, trau dồi bản thân để khẳng định vẻ đẹp của mình."
  },
  {
    "id": "224",
    "text": "Nhân bất học, bất tri lí",
    "meaning": "Nghĩa đen: người không học thì không hiểu biết các lí lẽ trong cuộc sống Nghĩa bóng: Câu tục ngữ khẳng định tầm quan trọng của việc học đối với con người. Chỉ khi học tập không ngừng thì con người mới có được sự hiểu biết về cuộc sống"
  },
  {
    "id": "225",
    "text": "Nhất canh trì, nhị canh viên, tam canh điền.",
    "meaning": "Qua câu tục ngữ, tác giả dân gian đã liệt kê ra những công việc được ưu tiên trong lao động sản xuất thời xưa: Thứ nhất là thả ao, nuôi cá vì đây là công việc đem lại nhiều hiệu quả nhất; sau đó mới đến làm vườn, và cuối cùng là làm ruộng."
  },
  {
    "id": "226",
    "text": "Nước chảy đá mòn",
    "meaning": "Nghĩa đen: Những hòn đá ở các con sông, suối sẽ bị mài mòn theo thời gian do dòng chảy mạnh của nước. Nghĩa bóng: Câu tục ngữ khuyên nhủ chúng ta cần phải kiên trì, nhẫn nại, cần mẫn, vững vàng, cố gắng hết sức để theo đuổi mục tiêu trong cuộc sống."
  },
  {
    "id": "227",
    "text": "Nói lời phải giữ lấy lời, Đừng như con bướm đậu rồi lại bay",
    "meaning": "Câu ca dao khuyên mọi người phải biết giữ lời hứa, không được thay đổi, lật lọng. Việc giữ lời hứa cũng thể hiện mình là con người đáng tin tưởng, đề cao chữ tín. Đồng thời, câu ca dao còn phê phán những kẻ chỉ biết hứa suông, không bao giờ chịu trách nhiệm và thực hiện lời hứa của mình."
  },
  {
    "id": "228",
    "text": "Ngựa chạy có bầy, chim bay có bạn",
    "meaning": "Câu tục ngữ nhấn mạnh tầm quan trọng của việc sống chung, làm việc cùng nhau. Cả ngựa và chim đều là những loài sống theo bầy đàn, chúng tìm thấy sự an toàn, sức mạnh và hỗ trợ lẫn nhau trong cộng đồng. Con người cũng giống như các loài vật, chúng ta cần có bạn bè để chia sẻ niềm vui, nỗi buồn, cùng nhau vượt qua khó khăn. Tình bạn là một mối quan hệ quý giá, giúp chúng ta cảm thấy hạnh phúc và ý nghĩa hơn trong cuộc sống. Khi chúng ta sống trong một cộng đồng, chúng ta có thể giúp đỡ và được giúp đỡ bởi những người xung quanh. Sự hỗ trợ lẫn nhau giúp chúng ta hoàn thành tốt hơn các công việc và đạt được mục tiêu."
  },
  {
    "id": "229",
    "text": "Ngọc bất trác, bất thành khí",
    "meaning": "Câu tục ngữ có hàm ý nhắc nhở chúng ta cần rèn luyện, trau dồi kiến thức, kĩ năng, phẩm chất hơn để nâng cao giá trị bản thân mình và được mọi người xung quanh mến mộ."
  },
  {
    "id": "230",
    "text": "Ngọc kia chẳng giũa chẳng mài Cũng thành vô dụng cũng hoài ngọc đi.",
    "meaning": "Câu ca dao sử dụng hình ảnh ẩn dụ “Ngọc kia chẳng giũa chẳng mài” để khuyên răn con người cần rèn luyện, tu dưỡng bản thân để phát huy phẩm chất, tài năng tiềm ẩn, trở thành người có ích cho xã hội."
  },
  {
    "id": "231",
    "text": "Nước lã mà vã nên hồ Tay không mà nổi cơ đồ mới ngoan",
    "meaning": "Câu tục ngữ nhắc nhở mỗi người cần phải biết tự lập, gây dựng sự nghiệp dựa vào sức lực và trí tuệ của mình. Có như vậy, sự nghiệp của bản thân mới phát triển lâu bền."
  },
  {
    "id": "232",
    "text": "Ở hiền gặp lành",
    "meaning": "Ở hiền là sống lương thiện, không vụ lợi, không toan tính việc làm hại đến ai. Gặp lành là kết quả của việc chúng ta sống lương thiện, sau này ta sẽ gặp được nhiều điều may mắn, tốt đẹp trong đời. Câu tục ngữ là lời nhắc nhở, là lời cảnh tỉnh con người hãy trở về với bản chất lương thiện, trở về với chính mình."
  },
  {
    "id": "233",
    "text": "Ơn trời mưa nắng phải thì Nơi thì bừa cạn, nơi thì cày sâu",
    "meaning": "Bài ca dao thể hiện tinh thần lạc quan của những người nông dân về công việc của mình. Đồng thời, khuyên mọi người cần phải lao động, chớ bỏ phí đất đai vì đó nơi tạo nên những thực phẩm giúp nuôi sống con người, là nguồn sống của mọi người và chỉ có lao động mới biến đất đai thành vàng, biến cuộc sống khó khăn thành hạnh phúc, an lành"
  },
  {
    "id": "234",
    "text": "Ở bầu thì tròn, ở ống thì dài.",
    "meaning": "Nghĩa đen: Ở trong bầu thì phải có hình dáng tròn, ở trong ống thì phải có hình dáng dài, có như thế thì cơ thể mới vừa được hai vật dụng ấy. Nghĩa bóng: Lối sống, cách ứng xử của mỗi người phần nào do môi trường sống tạo nên. Chính vì vậy, bạn hãy lựa chọn môi trường sống tốt để học hỏi được điều hay, tránh xa những thứ xấu xa, độc ác."
  },
  {
    "id": "235",
    "text": "Ở nhà nhất mẹ nhì con, Ra đường lắm kẻ còn giòn hơn ta.",
    "meaning": "Câu ca dao khuyên chúng ta cần biết khiêm tốn và luôn học hỏi những điều mới lạ. Khi ở nhà, người mẹ sẽ luôn cho rằng con mình giỏi nhất. Tuy nhiên, khi ra ngoài xã hội, người con mới thấy có rất nhiều người tài giỏi hơn mình rất nhiều."
  },
  {
    "id": "236",
    "text": "Ông tha nhưng bà chẳng tha, còn sợ cái lụt hăm ba tháng Mười",
    "meaning": "Nghĩa là, dù có mưa gió, bão bùng trước đó bao nhiêu trận đi nữa thì người dân vẫn chưa yên tâm nếu như chưa qua ngày 23 tháng 10 âm lịch. Câu tục ngữ nhắc nhở người dân cả nước, đặc biệt nhân dân miền Trung phải đề phòng, chuẩn bị thu dọn mùa màng, gia cố nhà cửa, chuồng trại để phòng bão, lũ."
  },
  {
    "id": "237",
    "text": "Ông bà là ngọc là vàng Ai mà biết quý phúc rơi đầy nhà",
    "meaning": "Câu ca dao thể hiện sự trân trọng, yêu mến ông bà và niềm hạnh phúc khi có ông bà trong gia đình. Ông bà là nguồn cội, là chỗ dựa tinh thần cho con cháu. Khi có ông bà trong gia đình, con cháu được hưởng nhiều sự yêu thương, dạy dỗ, bảo ban và được hưởng nhiều may mắn, hạnh phúc. Câu ca dao cũng là lời nhắc nhở con cháu về đạo hiếu, về trách nhiệm phải biết yêu thương, kính trọng ông bà, cha mẹ."
  },
  {
    "id": "238",
    "text": "Ơn thầy soi lối mở đường Cho con vững bước dặm trường tương lai",
    "meaning": "Câu ca dao thể hiện lòng biết ơn sâu sắc của người học trò đối với thầy cô giáo - những người đã dìu dắt, truyền đạt kiến thức và chắp cánh cho ước mơ của mình."
  },
  {
    "id": "239",
    "text": "Ở chọn nơi, chơi chọn bạn",
    "meaning": "Ở chọn nơi ý muốn nói môi trường sống tác động rất lớn đến con người thế nên chúng ta cần cân nhắc trong việc chọn nơi ở. Chơi chọn bạn cũng tương tự như thế, một người bạn tốt sẽ giúp chúng ta học hỏi thêm rất nhiều điều hay ho và thú vị trong cuộc sống, ngược lại một người bạn xấu sẽ khiến cho chúng ta đi xuống theo chiều hướng tiêu cực."
  },
  {
    "id": "240",
    "text": "Phóng càn phóng đại, ắt phải đến toà",
    "meaning": "Câu tục ngữ khuyên chúng ta cần phải biết kiểm soát tốc độ khi tham gia giao thông, tránh trường hợp vượt quá tốc độ chi phép sẽ dẫn đến bị xử phạt"
  },
  {
    "id": "241",
    "text": "Phúc đức tại mẫu",
    "meaning": "Câu tục ngữ có thể hiểu là “phúc đức từ người mẹ mà ra”. Phúc đức là “điều tốt lành để lại do con cháu do ăn ở tốt, theo quan niệm truyền thống”. Như vậy, ông bà ta xưa cho rằng người mẹ nếu ăn ở tốt sẽ để lại những điều tốt lành cho con."
  },
  {
    "id": "242",
    "text": "Quân tử nhất ngôn, tứ mã nan truy",
    "meaning": "Câu tục ngữ khẳng định giá trị của lời hứa đối với người quân tử. Lời hứa của người quân tử được ví như con ngựa phi nhanh, một khi đã được thốt ra thì không thể thu hồi lại. Do đó, người quân tử cần cẩn trọng trong lời nói, suy nghĩ kỹ trước khi hứa hẹn để tránh thất hứa."
  },
  {
    "id": "243",
    "text": "Quạ tắm thì nắng, sáo tắm thì mưa",
    "meaning": "Câu tục ngữ là kinh nghiệm dự đoán thời tiết. Khi trời đang mưa mà quạ ra tắm thì tức là dấu hiệu báo mưa sắp tạnh còn khi nắng, chim sáo tắm thì trời sẽ đổ mưa."
  },
  {
    "id": "244",
    "text": "Quân tử nông chân, tiểu nhân nông bụng",
    "meaning": "Câu tục ngữ là kinh nghiệm nhìn người của nhân dân thời xưa. Người quân tử thì thường \"nông chân\" - là người có gan bàn chân dày (thể hiện sức khỏe tốt, bước đi vững chắc) thường là người có ý chí kiên cường, thích giúp đỡ người khác. Trong khi đó kẻ tiểu nhân thì \"nông bụng\", hiểu đơn giản là người có suy nghĩ hạn hẹp, nhìn thấp nghĩ ngắn."
  },
  {
    "id": "245",
    "text": "Quen sợ dạ, lạ sợ áo",
    "meaning": "Người đã quen thường quá hiểu nhau nên họ sợ, e dè trước tính tình, bụng dạ của người kia. Còn với người lần đầu gặp gỡ, ta chỉ đánh giá được qua cách ăn mặc."
  },
  {
    "id": "246",
    "text": "Quê ta mía ngọt Nam Đàn Bùi khoai chợ Rộ, thơm cam Xã Đoài",
    "meaning": "Câu ca dao ca ngợi nét đẹp ẩm thực muôn vị của xứ Nghệ, đồng thời thể hiện tình cảm yêu quý, ngưỡng mộ về sự phong phú, đa dạng của nền ẩm thực độc đáo của quê hương, đất nước."
  },
  {
    "id": "247",
    "text": "Qua giêng hết năm qua rằm hết tháng",
    "meaning": "Câu tục ngữ cho thấy thời gian trôi qua rất nhanh chóng, không thể níu giữ hay quay ngược lại. Do đó, mỗi người cần trân trọng từng khoảnh khắc, sống có ý nghĩa và làm việc hiệu quả để không hối tiếc khi thời gian trôi qua."
  },
  {
    "id": "248",
    "text": "Qua sông nên phải lụy đò.",
    "meaning": "Nghĩa đen: Muốn qua sông thì bắt buộc ta phải nhờ vả người lái đò. Nghĩa bóng: Khi ta gặp khó khăn, muốn nhờ vả, nương tựa vào ai đó, ta cần đối xử tốt, năn nỉ, hạ mình, nhẫn nhục, lệ thuộc vào người đang giúp đỡ mình. Câu tục ngữ này vẫn mang một phần ý nghĩa cho tới bây giờ, song không hoàn toàn phù hợp với quan niệm ngày nay."
  },
  {
    "id": "249",
    "text": "Qua đình ngả nón trông đình,  Đình bao nhiêu ngói thương mình bấy nhiêu",
    "meaning": "Câu ca dao thể hiện tình cảm vợ chồng đầy yêu thương, khăng khít. Hơn nữa, tình yêu thương người bạn đời hòa làm một với tình thương quê hương."
  },
  {
    "id": "250",
    "text": "Quân pháp bất vị thân",
    "meaning": "Nghĩa đen: Pháp luật không vì mối quan hệ thân thiết hay tình cảm Nghĩa bóng: Câu tục ngữ thể hiện tinh thần đề cao pháp luật, đề cao sự công bằng, bình đẳng trong xã hội. Ngoài ra, nó cũng thể hiện tinh thần đề cao công lí, lẽ phải trong cuộc sống"
  },
  {
    "id": "251",
    "text": "Ráng mỡ gà, có nhà thì chống",
    "meaning": "Thời xưa, khi chưa có dự báo thời tiết của đài báo, những người nông dân, người ngư dân thường nhìn bầu trời, nhìn ráng, nhìn cầu vồng, nhìn mây, nhìn mống để dự đoán thời tiết. “Ráng mỡ gà” là khi chân bầu trời có màu vàng óng như mỡ gà. Theo kinh nghiệm dân gian, khi chân trời có màu vàng óng như màu mỡ gà là dấu hiệu của mưa to, bão lớn đang chuẩn bị kéo đến. “Có nhà thì chống” nghĩa là cần phải gia cố, sửa sang xung quanh nhà để đảm bảo ngôi nhà vững chãi, chắc chắn, kiên cố khi có mưa bão kéo đến. => Câu tục ngữ là kinh nghiệm quý báu mà cha ông ta đúc kết, được dùng để dự báo tình hình mưa to, bão giông cho người dân, giúp người dân tránh được những mất mát, thiệt hại về người và của."
  },
  {
    "id": "252",
    "text": "Rủ nhau xem cảnh Kiếm Hồ, Xem cầu Thê Húc, xem chùa Ngọc Sơn.",
    "meaning": "Bài ca dao ca ngợi vẻ đẹp nên thơ, hùng vĩ, mang đậm giá trị truyền thống của những danh lam thắng cảnh của đất nước Việt Nam. Bài ca dao còn là lời nhắc nhở về sự biết ơn đối với công lao dựng nước to lớn của các anh hùng đã dũng cảm hy sinh vì độc lập dân tộc."
  },
  {
    "id": "253",
    "text": "Rét tháng Ba bà già chết cóng",
    "meaning": "Tháng Ba âm lịch thường có rét nàng Bân và gió mùa đông bắc, vì thế dù đã cuối xuân chuẩn bị sang đầu hè nhưng vẫn rất lạnh. Câu tục ngữ là kinh nghiệm về thời tiết của nhân dân ta, nhắc nhở mọi người đừng coi thường cái rét tháng Ba."
  },
  {
    "id": "254",
    "text": "Râu tôm nấu với ruột bầu Chồng chan vợ húp gật đầu khen ngon",
    "meaning": "Câu ca dao này là một lời nhắc nhở vô cùng ý nghĩa về giá trị của hạnh phúc gia đình. Mỗi người cần biết trân trọng những gì mình đang có, vun đắp và xây dựng một gia đình hạnh phúc, đầm ấm."
  },
  {
    "id": "255",
    "text": "Rượu lạt uống lắm cũng say Người khôn nói lắm dẫu hay cũng nhàm.",
    "meaning": "Câu ca dao nhắc nhở chúng ta nên kiệm lời, biết lựa chọn lời nói trước khi nói. Khi chúng ta nói nhiều, nhưng nói không có mục đích, nói nhăng nói cuội, thì rất dễ làm người khác cảm thấy khó chịu và nhàm chán."
  },
  {
    "id": "256",
    "text": "Ráng mỡ gà có nhà thì giữ.",
    "meaning": "Câu tục ngữ là bài học cho chúng ta về cách nhận biết thời tiết. Khi thấy bầu trời có màu vàng xen lẫn chút màu hồng, thì tức là sắp có bão to, chúng ta nên có những biện pháp phòng chống kịp thời."
  },
  {
    "id": "257",
    "text": "Rủ nhau đi cấy đi cày Bây giờ khó nhọc, có ngày phong lưu",
    "meaning": "Bài ca dao khẳng định giá trị của lao động sản xuất, khuyên nhủ con người cần phải hăng say lao động, không ngại gian khó, vất vả thì sau này sẽ có ngày đạt được những thành quả tốt đẹp, có một cuộc sống ấm no, hạnh phúc hơn"
  },
  {
    "id": "258",
    "text": "Rau bợ là vợ canh cua",
    "meaning": "Câu tục ngữ là kinh nghiệm trong ẩm thực của người Việt. Rau bợ, hay cỏ bợ, thực chất là một loại cỏ mọc hoang dại, ở môi trường bán thuỷ sinh. Mùa hè, nắng mưa xen kẽ là mùa của cua đồng béo ngậy và rau bợ xanh non. Canh cua nấu với rau bợ không những rất thơm ngon, “phải mùi”, mà theo y học dân gian còn có tác dụng chữa viêm, giải nhiệt, an thần đối với người mắc chứng mất ngủ, khó ngủ."
  },
  {
    "id": "259",
    "text": "Rượu ngon bất luận be sành, Áo rách khéo vá, hơn lành vụng may",
    "meaning": "Câu ca dao có thể tách thành 2 vế với nghĩa cụ thể như sau: Rượu ngon bất luận be sành Nghĩa đen: Chất lượng rượu ngon tự nó sẽ toát lên bất kể đựng trong bình sành bình dân hay bình sứ cao cấp. Nghĩa bóng: Giá trị đích thực của một vật thể hay con người không phụ thuộc vào hình thức bên ngoài mà nằm ở bản chất bên trong. Áo rách khéo vá, hơn lành vụng may Nghĩa đen: Chiếc áo rách nếu được vá may cẩn thận, khéo léo sẽ đẹp hơn và sử dụng được lâu hơn so với chiếc áo lành nhưng may vá vụng về. Nghĩa bóng: Kỹ năng và sự khéo léo có thể giúp ta khắc phục khuyết điểm và biến những điều tưởng chừng như vô dụng trở nên có giá trị. Khái quát: Câu ca dao khẳng định giá trị đích thực bên trong của mỗi con người, sự vật. Khuyên chúng ta cần phải rèn luyện kĩ năng và sự khéo léo để biến những điều bình thường trở nên đặc biệt, biến những khó khăn thành cơ hội."
  },
  {
    "id": "260",
    "text": "Rao ngọc, bán đá",
    "meaning": "Câu tục ngữ dùng để ám chỉ hành vi lừa đảo, dối trá, quảng cáo sai sự thật nhằm thu hút khách hàng, trục lợi cá nhân"
  },
  {
    "id": "261",
    "text": "Rủ nhau xuống bể mò cua Đem về nấu quả mơ chua trên rừng",
    "meaning": "Bài ca dao thể hiện tình yêu chung thủy. Dù sang giàu, dù nghèo khó, khi đã yêu nhau, hai người cần phải yêu thương, một lòng một dạ với nhau. Tình cảm chung thủy cũng là một biểu hiện cao đẹp nhất của đạo làm người."
  },
  {
    "id": "262",
    "text": "Rao mật gấu, bán mật heo",
    "meaning": "Câu tục ngữ dùng để ám chỉ hành vi lừa đảo, dối trá, quảng cáo sai sự thật nhằm thu hút khách hàng, trục lợi cá nhân"
  },
  {
    "id": "263",
    "text": "Sông có khúc, người có lúc",
    "meaning": "“Sông có khúc” nghĩa là nói đến con sông, có chỗ thẳng, có chỗ gấp khúc được ví như cuộc sống của con người có lúc này lúc khác, lúc buồn, lúc vui, lúc thất bại khi thành công. Câu tục ngữ muốn nói đến số phận của mỗi chúng ta giống như con sông vậy, có chỗ thẳng, có chỗ gấp khúc. Đời người có lúc vui, có lúc buồn mà ai cũng phải chấp nhận."
  },
  {
    "id": "264",
    "text": "Sông sâu còn có kẻ dò, Lòng người nham hiểm ai đo cho cùng",
    "meaning": "Câu ca dao nêu ra bài học lòng người khó đoán, không ai có thể hiểu được người khác nghĩ gì, toan tính gì. Từ đó, khuyên nhủ con người cần thận trọng trong các mối quan hệ."
  },
  {
    "id": "265",
    "text": "Sảy cha còn chú, Sảy mẹ bú dì",
    "meaning": "Câu tục ngữ ca ngợi công lao to lớn của chú và dì - những người thân trong gia đình chúng ta. Nếu mất cha, ta sẽ được chú nuôi lớn. Nếu mất mẹ, ta sẽ được dì cho bú mớm, chăm sóc."
  },
  {
    "id": "266",
    "text": "Sĩ, nông, công, thương Nhất sĩ nhì nông",
    "meaning": "Bài ca dao nhấn mạnh vai trò của nghề nông, theo sự sắp hàng ngày trước, người theo nghề nghiên bút đứng trước người làm ruộng, nhưng khi đói kém thì người làm ruộng được đứng trên, vật gì cũng chẳng hơn đồng tiền bát gạo."
  },
  {
    "id": "267",
    "text": "Sấm kêu, rêu mọc",
    "meaning": "Câu tục ngữ là kinh nghiệm về quy luật phát triển của thiên nhiên và thời tiết. Sấm thường xuất hiện khi trời chuẩn bị có mưa, trời mưa khiến đất ẩm ướt, tạo điều kiện cho rêu phát triển."
  },
  {
    "id": "268",
    "text": "Sấm trước, trước mưa",
    "meaning": "Câu tục ngữ là kinh nghiệm về thời tiết của nhân dân ta. Trước những cơn mưa thường có mây đen và sấm đì đùng, báo hiệu cho người nông dân biết sắp có cơn mưa cần phải thu dọn thóc lúa."
  },
  {
    "id": "269",
    "text": "Sống chớ khom lưng, uốn gối, dập đầu",
    "meaning": "Nghĩa đen: Câu tục ngữ khuyên con người khi sống cần giữ cho mình một tư thế hiên ngang, ngay thẳng, không nên khom lưng, uốn gối, dập đầu trước bất kỳ ai hay bất kỳ hoàn cảnh nào. Nghĩa bóng: Câu tục ngữ đề cao phẩm giá và ý chí tự chủ của con người. Con người cần sống một cách mạnh mẽ, kiên cường, không nên khuất phục trước khó khăn, thử thách hay trước những kẻ độc ác, áp bức. Đồng thời, cũng khuyên con người cần sống trung thực, ngay thẳng, không nên nịnh hót, xu nịnh, hay làm những điều trái với lương tâm, đạo đức để cầu lợi."
  },
  {
    "id": "270",
    "text": "Sông sâu nước chảy đá mòn, Của kia ăn hết, nghĩa còn ghi xương",
    "meaning": "Câu ca dao ngợi ca sự chung thuỷ trong mối tương giao nhân nghĩa của đạo vợ chồng, dù trải qua bao gian truân thử thách vẫn thủy chung."
  },
  {
    "id": "271",
    "text": "Sa chân bước xuống ruộng dưa, Dẫu ngay có chết cũng ngờ rằng gian.",
    "meaning": "Câu ca dao nói đến việc chúng ta không làm việc xấu, nhưng lại bị rơi vào hoàn cảnh bị mọi người hiểu nhầm. Qua đó, tác giả dân gian ngầm phê phán những người chưa kịp suy xét đã vội vàng kết tội cho người khác."
  },
  {
    "id": "272",
    "text": "Sông Thao nước đỏ như son, Người đi có nhớ nước non quê mình?",
    "meaning": "Câu ca dao ca ngơi vẻ đẹp của sông Thao, đồng thời nhắc nhở mọi người dù có đi xa đến đâu đi chăng nữa cũng không được quên gốc rễ, quê hương và nguồn cội của mình."
  },
  {
    "id": "273",
    "text": "Sông Lô một dải trong ngần, Thảnh thơi ta rũ bụi trần cũng nên.",
    "meaning": "Câu ca dao ca ngợi vẻ đẹp mộng mơ, trữ tình của dòng sông Lô. Vẻ đẹp thơ mộng ấy khiến tâm hồn chúng ta thảnh thơi, nhẹ nhàng, thư thái."
  },
  {
    "id": "274",
    "text": "Sông Thao nước đục người đen, Ai lên phố Ẻn cũng quên đường về.",
    "meaning": "Câu ca dao thể hiện sự hấp dẫn vùng đất Phú Thọ hùng vĩ, nên thơ. Những người khách đặt chân đến đây đều phải say đắm mà quên mất lối về."
  },
  {
    "id": "275",
    "text": "Thịt mỡ dưa hành câu đối đỏ, Cây nêu, tràng pháo, bánh chưng xanh",
    "meaning": "Câu ca dao ngợi ca vẻ đẹp đón tết cổ truyền của người Việt. Từ đó nhắn nhủ tới con người phải gìn giữ và phát huy những giá trị văn hóa truyền thống của dân tộc."
  },
  {
    "id": "276",
    "text": "Tiên học lễ, hậu học văn",
    "meaning": "Câu tục ngữ có nghĩa là: trước hết phải rèn luyện đạo đức, tu dưỡng nhân cách của bản thân; sau đó mới học đến những kiến thức văn hóa, nâng cao vốn hiểu biết."
  },
  {
    "id": "277",
    "text": "Tấc đất tấc vàng",
    "meaning": "Câu tục ngữ khẳng định tầm quan trọng của đất đai đối với cuộc sống của con người. Đất được so sánh với vàng - một thứ kim loại quý, có giá trị kinh tế cao nhằm nhắc nhở chúng ta rằng đất là tài nguyên vô cùng quý giá. Nhờ có đất đai mà con người có nơi sinh sống và làm việc. Cuộc sống của con người diễn ra trên mặt đất. Chính bởi giá trị ấy mà chúng ta cần phải biết trân trọng từng tấc đất, từng thửa ruộng. Hiểu theo nghĩa hẹp, câu tục ngữ muốn nhắc nhở chúng ta cần phải quý trọng đất đai phục vụ cho cuộc sống sinh hoạt, lao động sản xuất Theo nghĩa rộng hơn, đầy còn là lời nhắc nhở chúng ta cần phải giữ gìn và bảo vệ lãnh thổ của quốc gia, dân tộc bởi để tạo dựng được những \"tấc đất\" ngày nay, đã có biết bao thế hệ ông cha đã hi sinh mồ hôi, công sức và cả xương máu của mình."
  },
  {
    "id": "278",
    "text": "Tháng Bảy heo may chuồn chuồn bay thì bão",
    "meaning": "Câu tục ngữ là kinh nghiệm về thời tiết của nhân dân ta. Miền Bắc nước ta có bão từ tháng 6 đến tháng 8, và bão mạnh dần lên, tháng bảy ta (tháng 7 âm lịch) trùng với tháng 8 (hay trong khoảng thời gian này) tháng 7 (âm lịch) có gió heo may (gió se se lạnh) nghĩa là có độ ẩm cao kết hợp với hiện tượng chuồn chuồn bay hàng đàn ra khỏi tổ thì theo kinh nghiệm dân gian chắc tới 90% là có bão."
  },
  {
    "id": "279",
    "text": "Trăng quầng thì hạn, trăng tán thì mưa",
    "meaning": "Theo kinh nghiệm của cha ông ta, khi trăng quầng, thời tiết sẽ oi bức, nóng nực hoặc rất ít mây. Ngược lại khi trăng có vùng sáng nhiều màu bao quanh và không tách ra khỏi mặt trăng thì thời tiết dễ có mưa. Như vậy, câu tục ngữ đã căn cứ vào một trong những hiện tượng dễ quan sát bằng mắt thường của mặt trăng để cung cấp thông tin về thời tiết."
  },
  {
    "id": "280",
    "text": "Thương người như thể thương thân.",
    "meaning": "Câu tục ngữ nhắc nhỡ mỗi chúng ta cần phải biết yêu thương, quan tâm đến người khác như yêu thương bản thân mình. Có như vậy, chúng ta mới nhận được sự yêu quý, trân trọng từ mọi người."
  },
  {
    "id": "281",
    "text": "Trong đầm gì đẹp bằng sen Lá xanh bông trắng lại chen nhị vàng",
    "meaning": "Bài ca dao đã mượn hình ảnh bông hoa sẽ để ngợi ca những người vẫn giữ được cốt cách, phẩm chất tốt đẹp của mình ngay cả khi phải tiếp xúc với cái xấu, cái dơ bẩn."
  },
  {
    "id": "282",
    "text": "Tay làm hàm nhai, tay quai miệng trễ",
    "meaning": "\"Tay làm hàm nhai\" chỉ những người chăm chỉ làm việc, lao động thì sẽ có cái để ăn, được ấm no, đầy đủ. \"Tay quai\" là tay không làm việc, chỉ những người biếng nhác. Tay quai miệng trễ tức những người lười biếng, không chịu làm việc thì sẽ chẳng có cái để ăn, sẽ đói khát, thiếu thốn. Không dưng ai dễ đem phần tới cho."
  },
  {
    "id": "283",
    "text": "Tre già măng mọc",
    "meaning": "Nghĩa đen: Khi cây tre bắt đầu già đi thì đồng thời, măng của cây tre cũng bắt đầu phát triển mạnh mẽ. Nghĩa bóng: Câu tục ngữ nói về sự tiếp nối giữa các thế hệ. Khi lớp người trước già đi, sẽ luôn có lớp người trẻ hơn kế tục, phát triển những thành quả mà người đi trước để lại."
  },
  {
    "id": "284",
    "text": "Thánh nhân đãi kẻ khù khờ",
    "meaning": "Con người thường ca ngợi những kẻ khôn ngoan mà chê bai người khù khờ. Song, người kém tinh ranh lại là người rất lương thiện và không bao giờ đi tranh giành với người khác. Vì vậy, những người biết tu tâm đôi khi lại may mắn đạt được kết quả ngoài khả năng. Còn những người luôn cố gắng tranh giành mọi thứ về mình, khôn ranh, tính toán thì chắc chắn kết quả sẽ nhanh chóng vụt mất khỏi tầm tay."
  },
  {
    "id": "285",
    "text": "Thân em như hạt mưa rào, Hạt rơi xuống giếng, hạt vào vườn hoa",
    "meaning": "Khái quát: Bài ca dao là một lời than thân, trách phận của người phụ nữ trong xã hội phong kiến. Họ không được tự do lựa chọn hôn nhân, cuộc sống của họ phụ thuộc vào sự sắp đặt của gia đình và xã hội. Bài ca dao thể hiện số phận bấp bênh, không được tự do, tự chủ, bị lệ thuộc của họ. Chi tiết: Câu 1 và 2: Hình ảnh “mưa rào” tượng trưng cho cuộc đời ngắn ngủi, bấp bênh của người phụ nữ. “Hạt rơi xuống giếng” thể hiện số phận hẩm hiu, đắng cay, “hạt vào vườn hoa” thể hiện số phận may mắn, hạnh phúc. Tuy nhiên, cả hai đều do yếu tố may rủi chi phối, phụ nữ không có khả năng tự quyết định số phận của mình. Câu 3 và 4: Hình ảnh “mưa sa” tiếp tục nhấn mạnh sự bấp bênh, không tự chủ của số phận người phụ nữ. “Hạt vào đài các” thể hiện phụ nữ may mắn được gả vào nhà quyền quý, “hạt ra ruộng cày” thể hiện phụ nữ phải chịu cảnh lam lũ, vất vả. Lại một lần nữa, số phận của họ phụ thuộc vào sự may rủi, không do họ lựa chọn."
  },
  {
    "id": "286",
    "text": "Trăm năm bia đá cũng mòn Ngàn năm bia miệng hãy còn trơ trơ",
    "meaning": "Câu ca dao khuyên con người phải biết cư xử đúng đắn, sống đẹp, sống tốt với mọi người. Như vậy thì dù bia đá khắc tên có mòn nhưng danh tiếng của mình vẫn được người đời nhớ đến."
  },
  {
    "id": "287",
    "text": "Thuyền về có nhớ bến chăng? Bến thì một dạ khăng khăng đợi thuyền.",
    "meaning": "Câu ca dao đã mượn hình ảnh thuyền và bến để thể hiện tấm lòng thủy chung, nỗi nhớ da diết của cô gái với người yêu của mình. Bên cạnh sự nhớ nhung, cô gái còn thể hiện nỗi niềm lo lắng, băn khoăn, không biết chàng trai đi xa có nhớ tới mình không."
  },
  {
    "id": "288",
    "text": "Tốt gỗ hơn tốt nước sơn",
    "meaning": "Câu tục ngữ mang hai nghĩa: Nghĩa đen: Khi đánh giá vật dụng làm bằng gỗ, người ta quan tâm đến ruột gỗ, thớ gỗ bên trong hơn là màu sắc, nước sơn bên ngoài. Nghĩa bóng: Đánh giá một con người, nên quan tâm đến phẩm chất hơn ngoại hình của họ."
  },
  {
    "id": "289",
    "text": "Uống nước nhớ nguồn",
    "meaning": "“Uống nước nhớ nguồn” được hiểu là khi hưởng dòng nước mát thì hãy nhớ tới nơi khởi đầu đã cho ta dòng nước đó. \"Uống nước\" là thừa hưởng thành quả lao động của những người đi trước, thừa hưởng những gì mà họ đã bỏ công sức để tạo ra, để có được. Vì vậy ta phải biết ơn, biết nhớ tới công lao của họ."
  },
  {
    "id": "290",
    "text": "Vầng trăng ai xẻ làm đôi Đường trần ai vẽ ngược xuôi hỡi chàng.",
    "meaning": "Vầng trăng: Biểu tượng cho tình yêu, sự đoàn viên, viên mãn. Ai xẻ làm đôi: Hình ảnh ẩn dụ cho sự chia ly, tan vỡ trong tình yêu. Đường trần: Biểu tượng cho cuộc sống đầy rẫy những khó khăn, thử thách. Ai vẽ ngược xuôi: Hình ảnh ẩn dụ cho con đường tình đầy khúc khuỷu, gian nan. Hỡi chàng: Lời gọi tha thiết, trìu mến của người con gái dành cho người mình yêu. Khái quát: Câu ca dao thể hiện nỗi buồn thương, tiếc nuối của người con gái khi tình yêu tan vỡ. Hình ảnh vầng trăng bị xẻ làm đôi tượng trưng cho sự chia ly, tan vỡ, để lại cho con người một nỗi đau khó nguôi"
  },
  {
    "id": "291",
    "text": "Ví dầu cầu ván đóng đinh, Cầu tre lắc lẻo gập ghềnh khó đi.",
    "meaning": "Bài ca dao thể hiện sự tôn vinh vai trò và tình cảm của mẹ trong việc hướng dẫn và định hướng con cái trong cuộc sống. Nó nhấn mạnh sự khó khăn và gian khổ trong cuộc sống trên mọi nẻo đường. Từ đó khuyên người con phải biết nghe lời mẹ, phải biết học hỏi và trải nghiệm cuộc sống."
  },
  {
    "id": "292",
    "text": "Vàng mây thì gió, đỏ mây thì mưa.",
    "meaning": "Câu tục ngữ nói về cách dự báo thời tiết theo quan niệm của người xưa: thấy mây phản chiếu ánh sáng màu vàng là trời sắp chuyển gió to; mây trên trời màu đỏ thì trời sắp có mưa lớn."
  },
  {
    "id": "293",
    "text": "Vắng chủ nhà, gà vọc niêu tôm.",
    "meaning": "Nghĩa đen: Khi chủ vắng nhà, không có ai trông nhà nên gà tha hồ vọc niêu tôm. Nghĩa bóng: Khi không có ai cai quản, một số người vô ý thức sẽ tự do thoải mái, tha hồ làm bậy, khiến mọi chuyện trở nên lộn xộn, rắc rối hơn."
  },
  {
    "id": "294",
    "text": "Việc nhà thì nhác, việc chú bác thì siêng.",
    "meaning": "Câu tục ngữ phê phán những kẻ sĩ diện, bao đồng, chỉ lo việc của người khác mà lười biếng, bỏ bê, vô trách nhiệm với việc bản thân cần phải làm."
  },
  {
    "id": "295",
    "text": "Vua, thầy, cha, ấy ba ngôi  Kính thờ như một, trẻ ơi ghi lòng",
    "meaning": "Vua là người đứng đầu đất nước, là người lãnh đạo, điều hành đất nước, bảo vệ sự bình yên cho muôn dân. Vua là người có công lao to lớn đối với sự phát triển của đất nước. Thầy là người truyền đạt kiến thức, rèn luyện đạo đức cho học trò, giúp học trò trưởng thành về trí tuệ và tâm hồn. Thầy là người có công lao to lớn đối với sự nghiệp giáo dục của đất nước. Cha là người sinh ra ta, nuôi dưỡng ta từ thuở ấu thơ, cho ta cuộc sống, tình yêu thương vô bờ bến. Cha là chỗ dựa vững chắc, là nguồn động lực to lớn giúp ta vượt qua mọi khó khăn trong cuộc sống. Câu ca dao là lời nhắc nhở mỗi người về lòng biết ơn và sự kính trọng đối với vua, thầy và cha"
  },
  {
    "id": "296",
    "text": "Vợ chồng như đũa có đôi.",
    "meaning": "Câu tục ngữ ca ngợi vợ chồng hòa thuận. Vợ chồng là phải sống chung hòa, gắn kết, như đũa thì phải có đôi."
  },
  {
    "id": "297",
    "text": "Vai mang túi bạc kè kè Nói quấy nói quá người nghe ầm ầm",
    "meaning": "Bài ca dao nêu lên một thực trạng: những người có tiền thường có quyền lực, uy thế hơn người khác. Khi có tiền, ta nói điều gì thì mọi người xung quanh cũng chú ý lắng nghe; còn khi không có tiền, dù ta nói điều hay, lẽ phải thì cũng không có ai lắng nghe cả."
  },
  {
    "id": "298",
    "text": "Vô công bất hưởng lợi",
    "meaning": "Câu tục ngữ này khẳng định rằng muốn hưởng thụ thành quả, lợi ích thì trước hết phải có công lao, đóng góp tương xứng. Không ai có thể được hưởng thụ mà không lao động, không nỗ lực. Theo nghĩa rộng hơn, câu tục ngữ thể hiện liêm sỉ, đạo đức của người xưa, không có công cán, không có lí do gì để nhận thưởng, ở đời nếu tham lam sẽ rước lấy họa vào thân."
  },
  {
    "id": "299",
    "text": "Vồng chiều mưa sáng, ráng chiều mưa hôm",
    "meaning": "Câu tục ngữ là kinh nghiệm dự đoán thời tiết. Cầu vồng hiện vào buồi chiều thì buổi sáng hôm sau sẽ có mưa; buổi chiều có ráng trắng hoặc đỏ hồng thì trưa hôm sau trời sẽ mưa."
  },
  {
    "id": "300",
    "text": "Vồng rạp mưa rào, vồng cao gió táp",
    "meaning": "Câu tục ngữ là kinh nghiệm của nhân dân ta về thời tiết, khi chuẩn bị có mưa giông. Phía chân trời có cầu vồng ở dưới thấp thì sắp có mưa rào, còn cầu vồng ở trên cao thì sắp có bão lớn."
  },
  {
    "id": "301",
    "text": "Vợ có chồng như rồng có mây, Chồng có vợ như cây có rừng",
    "meaning": "Câu ca dao ca ngợi sự gắn bó, hòa hợp giữa vợ chồng. Rồng và mây, cây và rừng là những sự vật không thể tách khỏi nhau, cũng như vợ chồng thì phải gắn kết với nhau, cùng nhau vượt qua sóng gió."
  },
  {
    "id": "302",
    "text": "Vẳng nghe chim vịt kêu chiều, Bâng khuâng nhớ mẹ chín chiều ruột đau.",
    "meaning": "Bài ca dao thể hiện sự nhớ nhung của người con gái tới mẹ. Nó diễn tả cảm xúc đau đớn và nhớ thương khi nghe tiếng chim vịt, tạo nên hình ảnh một trạng thái tâm trạng buồn bã. Từ đó nhắc nhở phải quan tâm và nhớ thương sâu sắc của một người con dành cho mẹ."
  },
  {
    "id": "303",
    "text": "Văn hay chẳng lọ dài dòng",
    "meaning": "Câu tục ngữ khẳng định rằng cái hay của bài văn là ở tính hàm súc, ý nghĩa chứ không nhất thiết phải dài dòng. Nếu dài dòng mà diễn đạt lủng củng, rườm rà thì đó cũng chẳng phải là một bài văn hay."
  },
  {
    "id": "304",
    "text": "Xấu người đẹp nết còn hơn đẹp người",
    "meaning": "Câu tục ngữ là đúc kết kinh nghiệm của nhân dân ta khi nhìn nhận con người: hãy coi trọng cái giá trị đích thực, cái nội dung bên trong của một con người. Đừng bao giờ để cái hình thức xa hoa, hào nhoáng bên ngoài lừa dối, quyến rũ. Dẫu bề ngoài xấu xí, khiếm khuyết nhưng bản chất bên trong tốt đẹp, sâu sắc vẫn hơn là bề ngoài đẹp đẽ mà nội tâm rỗng tuếch chẳng có gì."
  },
  {
    "id": "305",
    "text": "Xe không có thắng, chạy thẳng vào hòm",
    "meaning": "Câu tục ngữ khuyên con người khi tham gia giao thông cần phải biết kiểm soát tốc độ, tránh gặp phải những tai họa, rủi ro, thậm chí là cái chết"
  },
  {
    "id": "306",
    "text": "Yêu cho roi cho vọt, ghét cho ngọt cho bùi",
    "meaning": "Những kẻ nói lời mật ngọt chưa chắc đã thật lòng với bạn cũng như những người luôn nói lời khó nghe, chê trách bạn chưa chắc đã muốn dìm hàng bạn. Khi bạn ngẫm kĩ lại sẽ hiểu, có những người chỉ muốn bạn tốt lên hàng ngày. Người thương bạn sẽ hay dùng những lời răn đe, dùng roi để dạy bạn, còn người ghét bạn thì lại dùng những lời mật ngọt dành cho bạn. Câu tục ngữ này muốn khuyên chúng ta những lời mật ngọt chưa chắc đã là tốt, còn người luôn tỏ ra hộc hằn với bạn chưa hẳn đã là xấu."
  },
  {
    "id": "307",
    "text": "Yêu vì nết, chẳng chết vì người.",
    "meaning": "Câu tục ngữ đề cao vẻ đẹp phẩm chất, tính cách của con người. Chính những tính nết, phẩm chất bên trong ấy mới là nhân tố quyết định giá trị của một con người, chứ không phải là vẻ đẹp bên ngoài."
  },
  {
    "id": "308",
    "text": "Yêu nhau ba núi cũng trèo Bốn sông cũng lội, năm đèo cũng qua.",
    "meaning": "Câu ca dao ca ngợi tình yêu đôi lứa và khẳng định tình yêu có thể vượt qua mọi những khó khăn, gian khổ."
  },
  {
    "id": "309",
    "text": "Yêu trẻ, trẻ đến nhà.",
    "meaning": "Câu tục ngữ khuyên mọi người nên yêu quý, thương yêu trẻ nhỏ. Khi ta yêu trẻ, trẻ sẽ cảm mến và thường xuyên đến nhà chúng ta để chơi."
  },
  {
    "id": "310",
    "text": "Yêu nhau ba bốn núi cũng trèo Bốn sông cũng lội, năm đèo cũng qua",
    "meaning": "Câu ca dao khẳng định tình yêu có thể vượt qua mọi những khó khăn, gian khổ."
  },
  {
    "id": "311",
    "text": "Yêu nên tốt, ghét nên xấu.",
    "meaning": "Nghĩa đen: Vì yêu thích nên dù người kia có xấu thì ta vẫn thấy tốt; ngược lại, đã ghét người kia thì dù họ có tốt thì ta vẫn thấy họ xấu. Nghĩa bóng: Câu tục ngữ khuyên chúng ta cần có cái nhìn khách quan khi đánh giá người khác, tránh để sự yêu ghét làm ta mất sự đúng đắn, công bằng."
  },
  {
    "id": "312",
    "text": "Yêu nhau mọi sự chẳng nề, Một trăm chỗ lệch cũng kê cho bằng.",
    "meaning": "Câu ca dao nói tới sự cố gắng, nỗ lực của vợ chồng, trai gái trong hôn nhân, tình yêu. Khi yêu nhau, hai người sẽ có những đặc điểm trái ngược, khác biệt. Tuy nhiên, nếu ta biết cố gắng bù trừ cho những thiếu xót của đối phương, không nề hà sự khó khăn, thì tình yêu sẽ luôn vững bền."
  },
  {
    "id": "313",
    "text": "Yêu nhau xé lụa may quần Ghét nhau kể nợ kể nần nhau ra.",
    "meaning": "Câu ca dao phê phán người dễ yêu, nhưng cũng dễ hận thù sau khi hết yêu. Khi yêu nhau đắm đuối, họ sẵn sàng làm tất cả cho người yêu. Lúc đã hết yêu, họ sinh ra sự ghen ghét nhau, kể hết mọi tật xấu của nhau với người khác. Qua đó, tác giả dân gian nhắc nhở mỗi chúng ta cần biết nhường nhịn, không nên tính chuyện thiệt hơn trong tình yêu, hôn nhân."
  },
  {
    "id": "314",
    "text": "Yêu cho vọt, ghét cho chơi",
    "meaning": "Câu tục ngữ thể hiện quan niệm dạy dỗ con của nhân dân ta từ xưa. Thương con nên dùng roi vọt để răn dạy điều hay lẽ phải. Còn trái lại, nếu không thương thì sẽ cho “chơi”, nói những lời ngon ngọt, dễ nghe. Từ đó, câu này khuyên con người phải biết đề phòng với những lời nói ngọt ngào vì sự thật đằng sau lời nói dễ nghe đó chưa chắc đã tốt, còn người nói khó nghe cũng chưa hẳn xấu."
  },
  {
    "id": "315",
    "text": "Yêu nhau gánh gạch về xây, Chẳng đắp nên núi cũng quây nên thành.",
    "meaning": "Câu ca dao đề cao tình nghĩa vợ chồng son sắt, thủy chung. Chỉ cần vợ chồng đồng lòng, đồng cam cộng khổ thì dù có khăn khăn, vất vả, nguy hiểm đến đâu, cả hai người cũng vượt qua được."
  },
  {
    "id": "316",
    "text": "Yên Mạc có món nem chua, Thơm ngon nổi tiếng đến vua cũng thèm",
    "meaning": "Câu ca dao ca ngợi nét đẹp ẩm thực - đặc sản nem chua của mảnh đất Ninh Bình. Qua đó, tác giả dân gian thể hiện niềm tự hào với quê hương mình."
  },
  {
    "id": "317",
    "text": "Ăn cháo đá bát.",
    "meaning": "Thành ngữ dùng để chỉ những người bội bạc, quên đi công ơn của người đã giúp đỡ mình lúc khó khăn ngay khi họ vừa đạt được mục đích hoặc trở nên sung túc."
  },
  {
    "id": "318",
    "text": "Ăn như rồng cuốn, uống như rồng leo, làm như mèo mửa",
    "meaning": "Thành ngữ chỉ những người tham ăn tục uống, ăn đâu hết đến đấy, nhưng lại rất lười biếng, làm việc ít, làm không đến nơi đến chốn."
  },
  {
    "id": "319",
    "text": "Ăn xổi ở thì",
    "meaning": "Thành ngữ chê bai những kẻ hời hợt, thiếu sự tính toán, suy nghĩ, chỉ nghĩ về cái lợi trước mắt mà không suy nghĩ đến lợi ích lâu dài, bền vững."
  },
  {
    "id": "320",
    "text": "Ác giả ác báo",
    "meaning": "Thành ngữ ý nói về việc người làm việc xấu, điều ác chắc chắn sẽ phải chịu sự trừng phạt thích đáng. Câu thành ngữ \"ác giả ác báo\" có vai trò quan trọng trong việc giáo dục đạo đức cho con người. Nó giúp con người hiểu rằng, mỗi hành động của mình đều có hậu quả tương ứng. Từ đó, khuyên răn con người đừng nên làm những điều xấu để không phải chịu những hậu quả do chính mình gây ra."
  },
  {
    "id": "321",
    "text": "Án binh bất động",
    "meaning": "Thành ngữ thể hiện ý thức cẩn thận, kiên nhẫn và hành động có chiến lược để quan sát, tránh rủi ro trong một tình huống nhất định."
  },
  {
    "id": "322",
    "text": "Ăn miếng trả miếng",
    "meaning": "Thành ngữ nói về việc hành động đáp trả, trả đũa một cách thẳng thắn, không nhượng bộ. Khi ai đó có hành động tốt hoặc xấu với bạn, bạn sẽ có hành động đáp trả tương tự như thế."
  },
  {
    "id": "323",
    "text": "Ao sâu cá cả",
    "meaning": "Thành ngữ khẳng định tầm quan trọng của môi trường sống. Môi trường xung quanh chúng ta có điều kiện thuận lợi cho sự phát triển thì bản thân ta mới có thể tiến bộ mỗi ngày."
  },
  {
    "id": "324",
    "text": "Ăn một bát cháo, chạy ba quãng đường",
    "meaning": "Thành ngữ nói về việc chúng ta phải bỏ ra quá nhiều công sức để làm việc, nhưng kết quả thu được lại chẳng đáng là bao, không bõ công sức làm. Qua đó, ông cha nhắc nhắc nhở chúng ta rằng không nên vì cái lợi bé ngay trước mắt mà làm những việc tốn sức, tốn thời gian."
  },
  {
    "id": "325",
    "text": "Ăn bữa nay lo bữa mai",
    "meaning": "Thành ngữ chỉ cuộc sống nghèo khó, thiếu thốn lương thực, chạy ăn từng bữa."
  },
  {
    "id": "326",
    "text": "Ăn không nên đọi, nói không nên lời",
    "meaning": "Câu thành ngữ Ăn không nên đọi, nói không nên lời dùng để chê bai những người vụng về, thiếu tế nhị, không khéo léo trong ứng xử, hành động và lời ăn tiếng nói, làm cho người khác khó hiểu hoặc cảm thấy khó chịu"
  },
  {
    "id": "327",
    "text": "An cư lạc nghiệp",
    "meaning": "Thành ngữ nói về sự ổn định về nơi sống và nơi làm việc. Cuộc sống của chúng ta có sự ổn định về hai nơi đó thì ta mới có thể phát triển sự nghiệp nhanh chóng, dễ dàng."
  },
  {
    "id": "328",
    "text": "Ăn trên ngồi trốc",
    "meaning": "Thành ngữ chỉ những người có chức có quyền, ở địa vị cao, thống trị, áp bức người có địa vị thấp hơn."
  },
  {
    "id": "329",
    "text": "Ăn không ngồi rồi",
    "meaning": "Thành ngữ phê phán những người lười biếng, ỷ lại vào người khác, không muốn làm gì, cả ngày chỉ biết ngồi chơi."
  },
  {
    "id": "330",
    "text": "Ăn chắc mặc bền",
    "meaning": "Thành ngữ chỉ những người cẩn thận, tiết kiệm, không chạy theo những thứ xa hoa, tuy chậm hơn so với người khác nhưng luôn chắc chắn."
  },
  {
    "id": "331",
    "text": "Ăn no rửng mỡ",
    "meaning": "Thành ngữ chỉ những người từ nghèo khó đến giàu có, để rồi đến khi có đời sống đầy đủ thì lại sinh ra thói hư tật xấu."
  },
  {
    "id": "332",
    "text": "Ăn gian nói dối.",
    "meaning": "Thành ngữ châm biếm những người luôn nói dối, không ngay thẳng, thật thà. Những người có tính xấu này thường không có được lòng tin cậy và sự yêu mến của mọi người."
  },
  {
    "id": "333",
    "text": "Ăn ốc nói mò",
    "meaning": "Thành ngữ chỉ việc nói về một vấn đề mà không hiểu rõ, không đủ thông tin nhưng lại nhận xét, đánh giá tuỳ tiện, gây ra hiểu lầm và ảnh hưởng uy tín của người khác và chính bản thân mình."
  },
  {
    "id": "334",
    "text": "Áo gấm về làng",
    "meaning": "Thành ngữ chỉ người đi học hoặc đi làm xa, thành công đạt được địa vị hay sự giàu có để rồi trở về quê hương trong niềm kiêu hãnh và tự hào."
  },
  {
    "id": "335",
    "text": "Ăn ngay nói thật",
    "meaning": "Thành ngữ nghĩa là trung thực, thẳng thắn, thật thà, không lươn lẹo, giả dối."
  },
  {
    "id": "336",
    "text": "An phận thủ thường",
    "meaning": "Thành ngữ chỉ việc giữ đúng phận mình, không làm điều gì quá giới hạn, không đòi hỏi gì hơn."
  },
  {
    "id": "337",
    "text": "Áo gấm đi đêm",
    "meaning": "Thành ngữ phê phán những hành động không đúng lúc, đúng chỗ, không hợp lý, gây ra sự lãng phí. Ngoài ra, thành ngữ còn chỉ những hành động sang trọng nhưng rất đáng nghi ngờ, khuất tất, thường là hành động xấu."
  },
  {
    "id": "338",
    "text": "Âm dương cách biệt",
    "meaning": "Thành ngữ nói về sự chia lìa, rời xa, không bao giờ có thể gặp lại nhau giữa người sống và người chết."
  },
  {
    "id": "339",
    "text": "Ăn bánh trả tiền",
    "meaning": "Thành ngữ chỉ sự sòng phẳng, đặc biệt trong mua bán, khi giao dịch cần phải sòng phẳng tránh mất lòng nhau, có như vậy mới giữ được quan hệ bền lâu."
  },
  {
    "id": "340",
    "text": "Ân đoạn nghĩa tuyệt",
    "meaning": "Thành ngữ ám chỉ việc cắt đứt mối quan hệ, không còn liên lạc với một người nào đó (thường nói về tình yêu, hôn nhân)."
  },
  {
    "id": "341",
    "text": "Ăn cơm hớt",
    "meaning": "Thành ngữ nói về những người nhanh nhảu, lanh chanh, hay tranh lời hay giành phần của người khác mặc dù chưa đến lượt hoặc không có phần của mình."
  },
  {
    "id": "342",
    "text": "An bần lạc đạo",
    "meaning": "Thành ngữ chỉ việc yên lòng với cảnh nghèo và vui vẻ làm những điều mà con người có bổn phận giữ và tuân theo."
  },
  {
    "id": "343",
    "text": "Ăn như mỏ khoét",
    "meaning": "Thành ngữ thể hiện sự chê bai khi ăn quá nhiều và luôn miệng, ăn bao nhiêu cũng không vừa."
  },
  {
    "id": "344",
    "text": "Ăn no ngủ kĩ",
    "meaning": "Thành ngữ chỉ cuộc sống ấm no, đầy đủ vật chất, an nhàn trong cuộc sống."
  },
  {
    "id": "345",
    "text": "Ăn cá bỏ xương",
    "meaning": "Thành ngữ khuyên chúng ta cần suy nghĩ kĩ trước khi làm việc; làm cẩn thận, tỉ mỉ ngay cả trong những công việc nhỏ nhất. Ngoài ra, thành ngữ còn có một ý nghĩa khác là khuyên con người không nên tham lam, cũng giống như việc ăn cá thì ta không thể tham lam mà ăn cả xương."
  },
  {
    "id": "346",
    "text": "Ăn đằng sóng, nói đằng gió",
    "meaning": "Thành ngữ phê phán những người điêu toa, chuyên đi nói dối, bịa đặt, làm ảnh hưởng tiêu cực đến danh dự người khác."
  },
  {
    "id": "347",
    "text": "Anh hùng rơm",
    "meaning": "Thành ngữ chỉ nhũng người tỏ vẻ mạnh mẽ, có thể giúp đỡ người khác nhưng thực chất lại không có khả năng."
  },
  {
    "id": "348",
    "text": "Ăn bánh vẽ",
    "meaning": "Thành ngữ chỉ việc bị gạt bằng những lời hứa suông, những lời nói hoa mĩ, hứa hẹn nhưng không có thật, không thực hiện được."
  },
  {
    "id": "349",
    "text": "Ăn mày mà đòi xôi gấc",
    "meaning": "Thành ngữ phê phán những người sống không biết thân biết phận, không nhận thức được thực trạng của mình, chỉ luôn đòi hỏi những thứ cao sang, vượt qua cả tầm với của mình."
  },
  {
    "id": "350",
    "text": "Ăn như tằm ăn rỗi",
    "meaning": "Thành ngữ ý nói về những người ăn nhanh, ăn khỏe. Con tằm vào thời điểm gần chín, sau khi nhả tơ và chuyển sang thời kì thành nhộng thường ăn rất khỏe. Chính vì thế, ông cha ta đã lấy hình ảnh con tằm lúc này để ví với người ăn nhiều."
  },
  {
    "id": "351",
    "text": "Ăn sung mặc sướng",
    "meaning": "Thành ngữ nói về người có cuộc sống đầy đủ, sung sướng, giàu sang."
  },
  {
    "id": "352",
    "text": "Anh hùng tạo thời thế",
    "meaning": "Thành ngữ chỉ người có năng lực xuất sắc và uy tín to lớn, có thể ảnh hưởng mạnh mẽ đến xu thế, vận mệnh của một thời đại."
  },
  {
    "id": "353",
    "text": "Ăn đời ở kiếp.",
    "meaning": "Thành ngữ nói về việc sống chung với một người trong cả cuộc đời (thường nói về tình cảm vợ chồng), hoặc có ý nghĩa khác là khẳng định sự định cư cả đời ở một nơi."
  },
  {
    "id": "354",
    "text": "Ăn lông ở lỗ",
    "meaning": "Thành ngữ chỉ việc sống không ngăn nắp, không gọn gàng, , không đúng vị trí, sống không vệ sinh, không văn minh, còn lạc hậu, không đầy đủ tiện nghi."
  },
  {
    "id": "355",
    "text": "Ăn thô nói tục",
    "meaning": "Thành ngữ chỉ những người có lời nói thô tục,xúc phạm đến người khác, không biết chọn lời hay ý đẹp."
  },
  {
    "id": "356",
    "text": "Áo mảnh quần manh",
    "meaning": "Thành ngữ ngụ ý chỉ sự nghèo khó, thiếu thốn về vật chất."
  },
  {
    "id": "357",
    "text": "Ăn mật trả gừng",
    "meaning": "Thành ngữ này ngụ ý chỉ những người sống vô ơn bạc nghĩa, họ chỉ biết lợi dụng lòng tốt của người khác, tính toán thiệt hơn người đã giúp đỡ mình."
  },
  {
    "id": "358",
    "text": "Ăn như vạc",
    "meaning": "Thành ngữ chỉ thói ăn uống không hợp lí, không có giờ giấc khoa học, hay ăn đêm."
  },
  {
    "id": "359",
    "text": "Ăn thùng uống vại",
    "meaning": "Thành ngữ chỉ người ăn uống nhiều, tham lam về đồ ăn và đồ uống, không quan tâm tới người xung quanh."
  },
  {
    "id": "360",
    "text": "Áo đơn đợi hè",
    "meaning": "Thành ngữ nghĩa là mọi điều, mọi thứ đều phải phù hợp với hoàn cảnh, với điều kiện, phải đúng dịp, đúng thời mới có tác dụng thiết thực."
  },
  {
    "id": "361",
    "text": "Ân trả nghĩa đền",
    "meaning": "Thành ngữ nghĩa là đền đáp lại công ơn, nghĩa tình dối với những người đã giúp đỡ, đối xử tốt với mình."
  },
  {
    "id": "362",
    "text": "Ăn chắt để dành",
    "meaning": "Thành ngữ khen những người biết căn cơ, tính toán trong cuộc sống."
  },
  {
    "id": "363",
    "text": "Ăn đơm nói đặt",
    "meaning": "Thành ngữ chỉ cách nói vu khống, đặt điều, bịa chuyện cho người khác."
  },
  {
    "id": "364",
    "text": "Ăn ngon mặc đẹp",
    "meaning": "Thành ngữ nói về một cuộc sống đầy đủ, sung sướng, cao sang, đầy đủ về vật chất, tiền bạc."
  },
  {
    "id": "365",
    "text": "Anh em cột chèo",
    "meaning": "Thành ngữ dùng để chỉ những người đàn ông cùng làm rể trong một gia đình, có nghĩa là vợ của họ là chị em của nhau."
  },
  {
    "id": "366",
    "text": "Ác như hùm",
    "meaning": "Thành ngữ chỉ việc làm độc ác, hoặc người không hiền lành."
  },
  {
    "id": "367",
    "text": "Ăn bậy nói càn",
    "meaning": "Thành ngữ chỉ việc ăn nói thô tục, nói năng bỗ bã, lời nói bậy bạ, vô duyên, không có lí lẽ."
  },
  {
    "id": "368",
    "text": "Ăn bờ ở bụi",
    "meaning": "Thành ngữ chỉ tình trạng lang bạt, không có nhà cửa ổn định, phải sống chui rúc, khổ sở, tạm bợ ở những nơi thiếu thốn."
  },
  {
    "id": "369",
    "text": "Ăn cá bỏ lờ",
    "meaning": "Thành ngữ chỉ sự bội bạc, vô ơn, chỉ biết hưởng thụ mà không nhớ tới người đã mang lại cho mình thành quả cho mình."
  },
  {
    "id": "370",
    "text": "Ăn bốc ăn bải",
    "meaning": "Thành ngữ chỉ cách ăn uống quá tự nhiên, xuề xoà, thiếu lịch sự, không có chừng mực."
  },
  {
    "id": "371",
    "text": "Ăn no lo đặng",
    "meaning": "Thành ngữ chỉ những người khi đầy đủ về vật chất thì lại có nỗi lo khác, những vấn đề xa vời, lo xa."
  },
  {
    "id": "372",
    "text": "Ăn chung ở chạ",
    "meaning": "Thành ngữ chỉ việc sinh sống sinh hoạt với nhiều người không phải ruột thịt, xô bồ, chia sẻ không gian sinh hoạt và ăn chung với nhau."
  },
  {
    "id": "373",
    "text": "Ba chìm bảy nổi",
    "meaning": "Thành ngữ chỉ sự vất vả, gian truân, éo le, trắc trở của thân phận con người, đặc biệt là số phận của người phụ nữ trong xã hội phong kiến."
  },
  {
    "id": "374",
    "text": "Ba chân bốn cẳng",
    "meaning": "Thành ngữ nghĩa là chạy hoặc đi thật nhanh, thật mau lẹ, vội vàng hấp tấp."
  },
  {
    "id": "375",
    "text": "Bụt chùa nhà không thiêng",
    "meaning": "Thành ngữ này có hai nghĩa: Nghĩa 1: khuyên ta nên tự tin ở khả năng của bản thân, như vậy mới dễ nắm bắt công việc để đạt được thành công. Nghĩa 2: thể hiện thái độ không tin tưởng với những người gần gũi, quen biết."
  },
  {
    "id": "376",
    "text": "Bút sa gà chết",
    "meaning": "Thành ngữ đề cao sự cẩn trọng trong mọi quyết đinh, đặc biệt là quyết định mang tính ràng buộc cao, có ký kết giấy tờ để tránh những hậu quả không mong muốn."
  },
  {
    "id": "377",
    "text": "Bóng câu qua cửa sổ",
    "meaning": "Thành ngữ nghĩa là thời gian vụt trôi, thoáng cái đã qua một quảng thời gian, một đoạn đời."
  },
  {
    "id": "378",
    "text": "Bách niên giai lão",
    "meaning": "Thành ngữ như một lời chúc thọ cho nhau, chúc nhau sống lâu và hưởng hạnh phúc."
  },
  {
    "id": "379",
    "text": "Bồng lai tiên cảnh",
    "meaning": "Thành ngữ chỉ những nơi rất đẹp, thơ mộng, chứa đầy hạnh phúc, được ví như nơi ở của tiên."
  },
  {
    "id": "380",
    "text": "Ba mặt một lời",
    "meaning": "Thành ngữ chỉ cách nói trực tiếp, công khai trước mặt các bên liên quan đến làm rõ, sáng tỏ mọi việc."
  },
  {
    "id": "381",
    "text": "Bắt cá hai tay",
    "meaning": "Thành ngữ khuyên con người ta không nên quá tham lam trong công việc. Trong một lúc mà làm nhiều việc thì khó tránh khỏi được thất bại."
  },
  {
    "id": "382",
    "text": "Ba đầu sáu tay",
    "meaning": "Thành ngữ chỉ sức lực, tài năng của một người; ngoài ra thành ngữ còn dùng để khuyên con người ta không nên làm việc quá khả năng của mình để giữ gìn sức khoẻ."
  },
  {
    "id": "383",
    "text": "Bách chiến bách thắng",
    "meaning": "Thành ngữ nói về những người luôn luôn chiến thắng, thành công vang dội. Ngoài ra, thành ngữ còn chỉ việc đánh trận ở đâu thì thắng ở đó, không có đối thủ xứng tầm."
  },
  {
    "id": "384",
    "text": "Bài binh bố trận",
    "meaning": "Nghĩa đen: Trong quân sự, đây là việc dàn quân, sắp đặt các cánh quân (tiền quân, hậu quân, trung quân...) và vũ khí theo những chiến thuật nhất định (như Bát quái trận, Trường xà trận...) để chuẩn bị giao chiến với kẻ thù. Nghĩa bóng: (thường dùng hiện nay) Chỉ việc chuẩn bị chu đáo, có tính toán, có kế hoạch rõ ràng trước khi bắt tay vào một công việc khó khăn hoặc một cuộc cạnh tranh hoặc dùng để chỉ việc tạo ra một vẻ ngoài hoành tráng, nghiêm túc để gây áp lực hoặc làm đối phương e sợ"
  },
  {
    "id": "385",
    "text": "Chắc như đinh đóng cột",
    "meaning": "Thành ngữ ám chỉ sự chắc chắn, mang tính khẳng định tuyệt đối những điều vừa được nói ra, tin rằng điều đó không thể sai, ví như sự chắc chắn của đinh khi đã được đóng vào cột."
  },
  {
    "id": "386",
    "text": "Con rồng cháu tiên",
    "meaning": "Thành ngữ thể hiện nguồn gốc cao quý, thiêng của của con người Việt Nam. Đây là sự tự hào về cội nguồn, dân tộc của tất cả mọi người trên khắp mọi miền nước ta."
  },
  {
    "id": "387",
    "text": "Cẩn tắc vô ưu, vô áy náy",
    "meaning": "Thành ngữ khuyên chúng ta nên cẩn thận trong mọi việc. Cẩn thận sẽ giúp ta về sau không phải lo lắng tai họa, giải quyết các hậu quả; đồng thời khiến công việc của ta thêm suôn sẻ."
  },
  {
    "id": "388",
    "text": "Cạn tàu ráo máng",
    "meaning": "Thành ngữ lên án những con người không còn chút tình nghĩa nào với người khác, đối xử với nhau một cách tàn nhẫn."
  },
  {
    "id": "389",
    "text": "Chân cứng đá mềm",
    "meaning": "Thành ngữ ca ngợi sự quyết chí, bền bỉ, không ngại đối mặt và vượt qua khó khăn và quyết tâm đạt được mục đích đã đề ra của con người."
  },
  {
    "id": "390",
    "text": "Cõng rắn về cắn gà nhà",
    "meaning": "Thành ngữ tố cáo những kẻ đê hèn, chịu thua trước kẻ thù, phản bội những người yêu thương mình, dẫn đường cho kẻ thù về để hãm hại gia đình, quê hương, đất nước."
  },
  {
    "id": "391",
    "text": "Cá lớn nuốt cá bé",
    "meaning": "Thành ngữ nghĩa là kẻ có thế lực, quyền uy chèn ép, tiêu diệt kẻ yếu kém, thấp hèn."
  },
  {
    "id": "392",
    "text": "Chó cùng rứt giậu",
    "meaning": "Thành ngữ chỉ những người liều lĩnh, làm bậy làm bạ, hành động thiếu suy nghĩ và sự cân nhắc khi bị đẩy đến đường cùng, không còn cách nào khác."
  },
  {
    "id": "393",
    "text": "Cáo chết ba năm quay đầu về núi",
    "meaning": "Nghĩa đen: Cáo sinh ra ở các hốc núi và dựa vào núi mà sống. Do đó, dù chết đã ba năm thì nó cũng quay đầu về núi để nhớ nơi ăn chốn ở cũ của mình. Đó là điều mà cha ông ta tin như vậy. Nghĩa bóng: Con người dù lớn lên sinh sống ở đâu, bao giờ cũng hướng về quê hương, nhớ đến cội nguồn của mình. Càng đi xa tình cảm đó càng trở nên thắm thiết"
  },
  {
    "id": "394",
    "text": "Chung lưng đấu cật",
    "meaning": "Thành ngữ có hàm ý nói về sự đoàn kết, chung sức của con người nhằm vượt qua những thử thách lớn."
  },
  {
    "id": "395",
    "text": "Chậm như rùa",
    "meaning": "Thành ngữ nói về người, vật có hành động chậm chạp, rề rà, làm mãi không xong, được ví như sự chậm chạp của con rùa khi bò."
  },
  {
    "id": "396",
    "text": "Công thành danh toại",
    "meaning": "Thành ngữ ám chỉ sự thành công to lớn, đạt được kết quả mĩ mãn trên con đường gây dựng công danh, sự nghiệp."
  },
  {
    "id": "397",
    "text": "Đi guốc trong bụng",
    "meaning": "Thành ngữ có nghĩa là hiểu rõ mọi suy nghĩ, ý định của một ai đó, giống như nhìn thấy tâm trí của họ."
  },
  {
    "id": "398",
    "text": "Đẽo cày giữa đường",
    "meaning": "Thành ngữ nghĩa là làm hỏng việc vì không quyết đoán, cứ nghe theo ý kiến của người khác."
  },
  {
    "id": "399",
    "text": "Đất lành chim đậu",
    "meaning": "Nghĩa đen: Chim chóc thường rủ nhau đến làm tổ ở những nơi có cây cao bóng cả, có lùm bụi rậm rạp, và nhất là không bị người đến quấy phá, săn đuổi. Nghĩa bóng: Con người chọn những vùng đất đai phì nhiêu, màu mỡ, người dân hiền hoà để mà sinh sống và làm việc."
  },
  {
    "id": "400",
    "text": "Đầu trâu mặt ngựa",
    "meaning": "Thành ngữ nghĩa là hung hãn, ngang ngược, không có tình người."
  },
  {
    "id": "401",
    "text": "Đen như mực",
    "meaning": "Thành ngữ miêu tả mức độ màu đen: tối đen, không thể nhìn thấy được (miêu tả bầu trời. không gian); hoặc đen nhánh như màu mực (miêu tả da người)."
  },
  {
    "id": "402",
    "text": "Đẹp như tiên",
    "meaning": "Thành ngữ chỉ những người có vẻ bề ngoài xinh đẹp, lý tưởng, lộng lẫy, kiêu sa."
  },
  {
    "id": "403",
    "text": "Dương dương tự đắc",
    "meaning": "Thành ngữ nghĩa là kiêu ngạo, vênh váo, coi mình hơn người."
  },
  {
    "id": "404",
    "text": "Đi đời nhà ma",
    "meaning": "Thành ngữ có nghĩa là một sự vật, sự việc bị chết, bị hỏng hoặc biến mất hoàn toàn với ý hài hước, mỉa mai."
  },
  {
    "id": "405",
    "text": "Đứng núi này trông núi nọ.",
    "meaning": "Thành ngữ phê phán những kẻ quá tham vọng, tham lam, không bao giờ bằng lòng với tất cả những gì mình đang có mà luôn so sánh, mơ tưởng đến những thứ cao sang hơn. Những người như này sẽ luôn chạy theo những điều phù phiếm, đánh mất đi những điều tốt đẹp từng thuộc về mình."
  },
  {
    "id": "406",
    "text": "Đem muối bỏ bể",
    "meaning": "Thành ngữ nghĩa là làm việc tốn công, vô ích, không thấm vào đâu, không có hiệu quả."
  },
  {
    "id": "407",
    "text": "Dữ như cọp",
    "meaning": "Thành ngữ ám chỉ những con người hung dữ, độc ác, dữ tợn, tàn nhẫn, được ví như đặc điểm hung dữ của loài hổ."
  },
  {
    "id": "408",
    "text": "Đầu voi đuôi chuột",
    "meaning": "Thành ngữ chỉ sự việc có khởi đầu có vẻ to tát, rầm rộ, khoa trương nhưng kết thúc lại rất nhỏ bé, thậm chí là không có gì."
  },
  {
    "id": "409",
    "text": "Ếch ngồi đáy giếng",
    "meaning": "Thành ngữ chỉ những người hiểu biết ít do điều kiện tiếp xúc hạn chế, hoặc chỉ những người có tầm nhìn hạn hẹp, kém hiểu biết nhưng lại tự cao tự đại, luôn cho mình giỏi hơn người khác"
  },
  {
    "id": "410",
    "text": "Ế sưng ế sỉa",
    "meaning": "Thành ngữ nghĩa là hàng hóa ế ẩm, bán không chạy."
  },
  {
    "id": "411",
    "text": "Ếch vồ hoa dâm bụt",
    "meaning": "Thành ngữ nghĩa là làm việc vô ích, tốn công sức, không đem lại lợi lộc gì."
  },
  {
    "id": "412",
    "text": "Êm chèo mát mái",
    "meaning": "Thành ngữ nghĩa là suôn sẻ, trót lọt, không gặp trắc trở, khó khăn."
  },
  {
    "id": "413",
    "text": "Ép như ép giò",
    "meaning": "Thành ngữ nghĩa là đông đúc, chen lấn chật cứng, không cựa mình được."
  },
  {
    "id": "414",
    "text": "Êm như nhung",
    "meaning": "Thành ngữ nghĩa là êm dịu, mềm mại, mượt mà."
  },
  {
    "id": "415",
    "text": "Êm như ru",
    "meaning": "Thành ngữ nghĩa là có âm thanh êm nhẹ, tựa như tiếng hát ru."
  },
  {
    "id": "416",
    "text": "Gắp lửa bỏ tay người",
    "meaning": "Thành ngữ nghĩa là bịa đặt, vu khống để hãm hại người khác."
  },
  {
    "id": "417",
    "text": "Giậu đổ bìm leo",
    "meaning": "Thành ngữ ám chỉ việc ta lợi dụng lúc người khác gặp hoạn nạn, khó khăn, gặp điều không may để lấn át, áp đảo, vùi dập người đó."
  },
  {
    "id": "418",
    "text": "Gieo gió gặt bão",
    "meaning": "Thành ngữ nói về việc người nào gây tội ác thì phải tự nhận lấy, gánh chịu hậu quả của tội ác mình gây ra."
  },
  {
    "id": "419",
    "text": "Gậy ông đập lưng ông",
    "meaning": "Thành ngữ ám chỉ việc một người mưu mô, dùng thủ đoạn để hãm hại người khác, nhưng cuối cùng lại bị chính thủ đoạn đó làm hại bản thân mình."
  },
  {
    "id": "420",
    "text": "Giận cá chém thớt",
    "meaning": "Thành ngữ nghĩa là giận một người nhưng lại trút sự bực tức lên người, vật không liên quan."
  },
  {
    "id": "421",
    "text": "Giàu vì bạn, sang vì vợ",
    "meaning": "Thành ngữ thể hiện tầm quan trọng của người vợ và người bạn đối với người đàn ông. Khi biết cách chọn bạn tốt, bạn sẽ cùng làm giàu với ta, giúp đỡ ta qua sự khó khăn. Khi cưới được người vợ tốt, khéo ăn nói, cư xử, người vợ ấy sẽ giúp ta trở nên sang trọng hơn trong mắt người ngoài. Từ đó, tác giả dân gian nhắc nhở chúng ta cần thủy chung, biết ơn, quý trọng người vợ, người bạn tốt của mình."
  },
  {
    "id": "422",
    "text": "Góp gió thành bão",
    "meaning": "Thành ngữ có hàm ý nói về việc khi con người tích cóp, tiết kiệm của cải, kinh nghiệm, công sức từng chút một, lâu dần người đó sẽ sở hữu tài sản lớn, có nhiều đóng góp cho xã hội và có nhiều kinh nghiệm sống hơn."
  },
  {
    "id": "423",
    "text": "Gan vàng dạ sắt",
    "meaning": "Thành ngữ được hiểu theo 2 nghĩa Nghĩa 1: Thành ngữ ám chỉ đến tấm lòng chung thuỷ, son sắt của con người Nghĩa 2: Thành ngữ chỉ sự vững vàng, kiên định trước những khó khăn, thử thách của cuộc đời"
  },
  {
    "id": "424",
    "text": "Giá áo túi cơm",
    "meaning": "Thành ngữ nghĩa là người vô tích sự, chẳng làm nên việc gì."
  },
  {
    "id": "425",
    "text": "Giả chết bắt quạ",
    "meaning": "Thành ngữ nghĩa là khôn ngoan, giả vờ hiền lành, ngoan ngoãn để lừa người ta vào cạm bẫy."
  },
  {
    "id": "426",
    "text": "Gần nhà xa ngõ",
    "meaning": "Thành ngữ nghĩa là nhà thì gần, còn đường vào, cổng vào thì quanh co."
  },
  {
    "id": "427",
    "text": "Giả nhân giả nghĩa",
    "meaning": "Thành ngữ phê phán những kẻ tỏ ra mình là người có nhân cách tốt, sống biết điều, nhưng bản chất lại độc ác, hành động đê tiện, giả dối."
  },
  {
    "id": "428",
    "text": "Học một biết mười.",
    "meaning": "Thành ngữ ám chỉ những người học ít, nhưng lại suy ngẫm, hiểu biết được nhiều điều hay. Từ đó, tác giả dân gian nhắc nhở mọi người cần biết suy nghĩ rộng, từ một kiến thức có thể suy luận ra nhiều kiến thức khác nhau"
  },
  {
    "id": "429",
    "text": "Hữu xạ tự nhiên hương",
    "meaning": "Thành ngữ ý chỉ việc nếu chúng ta có lương thiện, đạo đức, tài năng, sống có ích thì tự khắc sẽ được mọi người nhận ra đức tính tốt, không cần phải khoe mẽ, phô bày bản thân."
  },
  {
    "id": "430",
    "text": "Hổ phụ sinh hổ tử",
    "meaning": "Thành ngữ nghĩa là cha là người hùng thì sinh ra con là người hùng, như hổ sinh ra hổ."
  },
  {
    "id": "431",
    "text": "Họa vô đơn chí",
    "meaning": "Thành ngữ nghĩa là tai họa không chỉ đến một lần, thường là dồn dập, hết nạn này đến nạn khác."
  },
  {
    "id": "432",
    "text": "Hót như khướu",
    "meaning": "Thành ngữ chỉ những người nói nhiều, nói hay, lời nói ngọt ngào. Ngoài ra, thành ngữ còn nói về những kẻ chuyên nịnh bợ cấp trên."
  },
  {
    "id": "433",
    "text": "Hữu danh vô thực",
    "meaning": "Thành ngữ châm biếm những kẻ tưởng như có danh, có tiếng, có tài nhưng thực chất thì bản thân người đó lại chẳng có gì."
  },
  {
    "id": "434",
    "text": "Học rộng tài cao",
    "meaning": "Thành ngữ ý chỉ những người ham học, có học vấn, hiểu biết rất rộng, uyên bác và thâm sâu."
  },
  {
    "id": "435",
    "text": "Há miệng chờ sung",
    "meaning": "Thành ngữ phê phán những người lười biếng, không chịu lao động, chỉ chờ ăn sẵn bằng cách cầu may."
  },
  {
    "id": "436",
    "text": "Hữu dũng vô mưu",
    "meaning": "Thành ngữ ám chỉ những người chỉ có sức mạnh, làm việc gì cũng chỉ cậy vào sức lực chứ không có trí tuệ, mưu trí, chiến lược nào. Những người như này thường khó có thể đạt được thành công lớn."
  },
  {
    "id": "437",
    "text": "Hoa nhường nguyệt thẹn",
    "meaning": "Thành ngữ chỉ những cô gái có vẻ ngoài hoàn mĩ, xinh đẹp tuyệt hảo, không một ai có thể sánh bằng."
  },
  {
    "id": "438",
    "text": "Học tài thi phận",
    "meaning": "Thành ngữ nghĩa là đỗ đạt, thành đạt trong thi cử là do số phận, chứ không phải do học lực, tài năng quyết định."
  },
  {
    "id": "439",
    "text": "Hiền như bụt",
    "meaning": "Thành ngữ nghĩa là hiền lành, tốt bụng, ví như bụt được coi là rất hiên, rất đức độ ở trong chùa."
  },
  {
    "id": "440",
    "text": "Ích kỷ hại nhân",
    "meaning": "Thành ngữ nghĩa là hẹp hòi, ích kỷ, muốn giành lợi ích cho mình dù phải làm hại người khác."
  },
  {
    "id": "441",
    "text": "Im ỉm như gái ngồi phải cọc",
    "meaning": "Thành ngữ nghĩa là im lặng, lặng thinh, không nói năng gì, như con gái ngồi phải cọc đau mà không dám kêu vì xấu hổ."
  },
  {
    "id": "442",
    "text": "Im như thóc đổ bồ",
    "meaning": "Thành ngữ nghĩa là rất im ắng, lặng thinh, như người có thóc lặng lẽ đổ vào bồ để người khác không biết."
  },
  {
    "id": "443",
    "text": "Im lặng như tờ",
    "meaning": "Thành ngữ nghĩa là im lặng, lặng thinh, không nói năng gì."
  },
  {
    "id": "444",
    "text": "Ít ngài dài đũa",
    "meaning": "Thành ngữ nghĩa là càng ít người thì càng được hưởng nhiều."
  },
  {
    "id": "445",
    "text": "Inh tai nhức óc",
    "meaning": "Thành ngữ nghĩa là ầm ĩ, gây cảm giác khó chịu, mệt mỏi."
  },
  {
    "id": "446",
    "text": "Ích nhà lợi nước",
    "meaning": "Thành ngữ nghĩa là có ích lợi cho từng gia đình và cho cả đất nước."
  },
  {
    "id": "447",
    "text": "Im hơi lặng tiếng",
    "meaning": "Thành ngữ chỉ việc con người im lặng, không nói gì, không để lộ bất cứ thái độ, hành động nào của mình."
  },
  {
    "id": "448",
    "text": "Ít thầy đầy đẫy",
    "meaning": "Thành ngữ nghĩa là càng ít người càng hưởng nhiều lợi lộc."
  },
  {
    "id": "449",
    "text": "Ít xít ra nhiều",
    "meaning": "Thành ngữ nghĩa là thổi phồng, phóng đại sự việc, làm cho nó lớn hơn thực tế."
  },
  {
    "id": "450",
    "text": "Ích quốc lợi dân",
    "meaning": "Thành ngữ nghĩa là có ích cho dân, cho nước, vì lợi ích của tập thể, của đất nước."
  },
  {
    "id": "451",
    "text": "Im ỉm như bà cốt uống thuốc",
    "meaning": "Thành ngữ nghĩa là rất im lặng, như bà cốt lặng thinh uống thuốc khi ốm để giấu thói lừa dối thiên hạ về phép chữa bệnh của mình."
  },
  {
    "id": "452",
    "text": "Khỏe như voi",
    "meaning": "Thành ngữ chỉ những người rất khỏe, có thể làm được nhiều việc nặng, được ví như sức mạnh của con voi."
  },
  {
    "id": "453",
    "text": "Kỳ phùng địch thủ",
    "meaning": "Thành ngữ chỉ những đối thủ mạnh, có trình độ, bản lĩnh tương đương với ta, rất khó đánh thắng."
  },
  {
    "id": "454",
    "text": "Khổ tận cam lai",
    "meaning": "Thành ngữ nghĩa là hết khổ đau, bất hạnh thì đã đến sung sướng, hạnh phúc."
  },
  {
    "id": "455",
    "text": "Khuynh gia bại sản",
    "meaning": "Thành ngữ nghĩa là tan nát cửa nhà, khánh kiệt tài sản, của cải."
  },
  {
    "id": "456",
    "text": "Kẻ cắp gặp bà già",
    "meaning": "Thành ngữ ám chỉ việc những kẻ gian xảo, ranh mãnh, nhiều mánh khóe lại gặp phải những người cao tay, dày dặn kinh nghiệm, không dễ bị lừa, có thể trừng trị những kẻ gian."
  },
  {
    "id": "457",
    "text": "Khẩu Phật tâm xà",
    "meaning": "Thành ngữ ám chỉ những kẻ ngoài miệng thì nói những điều hay, điều tốt, thể hiện mình có nhân cách tốt, nhưng thực chất bên trong lại nham hiểm, độc ác."
  },
  {
    "id": "458",
    "text": "Kiến giả nhất phận",
    "meaning": "Thành ngữ nghĩa là mọi người đều chỉ chú ý tới số phận của mình, ai biết phận ấy."
  },
  {
    "id": "459",
    "text": "Khỏe như trâu",
    "meaning": "Thành ngữ ca ngợi những người có sức khỏe phi thường, được ví với sức khỏe vượt trội của con trâu."
  },
  {
    "id": "460",
    "text": "Khôn nhà dại chợ",
    "meaning": "Thành ngữ chỉ những người khi ở nhà, đối mặt với người thân quen thì cư xử tinh ranh, khôn ngoan; nhưng khi bước ra ngoài xã hội, người đó lại xư xử vụng về, dại dột, bị kẻ khác lừa."
  },
  {
    "id": "461",
    "text": "Kính trên nhường dưới",
    "meaning": "Thành ngữ nói đến cách giao tiếp, ứng xử của con người. Theo đó, ở trong gia đình cũng như ngoài xã hội, gặp ai lớn tưởi, có địa vị cao hơn, vai vế hơn mình thì mình cần lễ phép kính trọng. Còn đối với người kém tuổi hơn thì mình cần nhường nhịn, lấy sự hoà dịu để đối xử với họ."
  },
  {
    "id": "462",
    "text": "Khóc như ri",
    "meaning": "Câu thành ngữ nói đến tiếng khóc của nhiều người cùng lúc, với những âm thanh, cung bậc cao thấp khác nhau, hòa lẫn với nhau, tạo nên một thứ thanh âm bi thương, thống thiết"
  },
  {
    "id": "463",
    "text": "Kín như bưng",
    "meaning": "Thành ngữ ám nói về những vật, hiện tượng có đặc điểm kín mít, không thấy được gì bên trong hoặc những sự việc được giữ bí mật hoàn toàn. Ngoài ra, thành ngữ còn chỉ những người sống khép kín, kín đáo, không tâm sự, bộc bạch với người bên ngoài."
  },
  {
    "id": "464",
    "text": "Lớn nhanh như thổi",
    "meaning": "Thành ngữ có hàm ý chỉ sự phát triển, lớn lên một cách nhanh chóng, mạnh mẽ, vượt ngoài mức thường thấy."
  },
  {
    "id": "465",
    "text": "Lạt mềm buộc chặt",
    "meaning": "Thành ngữ khuyên chúng ta nên cư xử nhã nhặn, nhẹ nhàng, dịu dàng, lịch sự với người khác. Những người như vậy thường đạt hiệu quả trong giao tiếp tốt hơn những người cư xử cục súc, nóng tính."
  },
  {
    "id": "466",
    "text": "Lo bò trắng răng",
    "meaning": "Thành ngữ Lo bò trắng răng có ý chỉ những người hay lo lắng điều vô lí, không cần thiết, khiến cuộc sống nặng nề không đáng. Ngoài ra cũng mang nghĩa nhắn nhủ con người không nên lo nghĩ nhiều, vui vẻ, lạc quan ddeer tận hưởng cuộc sống một cách trọn vẹn."
  },
  {
    "id": "467",
    "text": "Lên thác xuống ghềnh",
    "meaning": "Thành ngữ chỉ sự khó khăn, gian truân, nguy hiểm mà con người phải đối mặt. Qua đó, tác giả dân gian nhắn nhủ chúng ta cần kiên trì, nỗ lực, dũng cảm để có thể vượt qua gian nan, thử thách."
  },
  {
    "id": "468",
    "text": "Liệu cơm gắp mắm",
    "meaning": "Thành ngữ khuyên chúng ta phải nhìn vào hoàn cảnh, năng lực của bản thân mà nhận phần công việc, không nên ôm đồm quá nhiều vượt ngoài khả năng của mình để tránh gặp thất bại không mong muốn."
  },
  {
    "id": "469",
    "text": "Lắm thầy thối ma",
    "meaning": "Thành ngữ ý nói khi cùng làm một việc, mọi người đều có ý kiến khác nhau, không ai suy nghĩ giống ai, sinh ra không thống nhất được ý kiến chung và làm hỏng việc."
  },
  {
    "id": "470",
    "text": "Lấy độc trị độc",
    "meaning": "Thành ngữ ý nói về việc ta lấy thuốc có chất độc để chữa bệnh ác tính, lấy cái xấu để trừng trị cái xấu, lợi dụng người độc ác để trừng trị người độc ác."
  },
  {
    "id": "471",
    "text": "Lên voi xuống chó",
    "meaning": "Thành ngữ nói về việc một người có cuộc đời, sự nghiệp bấp bênh, không ổn định, đầy thăng trầm, lúc thì vinh hiển, có nhiều thành công, khi thì thất bại nặng nề."
  },
  {
    "id": "472",
    "text": "Lá ngọc cành vàng",
    "meaning": "Thành ngữ thường chỉ những người người có xuất thân là dòng dõi con cháu quý tộc, vua chúa quyền quý, giàu có, cao sang. Ngoài ra, câu tục ngữ còn nói về những người được cưng chiều, bao bọc từ nhỏ, hưởng cuộc sống giàu sang, không thiếu điều gì."
  },
  {
    "id": "473",
    "text": "Làm đầy tớ thằng khôn còn hơn làm thầy thằng dại",
    "meaning": "Thành ngữ có hàm ý khuyên chúng ta thà làm đầy tớ, học trò của người khôn khéo để học được điều hay còn hơn làm người thầy, dạy dỗ những người dại khờ nhưng chỉ tốn công vô ích."
  },
  {
    "id": "474",
    "text": "Lam sơn chướng khí",
    "meaning": "Thành ngữ nghĩa là không khí, khí hậu rừng núi độc địa, gây nhiều tác hại tới sức khỏe con người."
  },
  {
    "id": "475",
    "text": "Lời hay ý đẹp",
    "meaning": "Thành ngữ chỉ những lời nói vừa có nội dung hay, cách diễn đạt dễ nghe và hấp dẫn, lôi cuốn người nghe."
  },
  {
    "id": "476",
    "text": "Một nắng hai sương",
    "meaning": "Thành ngữ nói về sự vất vả, cực nhọc của con người khi phải chịu đựng cảnh làm việc nặng nhọc triền miên trong điều kiện không thuận lợi."
  },
  {
    "id": "477",
    "text": "Môi hở răng lạnh",
    "meaning": "Thành ngữ có hàm ý chỉ mối quan hệ gắn bó khăng khít, mật thiết như tình cảm của anh em trong một nhà, mọi người trong cùng một nước."
  },
  {
    "id": "478",
    "text": "Máu chảy ruột mềm",
    "meaning": "Thành ngữ ý chỉ tình cảm thân thiết, thương yêu, đùm bọc lẫn nhau, chia ngọt sẻ bùi với nhau giữa những con người có chung máu mủ ruột thịt."
  },
  {
    "id": "479",
    "text": "Mượn hoa cúng Phật",
    "meaning": "Thành ngữ nói về việc ta lấy của cải của người này đem cho, tặng người khác với mục đích biểu lộ tấm lòng chân thành của mình."
  },
  {
    "id": "480",
    "text": "Mã đáo thành công",
    "meaning": "Thành ngữ như một câu chúc dành cho người mà chúng ta yêu quý, với ý nghĩa mong muốn người đó luôn thành công, thuận lợi trong công việc cũng như trong cuộc sống."
  },
  {
    "id": "481",
    "text": "Mưu sự tại nhân, hành sự tại thiên",
    "meaning": "Thành ngữ có hàm ý là: con người tính toán, lên kế hoạch cho công việc, nhưng công việc thành công hay không một phần là do tác động từ điều kiện khách quan bên ngoài, con người không thể lường trước được."
  },
  {
    "id": "482",
    "text": "Mưa thuận gió hòa",
    "meaning": "Thành ngữ nói về thời tiết thuận lợi, ôn hòa, thích hợp cho việc trồng cấy, canh tác và thúc đẩy sự phát triển của cây cối."
  },
  {
    "id": "483",
    "text": "Mở cờ trong bụng",
    "meaning": "Thành ngữ miêu tả cảm xúc vô cùng vui sướng, hạnh phúc trước một sự kiện nào đó."
  },
  {
    "id": "484",
    "text": "Một vừa hai phải",
    "meaning": "Thành ngữ chỉ mức độ vừa phải, không vượt quá xa mức bình thường. Ngoài ra, thành ngữ còn có hàm ý khuyên con người không nên làm gì quá đáng."
  },
  {
    "id": "485",
    "text": "Muốn ăn gắp bỏ cho người",
    "meaning": "Thành ngữ chỉ những người vòng vo, lẩn tránh, không dám nói thẳng điều mình mong muốn mà kiếm cái cớ khác để tạo điều kiện thực hiện mong muốn của mình. Ngoài ra, thành ngữ còn nói về những kẻ giả tạo, tham lan, ích kỷ nhưng lại tỏ ra lịch sự, cao thượng."
  },
  {
    "id": "486",
    "text": "Mưa dầm thấm lâu",
    "meaning": "Thành ngữ ý chỉ nếu chúng ta cố gắng kiên trì làm một việc trong thời gian dài, chúng ta sẽ nhận được kết quả xứng đáng với công sức đã bỏ ra."
  },
  {
    "id": "487",
    "text": "Mò kim đáy bể",
    "meaning": "Thành ngữ chỉ những việc làm khó khăn, vất vả nhưng lại vô vọng, khó đem lại kết quả tốt, có thể dẫn đất thất bại."
  },
  {
    "id": "488",
    "text": "Nhất lé, nhì lùn, tam hô, tứ rỗ",
    "meaning": "Thành ngữ ý chỉ những con người có ngoại hình xấu, gian xảo, âm mưu, bị mọi người kì thị, chê bai. Tuy nhiên, thành ngữ này chỉ là quan niệm xưa của nhân dân ta, không còn tính phù hợp cho cuộc sống ngày nay."
  },
  {
    "id": "489",
    "text": "Nhân chi sơ, tính bản thiện",
    "meaning": "Thành ngữ có hàm ý: con người từ khi sinh ra đã vốn có sự lương thiện, biết điều phải trái. Vì vậy, con người khi lớn lên thì cần biết giữ đúng bản chất thiện lành, tránh làm điều xấu."
  },
  {
    "id": "490",
    "text": "Ngựa quen đường cũ",
    "meaning": "Thành ngữ có hàm ý nói về những người không dứt ra khỏi tật xấu, khó lòng thay đổi bản thân, thấy sai nhưng cứ lao vào làm như một thói quen."
  },
  {
    "id": "491",
    "text": "Nhát như thỏ đế",
    "meaning": "Thành ngữ ám chỉ những người vô cùng nhát gan, nhút nhát, hay tỏ ra sợ sệt trước mọi thứ."
  },
  {
    "id": "492",
    "text": "Nhanh như cắt",
    "meaning": "Thành ngữ chỉ tính chất rất nhanh, trong thoáng chốc, nhanh như hành động của chim cắt khi lao xuống săn mồi."
  },
  {
    "id": "493",
    "text": "Nước đổ đầu vịt",
    "meaning": "hành ngữ chỉ những người không có khả năng tiếp thu ý kiến của người khác, dù người đó có được dạy dỗ đến đâu thì cũng vô ích, ví như nước đổ vào đầu con vịt."
  },
  {
    "id": "494",
    "text": "Nghiêng nước nghiêng thành",
    "meaning": "Thành ngữ chỉ sắc đẹp lộng lẫy, kiêu sa của người phụ nữ đẹp, ví như sắc đẹp ấy có thể làm nghiêng ngả cả thành lũy, đất nước."
  },
  {
    "id": "495",
    "text": "Nghĩa tử là nghĩa tận",
    "meaning": "Thành ngữ nói về việc con người khi sống đối xử với nhau cho dù thế nào đi chăng nữa thì đến lúc chết cũng là hết. Chính vì vậy, thành ngữ có hàm ý khuyên chúng ta cần bỏ đi sự thù hằn, ganh ghét, làm tròn nghĩa vụ với người đã chết bằng cách bày tỏ sự thương tiếc chân thành của mình."
  },
  {
    "id": "496",
    "text": "Ngựa non háu đá",
    "meaning": "Thành ngữ ý chỉ những người trẻ tuổi thường có tính cách kiêu ngạo, hiếu thắng, hung hăng, thiếu sự chín chắn và suy nghĩ có phần nông nổi."
  },
  {
    "id": "497",
    "text": "Nhường cơm sẻ áo",
    "meaning": "Thành ngữ có hàm ý nói về sự yêu thương, quan tâm, đùm bọc, giúp đỡ nhau giữa người với người trong xã hội."
  },
  {
    "id": "498",
    "text": "Nước đổ lá khoai/ lá môn",
    "meaning": "Thành ngữ có hàm ý nói về việc chúng ta hết lòng dạy bảo, khuyên răn ai đó, nhưng người ấy lại không chịu tiếp thu, kết quả là tốn công vô ích, ví như nước đổ lên lá khoai/ lá môn rồi lại trôi xuống đất."
  },
  {
    "id": "499",
    "text": "Ông mất chân giò, bà thò chai rượu",
    "meaning": "Thành ngữ chỉ mối quan hệ công bằng, có qua có lại, không ai bị thua thiệt giữa hai hay nhiều người."
  },
  {
    "id": "500",
    "text": "Ông tơ bà nguyệt",
    "meaning": "Thành ngữ nghĩa là người mai mối, tác hợp trong việc dựng vợ gả chồng."
  },
  {
    "id": "501",
    "text": "Ốc chưa mang nổi mình ốc sao mang được cọc",
    "meaning": "Thành ngữ nghĩa là đa mang, chưa lo nổi cho cuộc sống, phận sự của mình lại đi lo lắng cho người khác."
  },
  {
    "id": "502",
    "text": "Ơn sâu nghĩa nặng",
    "meaning": "Thành ngữ nói về sự mang nặng công ơn, thái độ hết sức biết ơn của chúng ta với những người đã hết lòng giúp đỡ mình."
  },
  {
    "id": "503",
    "text": "Ở ác gặp dữ",
    "meaning": "Thành ngữ phản ánh quy luật nhân quả trong cuộc sống. Theo đó, những người sống ác, làm điều xấu, hại người sẽ phải đối mặt với những điều không may, những tai hoạ, những rắc rối. Đây cũng giống như một lời cảnh tỉnh, nhắc nhở mọi người nên sống tốt, làm việc thiện để tránh những điều không hay xảy ra"
  },
  {
    "id": "504",
    "text": "Ông chẳng bà chuộc",
    "meaning": "Thành ngữ nghĩa là chủng chẳng, không hợp, không thống nhất trong suy nghĩ, hành động."
  },
  {
    "id": "505",
    "text": "Ở đâu âu đấy",
    "meaning": "Thành ngữ ám chỉ việc khi người ta ở chỗ nào thì thường yêu mến, vun vén, chăm lo cho chỗ đó."
  },
  {
    "id": "506",
    "text": "Oan gia túc trái",
    "meaning": "Thành ngữ nghĩa là bị oan trái, bị tai vạ oan."
  },
  {
    "id": "507",
    "text": "Oan thị kính",
    "meaning": "Thành ngữ nghĩa là nỗi oan bị vu vạ, bức phải nhận, không thể giãi bày hay thanh minh được."
  },
  {
    "id": "508",
    "text": "Ôm rơm rặm bụng",
    "meaning": "Thành ngữ nghĩa là làm những việc không đâu, không phải của mình, vô ích, vất vả, phiền phức."
  },
  {
    "id": "509",
    "text": "Oai phong lẫm liệt",
    "meaning": "Thành ngữ ca ngợi mẫu người có dáng vẻ hùng dũng, mạnh mẽ, uy nghiêm khiến người khác phải nể sợ."
  },
  {
    "id": "510",
    "text": "Ôm chân liếm gót",
    "meaning": "Thành ngữ nghĩa là luồn cúi, bợ đỡ vô cùng đê hèn."
  },
  {
    "id": "511",
    "text": "Phá cũi sổ lồng",
    "meaning": "Thành ngữ nghĩa là thoát khỏi cảnh tù hãm, được tự do tung hoành, như con vật thoát cũi, chim thoát lồng."
  },
  {
    "id": "512",
    "text": "Phi thương bất phú",
    "meaning": "Thành ngữ ý nói việc chúng ta không buôn bán, làm ăn thì không thể giàu và phát triển cuộc sống được."
  },
  {
    "id": "513",
    "text": "Phá gia chi tử",
    "meaning": "Thành ngữ có nghĩa là con cái hư hỏng, phá hoại tài sản và danh tiếng của gia đình."
  },
  {
    "id": "514",
    "text": "Phong ba bão táp",
    "meaning": "Thành ngữ nghĩa là khó khăn, thử thách lớn phải trải qua trên con đường sự nghiệp."
  },
  {
    "id": "515",
    "text": "Phép vua thua lệ làng",
    "meaning": "Thành ngữ nghĩa là ở làng xã thì tập quán, lề thói vượt lên mọi luật lệ nhà nước nên đến nơi nào phải tuân thủ phép tắc, tập quán nơi đó."
  },
  {
    "id": "516",
    "text": "Phù hộ độ trì",
    "meaning": "Thành ngữ nghĩa là che chở, giúp đỡ."
  },
  {
    "id": "517",
    "text": "Phàm phu tục tử",
    "meaning": "Thành ngữ chỉ người thô lỗ, tục tằn, tầm thường hay nhiều tật xấu."
  },
  {
    "id": "518",
    "text": "Phận bạc như vôi",
    "meaning": "Thành ngữ nghĩa là số phận hẩm hữu, bạc bẽo, bất hạnh."
  },
  {
    "id": "519",
    "text": "Phi cổ bất thành kim",
    "meaning": "Thành ngữ nghĩa là không có xưa thì không thể có nay, nên phải bảo vệ, giữ gìn, kế thừa truyền thống tốt đẹp."
  },
  {
    "id": "520",
    "text": "Phàm ăn tục uống",
    "meaning": "Thành ngữ nghĩa là ăn uống nhiều, tham lam, thô tục."
  },
  {
    "id": "521",
    "text": "Phách lạc hồn xiêu",
    "meaning": "Thành ngữ diễn tả trạng thái tinh thần, cảm xúc rối bời, mất phương hướng, không định hình bản thân."
  },
  {
    "id": "522",
    "text": "Phận ẩm duyên ôi",
    "meaning": "Thành ngữ nghĩa là số phận hẩm hữu, không may mắn trong tình duyên, sự nghiệp."
  },
  {
    "id": "523",
    "text": "Quá tam ba bận",
    "meaning": "Thành ngữ nghĩa là đến lần thứ ba mà vẫn hỏng thì dừng lại, không cố gắng nữa."
  },
  {
    "id": "524",
    "text": "Quê cha đất tổ",
    "meaning": "Thành ngữ chỉ quê hương, nguồn gốc, cội nguồn của con người. Ở nơi ấy, mỗi người chúng ta đã được sinh ra, lớn lên và kế thừa những đức tính, phong tục, tập quán tốt đẹp của ông cha."
  },
  {
    "id": "525",
    "text": "Quyền cao chức trọng",
    "meaning": "Thành ngữ nghĩa là có địa vị cao sang, có quyền lực lớn trong xã hội."
  },
  {
    "id": "526",
    "text": "Qua cầu rút ván",
    "meaning": "Thành ngữ nói đến loại người sống vô ơn, ích kỉ, sau khi được người khác giúp đỡ thì lật mặt, làm hại ân nhân của mình."
  },
  {
    "id": "527",
    "text": "Quân sư quạt mo",
    "meaning": "Thành ngữ nghĩa là người bày mưu kế, mách nước tồi, kém."
  },
  {
    "id": "528",
    "text": "Quang minh chính đại",
    "meaning": "Thành ngữ ám chỉ sự rõ ràng, sáng tỏ, ngay thẳng, không có chút nào mờ ám, khuất tất."
  },
  {
    "id": "529",
    "text": "Quốc sắc thiên hương",
    "meaning": "Thành ngữ có hàm ý chỉ người phụ nữ có sắc đẹp tuyệt vời, không gì có thể sánh bằng. Ngoài ra, thành ngữ này đôi khi cũng dùng để chỉ loài hoa mẫu đơn."
  },
  {
    "id": "530",
    "text": "Quân lệnh như sơn",
    "meaning": "Thành ngữ nghĩa là mệnh lệnh trong quân đội dứt khoát, phải chấp hành."
  },
  {
    "id": "531",
    "text": "Quỷ tha ma bắt",
    "meaning": "Thành ngữ như một lời chửi rủa với những kẻ có hành động xấu xa, tiêu cực, không thể chấp nhận được, đáng để ma quỷ bắt đi."
  },
  {
    "id": "532",
    "text": "Quýt làm cam chịu",
    "meaning": "Thành ngữ nghĩa là người này làm sai, làm hỏng nhưng người khác phải gánh chịu trách nhiệm, hậu quả."
  },
  {
    "id": "533",
    "text": "Quần là áo lượt",
    "meaning": "Thành ngữ chỉ những người giàu có, sang trọng, luôn tỏ ra lịch sự, chỉnh tề trong ăn mặc, đi đứng; hoặc chỉ người ăn mặc đẹp đẽ, gọn gàng."
  },
  {
    "id": "534",
    "text": "Quốc gia đại sự",
    "meaning": "Thành ngữ nghĩa là công việc lớn của nhà nước, công việc có tầm quan trọng."
  },
  {
    "id": "535",
    "text": "Run như cầy sấy",
    "meaning": "Thành ngữ chỉ hành động run rẩy, run lẩy bẩy do sợ hãi hoặc do bị lạnh, ốm, ví như việc con chó run lên vì bị dính nước."
  },
  {
    "id": "536",
    "text": "Ruột để ngoài da",
    "meaning": "Thành ngữ chỉ người quá vô tư, bộp chộp trong lời nói, thật thà quá mức, không giấu ai điều gì, dễ làm mất lòng người khác."
  },
  {
    "id": "537",
    "text": "Rừng vàng biển bạc",
    "meaning": "Thành ngữ có hàm ý khẳng định sự giàu có, phong phú của tài nguyên thiên nhiên cũng như tầm quan trọng của thiên nhiên đối với con người. Rừng và biển được ví với những kim loại quý, tức là nó là tài nguyên quý giá, đem đến cho con người cuộc sống hạnh phúc, ấm no. Con người cần biết trân trọng và bảo vệ nguồn tài nguyên thiên nhiên ấy."
  },
  {
    "id": "538",
    "text": "Rán sành ra mỡ",
    "meaning": "Thành ngữ chỉ những con người keo kiệt, bủn xỉn, không dám chi tiêu cho ngay cả những nhu cầu hàng ngày của bản thân."
  },
  {
    "id": "539",
    "text": "Ruột ngựa, phổi bò",
    "meaning": "Thành ngữ chỉ những người bộc trực, thẳng thắn, không dấu diếm, hiền lành và bao dung với những người xung quanh nhưng nhiều lúc lại không ý tứ vì nói ra điều không nên nói."
  },
  {
    "id": "540",
    "text": "Râu ông nọ cắm cằm bà kia",
    "meaning": "Thành ngữ chỉ sự nhầm lẫn, chắp vá, lắp ghép một cách lộn xộn, khập khiễng, không thể chấp nhận được."
  },
  {
    "id": "541",
    "text": "Rồng bay phượng múa",
    "meaning": "Thành ngữ chỉ cách viết chữ hoặc là cách hành văn bay bổng, phóng khoáng."
  },
  {
    "id": "542",
    "text": "Rối như tơ vò",
    "meaning": "Thành ngữ ám chỉ tâm trạng rối bời, lo lắng, bứt rứt không yên vì đang rơi vào tình trạng gặp việc khó tháo gỡ, giải quyết. Ngoài ra, thành ngữ còn dùng để chỉ tình trạng một vật, sự việc rối ren, phức tạp, khiến con người bối rối."
  },
  {
    "id": "543",
    "text": "Rút dây động rừng",
    "meaning": "Thành ngữ chỉ con người khi muốn làm việc gì đó nhưng còn e sợ sẽ đụng chạm, ảnh hưởng đến nhiều việc, nhiều người có liên quan; ngoài ra khuyên con người nên cẩn thận trước khi quyết định hành động."
  },
  {
    "id": "544",
    "text": "Rày ước mai ao",
    "meaning": "Thành ngữ nói về việc con người ngày ngày ước ao, trông ngóng một điều nào đó sẽ xảy ra."
  },
  {
    "id": "545",
    "text": "Ranh như ma",
    "meaning": "Thành ngữ nghĩa là ma lanh, tinh quái quá mức."
  },
  {
    "id": "546",
    "text": "Ra ngô ra khoai",
    "meaning": "Thành ngữ nghĩa là làm cho rõ ràng, rành mạch, không nhập nhằng, lẫn lộn."
  },
  {
    "id": "547",
    "text": "Say như điếu đổ",
    "meaning": "Thành ngữ nghĩa là yêu thích, say đắm đến mức mê mẩn, ngây dại hoặc rất ưa chuộng, thích thú."
  },
  {
    "id": "548",
    "text": "Sinh cơ lập nghiệp",
    "meaning": "Thành ngữ chỉ việc chúng ta sinh sống ổn định và xây dựng cơ đồ, sự nghiệp ở một nơi nào đó."
  },
  {
    "id": "549",
    "text": "Sinh ly tử biệt",
    "meaning": "Thành ngữ hàm ý nói về hai cảnh tượng đau đớn nhất trong cuộc đời của con người: đó là cảnh khi sống phải xa nhau và cảnh mất đi người mình yêu thương vĩnh viễn."
  },
  {
    "id": "550",
    "text": "Sơn thủy hữu tình",
    "meaning": "Thành ngữ ý chỉ cảnh vật tươi đẹp, hài hòa, thơ mộng, dễ chạm đến trái tim, xúc cảm của người nhìn"
  },
  {
    "id": "551",
    "text": "Sinh nghề tử nghiệp",
    "meaning": "Thành ngữ ám chỉ việc mỗi nghề nghiệp đều có sự khó khăn riêng, nghề nào cũng giúp người ta sống sung túc, nhưng đồng thời cũng có thể ảnh hưởng đến tính mạng, thể chất, tinh thần của người đó. Con người khi lựa chọn nghề nghiệp thì cần phải chấp nhận cả sự nguy hiểm của cái nghề."
  },
  {
    "id": "552",
    "text": "Sáng mắt ra",
    "meaning": "Thành ngữ nghĩa là cảm giác bất ngờ khi nhìn ra được sự thật, lẽ phải mà trước đó còn mơ hồ, mê muội, không nhận thấy."
  },
  {
    "id": "553",
    "text": "Sơn lam chướng khí",
    "meaning": "Thành ngữ có hàm ý chỉ vùng rừng núi có khí độc bốc lên, dễ gây bệnh tật, đau ốm cho con người."
  },
  {
    "id": "554",
    "text": "Sống để bụng chết mang theo",
    "meaning": "Thành ngữ ám chỉ việc con người suốt đời ghi nhớ, khắc sâu những tình cảm, nỗi lòng của mình. Ngoài ra, thành ngữ còn nói về việc chúng ta giữ một điều bí mật suốt cả cuộc đời."
  },
  {
    "id": "555",
    "text": "Sơn cùng thủy tận",
    "meaning": "Thành ngữ ám chỉ về một vùng đất xa xôi, hẻo lánh, hiu quạnh, ít có người đặt chân tới."
  },
  {
    "id": "556",
    "text": "Sáng tai họ, điếc tai cày",
    "meaning": "Thành ngữ nói về những người lười biếng, không muốn làm gì, khi đi làm thì chỉ chực chờ muốn nghỉ. Ngoài ra, thành ngữ còn chỉ những người khôn ngoan, tinh tường sự đời nhưng lại giả vờ như không biết gì."
  },
  {
    "id": "557",
    "text": "Sắc như dao",
    "meaning": "Thành ngữ chỉ những đồ vật có cạnh sắc bén."
  },
  {
    "id": "558",
    "text": "Sa chân lỡ bước",
    "meaning": "Thành ngữ nghĩa là sa ngã, trót làm việc không nên làm hoặc không được phép làm."
  },
  {
    "id": "559",
    "text": "Thầy bói xem voi",
    "meaning": "Thành ngữ chỉ những người có cái nhìn phiến diện, hay đoán mò, không chịu nhìn sự việc một cách toàn thể, trọn vẹn, bao quát và vội vàng đưa ra kết luận không chính xác."
  },
  {
    "id": "560",
    "text": "Tôn sư trọng đạo",
    "meaning": "Thành ngữ chỉ thái độ tôn trọng, biết ơn, tình cảm gắn bó, yêu quý của chúng ta với những người thầy giáo, cô giáo đã từng dạy dỗ chúng ta nên người."
  },
  {
    "id": "561",
    "text": "Trai cò đánh nhau, ngư ông đắc lợi",
    "meaning": "Thành ngữ ám chỉ việc hai người đấu đá nhau vì lợi ích cá nhân, nhưng rốt cuộc thì người thứ ba, người ngoài cuộc lại hưởng lợi. Bên cạnh đó, thành ngữ còn khuyên chúng ta nên biết nắm bắt thời cơ, cơ hội hiếm có."
  },
  {
    "id": "562",
    "text": "Thẳng như ruột ngựa",
    "meaning": "Thành ngữ chỉ những con người hiền lành, chân thật, ngay thẳng, không toan tính thiệt hơn, ví như sự thẳng đuột của ruột ngựa."
  },
  {
    "id": "563",
    "text": "Trắng như tuyết",
    "meaning": "Thành ngữ chỉ người, vật có nước da, màu sắc bên ngoài màu trắng tinh, không một chút vấy bẩn, ví như màu trắng của tuyết."
  },
  {
    "id": "564",
    "text": "Thua me gỡ bài cào",
    "meaning": "Thành ngữ có hàm ý nói về việc nếu chúng ta thua, thất bại ở việc này thì ta chớ nên nản chí mà hãy cố gắng gỡ gạc, chiến thắng ở những thử thách sau."
  },
  {
    "id": "565",
    "text": "Trung quân ái quốc",
    "meaning": "Thành ngữ có hàm ý nói về lòng trung thành với đức vua, người cầm quyền và tình yêu nước, quê hương của con người (theo quan niệm thời phong kiến xưa)."
  },
  {
    "id": "566",
    "text": "Trắng như trứng gà bóc",
    "meaning": "Thành ngữ chỉ con người, sự vật có vẻ bề ngoài, nước da trắng sáng, trắng tinh, ví như màu trắng của trứng gà sau khi bóc."
  },
  {
    "id": "567",
    "text": "Thiên biến vạn hóa",
    "meaning": "Thành ngữ chỉ sự biến chuyển, thay đổi nhanh chóng, linh hoạt, không thể đoán trước, lường trước được."
  },
  {
    "id": "568",
    "text": "Tre non dễ uốn",
    "meaning": "Thành ngữ ý nói về việc người lớn nên dạy dỗ, bảo ban con cái khi con còn nhỏ, bởi như vậy sẽ dễ hình thành nhân cách tốt cho con trẻ hơn."
  },
  {
    "id": "569",
    "text": "Thuận buồm xuôi gió",
    "meaning": "Thành ngữ chỉ công việc làm ăn thuận lợi, luôn gặt hái được thành công."
  },
  {
    "id": "570",
    "text": "Tam quang giả, nhật nguyệt tinh",
    "meaning": "Thành ngữ chỉ những cấu tạo, bộ phận làm nên sự sống, soi chiếu cho con người (theo quan niệm cũ), bao gồm: mặt trăng, mặt trời, ngôi sao."
  },
  {
    "id": "571",
    "text": "Ướt như chuột lội",
    "meaning": "Thành ngữ diễn tả trạng thái một người vừa đi mưa, hoặc ngã xuống nước, bị ướt lướt thướt, quần áo dính chặt vào người, như con chuột bị ướt lông."
  },
  {
    "id": "572",
    "text": "Ước sao được vậy",
    "meaning": "Thành ngữ ám chỉ việc chúng ta mong ước điều gì thì có được cái đó, đạt được điều hằng mơ ước."
  },
  {
    "id": "573",
    "text": "Vắt cổ chày ra nước",
    "meaning": "Thành ngữ có hàm ý chê bai những kẻ bủn xỉn, keo kiệt quá mức, không dám chi tiền cho cả những nhu cầu hàng ngày."
  },
  {
    "id": "574",
    "text": "Vạn sự như ý",
    "meaning": "Thành ngữ thường được dùng như một câu chúc với thành ý mong muốn người được chúc cầu gì được nấy, mọi việc suôn sẻ, thuận lợi, theo đúng ý nguyện của mình."
  },
  {
    "id": "575",
    "text": "Vạn sự khởi đầu nan",
    "meaning": "Thành ngữ nói về việc khi bắt đầu một công việc, chúng ta sẽ luôn gặp những khó khăn, thử thách ở ngay những bước đầu tiên. Nếu có kiên trì, chắc chắn ta sẽ vượt qua và đạt được thành công."
  },
  {
    "id": "576",
    "text": "Vào sinh ra tử",
    "meaning": "Thành ngữ chỉ việc xông pha nơi trận mạc nguy hiểm, luôn cận kề với cái chết."
  },
  {
    "id": "577",
    "text": "Vui như tết",
    "meaning": "Thành ngữ diễn tả không khí vui tươi, rộn ràng, sôi động, được ví như không khí, tâm trạng của mọi người vào dịp Tết."
  },
  {
    "id": "578",
    "text": "Vật đổi sao dời",
    "meaning": "Thành ngữ ý nói về sự thay đổi của mọi việc trên đời, sự đổi thay, chuyển biến của cuộc đời, xã hội."
  },
  {
    "id": "579",
    "text": "Vô thủy vô chung",
    "meaning": "Thành ngữ có hàm ý chỉ những điều vô cùng vô tận, không có điểm khởi đầu, cũng không có điểm kết thúc."
  },
  {
    "id": "580",
    "text": "Vạch áo cho người xem lưng",
    "meaning": "Thành ngữ ý chỉ việc chúng ta tự bộc lộ những nhược điểm, điều xấu xa, yếu kém của bản thân cho người khác biết. Ngoài ra, thành ngữ còn chỉ việc chúng ta tự đưa ra những lục đục, mâu thuẫn xảy ra nội bộ trong gia đình, cơ quan cho những người ngoài biết rõ."
  },
  {
    "id": "581",
    "text": "Vô pháp vô thiên",
    "meaning": "Thành ngữ nói về những kẻ hỗn láo, không biết trên biết dưới, sống không có phép tắc. Những người này thường có hành động kiêu ngạo và khinh thường người khác."
  },
  {
    "id": "582",
    "text": "Vơ đũa cả nắm",
    "meaning": "Thành ngữ chỉ những người không có sự cẩn thận trước khi đánh giá, không phân biệt được tốt xấu, hay dở, coi mọi thứ như nhau."
  },
  {
    "id": "583",
    "text": "Vung tay quá trán",
    "meaning": "Thành ngữ chỉ hành vi tiêu pha hoang phí, bừa bãi, không hợp lý, vượt ngoài khả năng tài chính của bản thân."
  },
  {
    "id": "584",
    "text": "Vụng chèo khéo chống",
    "meaning": "Thành ngữ ý nói về việc chúng ta vụng về, làm hỏng việc gì đó, nhưng lại tìm cách khống chế, bao biện lỗi sai, sự yếu kém của mình."
  },
  {
    "id": "585",
    "text": "Xấu như ma",
    "meaning": "Thành ngữ chỉ những người, vật có ngoại hình xấu xí, dị hợm, được ví với hình dạng của ma quỷ."
  },
  {
    "id": "586",
    "text": "Xuôi chèo mát mái",
    "meaning": "Thành ngữ chỉ công việc của chúng ta diễn ra thuận lợi, trôi chảy, không gặp khó khăn, cản trở nào."
  },
  {
    "id": "587",
    "text": "Xanh vỏ đỏ lòng",
    "meaning": "Thành ngữ nói về sự khác nhau giữa bản chất bên trong và vẻ bên ngoài, giữa hình thức và nội dung của mỗi người, mỗi vật."
  },
  {
    "id": "588",
    "text": "Xa thơm gần thối",
    "meaning": "Thành ngữ chỉ hiện tượng tâm lý thông thường của con người: khi ở xa nhau, ít khi gặp nhau thì luôn cảm thấy quý hóa, yêu mến nhau; còn khi đã ở gần nhau, vì va chạm, xảy ra nhiều xung đột nên sinh ra ghét bỏ, không coi nhau ra gì."
  },
  {
    "id": "589",
    "text": "Xuất đầu lộ diện",
    "meaning": "Thành ngữ nói về sự xuất hiện công khai trước công chúng, lộ mặt trước toàn thể mọi người sau một thời gian ẩn mình."
  },
  {
    "id": "590",
    "text": "Xuýt chó bụi rậm",
    "meaning": "Thành ngữ ý nói về hành động một người xua đuổi, sai khiến người khác lao vào chỗ nguy hiểm với mục đích đem lại lợi ích cho bản thân."
  },
  {
    "id": "591",
    "text": "Xa mặt cách lòng.",
    "meaning": "Thành ngữ ám chỉ việc những cặp đôi khi yêu xa thì thường sinh ra tâm lí đa nghi, giận hờn vô cớ, dẫn đến tình tan vỡ."
  },
  {
    "id": "592",
    "text": "Yếu như sên",
    "meaning": "Thành ngữ nói về những người có sức khỏe yếu, hay ốm đau, trông rất yếu ớt, ví như sự yếu đuối của con sên."
  },
  {
    "id": "593",
    "text": "Yêu nhau lắm, cắn nhau đau",
    "meaning": "Thành ngữ ý chỉ con người càng yêu thương nhau nhiều thì sau chia tay hay xảy ra mâu thuẫn lại càng ghét bỏ, thù hằn nhau hơn."
  },
  {
    "id": "594",
    "text": "Y cẩm hồi hương",
    "meaning": "Thành ngữ ý chỉ những con người có sự nghiệp phát triển, thi cử đỗ đạt. Ngoài ra, thành ngữ còn chỉ những người đi xa chờ lúc giàu có mới trở về quê hương."
  },
  {
    "id": "595",
    "text": "Yêu nước thương nòi",
    "meaning": "Thành ngữ ám chỉ tình yêu của chúng ta với đất nước, đồng loại, nòi giống. Đây là thứ tình cảm vô cùng cao quý trong mỗi con người."
  },
  {
    "id": "596",
    "text": "Y phục xứng kỳ đức",
    "meaning": "Thành ngữ có hàm ý khuyên chúng ta cần ăn mặc, xử sự, hành động sao cho phù hợp với thời điểm và giá trị, vị trí bản thân."
  },
  {
    "id": "597",
    "text": "Ngang như cua",
    "meaning": "Thành ngữ ám chỉ những kẻ bướng bỉnh, bảo thủ, không chịu tiếp thu ý kiến người khác mà chỉ khăng khăng làm theo ý của mình."
  }
]